Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
;******************** (C) Yifeng ZHU *******************************************
; @file    STM32L4R5xx_constants.s
; @author  Yifeng Zhu
; @date    Jan-24-2020
; @note
;           This code is for the book "Embedded Systems with ARM Cortex-M 
;           Microcontrollers in Assembly Language and C, Yifeng Zhu, 
;           ISBN-13: 978-0982692639, ISBN-10: 0982692633
; @attension
;           This code is provided for education purpose. The author shall not be 
;           held liable for any direct, indirect or consequential damages, for any 
;           reason whatever. More information can be found from book website: 
;           http:;www.eece.maine.edu/~zhu/book
;*******************************************************************************



				
; Configuration of the Cortex-M4 Processor and Core Peripherals

__CM4_REV           EQU 0x0001  ; Cortex-M4 revision r0p1
__MPU_PRESENT       EQU 1       ; STM32L4XX provides an MPU
__NVIC_PRIO_BITS    EQU 4       ; STM32L4XX uses 4 Bits for the Priority Levels
__Vendor_SysTickConfig      EQU 0       ; Set to 1 if different SysTick Config is used
__FPU_PRESENT       EQU 1       ; FPU present

;  STM32L4XX Interrupt Number Definition, according to the selected device

; ******  Cortex-M4 Processor Exceptions Numbers ***************************************************************
NonMaskableInt_IRQn EQU  -14    ; 2 Non Maskable Interrupt
HardFault_IRQn      EQU  -13    ; 4 Cortex-M4 Memory Management Interrupt
MemoryManagement_IRQn       EQU  -12    ; 4 Cortex-M4 Memory Management Interrupt
BusFault_IRQn       EQU  -11    ; 5 Cortex-M4 Bus Fault Interrupt
UsageFault_IRQn     EQU  -10    ; 6 Cortex-M4 Usage Fault Interrupt
SVCall_IRQn         EQU  -5     ; 11 Cortex-M4 SV Call Interrupt
DebugMonitor_IRQn   EQU  -4     ; 12 Cortex-M4 Debug Monitor Interrupt
PendSV_IRQn         EQU  -2     ; 14 Cortex-M4 Pend SV Interrupt
SysTick_IRQn        EQU  -1     ; 15 Cortex-M4 System Tick Interrupt
; ******  STM32 specific Interrupt Numbers *********************************************************************
WWDG_IRQn           EQU  0      ; Window WatchDog Interrupt
PVD_PVM_IRQn        EQU  1      ; PVD/PVM1/PVM2/PVM3/PVM4 through EXTI Line detection Interrupts
TAMP_STAMP_IRQn     EQU  2      ; Tamper and TimeStamp interrupts through the EXTI line
RTC_WKUP_IRQn       EQU  3      ; RTC Wakeup interrupt through the EXTI line
FLASH_IRQn          EQU  4      ; FLASH global Interrupt
RCC_IRQn            EQU  5      ; RCC global Interrupt
EXTI0_IRQn          EQU  6      ; EXTI Line0 Interrupt
EXTI1_IRQn          EQU  7      ; EXTI Line1 Interrupt
EXTI2_IRQn          EQU  8      ; EXTI Line2 Interrupt
EXTI3_IRQn          EQU  9      ; EXTI Line3 Interrupt
EXTI4_IRQn          EQU  10     ; EXTI Line4 Interrupt
DMA1_Channel1_IRQn  EQU  11     ; DMA1 Channel 1 global Interrupt
DMA1_Channel2_IRQn  EQU  12     ; DMA1 Channel 2 global Interrupt
DMA1_Channel3_IRQn  EQU  13     ; DMA1 Channel 3 global Interrupt
DMA1_Channel4_IRQn  EQU  14     ; DMA1 Channel 4 global Interrupt
DMA1_Channel5_IRQn  EQU  15     ; DMA1 Channel 5 global Interrupt
DMA1_Channel6_IRQn  EQU  16     ; DMA1 Channel 6 global Interrupt
DMA1_Channel7_IRQn  EQU  17     ; DMA1 Channel 7 global Interrupt
ADC1_IRQn         EQU  18     ; ADC1, ADC2 SAR global Interrupts
CAN1_TX_IRQn        EQU  19     ; CAN1 TX Interrupt
CAN1_RX0_IRQn       EQU  20     ; CAN1 RX0 Interrupt
CAN1_RX1_IRQn       EQU  21     ; CAN1 RX1 Interrupt
CAN1_SCE_IRQn       EQU  22     ; CAN1 SCE Interrupt
EXTI9_5_IRQn        EQU  23     ; External Line[9:5] Interrupts
TIM1_BRK_TIM15_IRQn EQU  24     ; TIM1 Break interrupt and TIM15 global interrupt
TIM1_UP_TIM16_IRQn  EQU  25     ; TIM1 Update Interrupt and TIM16 global interrupt
TIM1_TRG_COM_TIM17_IRQn     EQU  26     ; TIM1 Trigger and Commutation Interrupt and TIM17 global interrupt
TIM1_CC_IRQn        EQU  27     ; TIM1 Capture Compare Interrupt
TIM2_IRQn           EQU  28     ; TIM2 global Interrupt
TIM3_IRQn           EQU  29     ; TIM3 global Interrupt
TIM4_IRQn           EQU  30     ; TIM4 global Interrupt
I2C1_EV_IRQn        EQU  31     ; I2C1 Event Interrupt
I2C1_ER_IRQn        EQU  32     ; I2C1 Error Interrupt
I2C2_EV_IRQn        EQU  33     ; I2C2 Event Interrupt
I2C2_ER_IRQn        EQU  34     ; I2C2 Error Interrupt
SPI1_IRQn           EQU  35     ; SPI1 global Interrupt
SPI2_IRQn           EQU  36     ; SPI2 global Interrupt
USART1_IRQn         EQU  37     ; USART1 global Interrupt
USART2_IRQn         EQU  38     ; USART2 global Interrupt
USART3_IRQn         EQU  39     ; USART3 global Interrupt
EXTI15_10_IRQn      EQU  40     ; External Line[15:10] Interrupts
RTC_Alarm_IRQn      EQU  41     ; RTC Alarm (A and B) through EXTI Line Interrupt
DFSDM3_IRQn         EQU  42     ; SD Filter 3 global Interrupt
TIM8_BRK_IRQn       EQU  43     ; TIM8 Break Interrupt
TIM8_UP_IRQn        EQU  44     ; TIM8 Update Interrupt
TIM8_TRG_COM_IRQn   EQU  45     ; TIM8 Trigger and Commutation Interrupt
TIM8_CC_IRQn        EQU  46     ; TIM8 Capture Compare Interrupt
Reserved_IRQn       EQU  47     ; ADC3 global  Interrupt
FMC_IRQn            EQU  48     ; FMC global Interrupt
SDMMC1_IRQn         EQU  49     ; SDMMC1 global Interrupt
TIM5_IRQn           EQU  50     ; TIM5 global Interrupt
SPI3_IRQn           EQU  51     ; SPI3 global Interrupt
UART4_IRQn          EQU  52     ; UART4 global Interrupt
UART5_IRQn          EQU  53     ; UART5 global Interrupt
TIM6_DAC_IRQn       EQU  54     ; TIM6 global and DAC1&2 underrun error  interrupts
TIM7_IRQn           EQU  55     ; TIM7 global interrupt
DMA2_Channel1_IRQn  EQU  56     ; DMA2 Channel 1 global Interrupt
DMA2_Channel2_IRQn  EQU  57     ; DMA2 Channel 2 global Interrupt
DMA2_Channel3_IRQn  EQU  58     ; DMA2 Channel 3 global Interrupt
DMA2_Channel4_IRQn  EQU  59     ; DMA2 Channel 4 global Interrupt
DMA2_Channel5_IRQn  EQU  60     ; DMA2 Channel 5 global Interrupt
DFSDM0_IRQn         EQU  61     ; SD Filter 0 global Interrupt
DFSDM1_IRQn         EQU  62     ; SD Filter 1 global Interrupt
DFSDM2_IRQn         EQU  63     ; SD Filter 2 global Interrupt
COMP_IRQn           EQU  64     ; COMP1 and COMP2 Interrupts
LPTIM1_IRQn         EQU  65     ; LP TIM1 interrupt
LPTIM2_IRQn         EQU  66     ; LP TIM2 interrupt
OTG_FS_IRQn         EQU  67     ; USB OTG FS global Interrupt
DMA2_Channel6_IRQn  EQU  68     ; DMA2 Channel 6 global interrupt
DMA2_Channel7_IRQn  EQU  69     ; DMA2 Channel 7 global interrupt
LPUART1_IRQn        EQU  70     ; LP UART1 interrupt
OCTOSPI1_IRQn        EQU  71     ; Quad SPI global interrupt
I2C3_EV_IRQn        EQU  72     ; I2C3 event interrupt
I2C3_ER_IRQn        EQU  73     ; I2C3 error interrupt
SAI1_IRQn           EQU  74     ; Serial Audio Interface 1 global interrupt
SAI2_IRQn           EQU  75     ; Serial Audio Interface 2 global interrupt
OCTOSPI2_IRQn         EQU  76     ; Serial Wire Interface 1 global interrupt
TSC_IRQn            EQU  77     ; Touch Sense Controller global interrupt
DSIHSOT_IRQn            EQU  78     ; LCD global interrupt
AES_IRQn			EQU	 79
RNG_IRQn            EQU  80     ; RNG global interrupt
FPU_IRQn            EQU  81     ; FPU global interrupt
HASH_CRS_IRQn		EQU  82
I2C4_ER_IRQn		EQU  83
I2C4_EV_IRQn		EQU  84
DCMI_IRQn			EQU  85
DMA2D_IRQn			EQU  90
LCD_TFT_IRQn		EQU  91
LCD_TFT_ER_IRQn		EQU  92
GFXMMU_IRQn			EQU  93
DMAMUX1_OVR_IRQn	EQU  94
; Analog to Digital Converter
ADC_ISR  EQU  0x00   ; ADC Interrupt and Status Register,                 Address offset: 0x00
ADC_IER  EQU  0x04   ; ADC Interrupt Enable Register,                     Address offset: 0x04
ADC_CR   EQU  0x08   ; ADC control register,                              Address offset: 0x08
ADC_CFGR EQU  0x0C   ; ADC Configuration register,                        Address offset: 0x0C
ADC_CFGR2        EQU  0x10   ; ADC Configuration register 2,                      Address offset: 0x10
ADC_SMPR1        EQU  0x14   ; ADC sample time register 1,                        Address offset: 0x14
ADC_SMPR2        EQU  0x18   ; ADC sample time register 2,                        Address offset: 0x18
ADC_RESERVED1    EQU  0x1C   ; Reserved, 0x01C
ADC_TR1  EQU  0x20   ; ADC watchdog threshold register 1,                 Address offset: 0x20
ADC_TR2  EQU  0x24   ; ADC watchdog threshold register 2,                 Address offset: 0x24
ADC_TR3  EQU  0x28   ; ADC watchdog threshold register 3,                 Address offset: 0x28
ADC_RESERVED2    EQU  0x2C   ; Reserved, 0x02C
ADC_SQR1 EQU  0x30   ; ADC regular sequence register 1,                   Address offset: 0x30
ADC_SQR2 EQU  0x34   ; ADC regular sequence register 2,                   Address offset: 0x34
ADC_SQR3 EQU  0x38   ; ADC regular sequence register 3,                   Address offset: 0x38
ADC_SQR4 EQU  0x3C   ; ADC regular sequence register 4,                   Address offset: 0x3C
ADC_DR   EQU  0x40   ; ADC regular data register,                         Address offset: 0x40
ADC_RESERVED3    EQU  0x44   ; Reserved, 0x044
ADC_RESERVED4    EQU  0x48   ; Reserved, 0x048
ADC_JSQR EQU  0x4C   ; ADC injected sequence register,                    Address offset: 0x4C
ADC_RESERVED5    EQU  0x50   ; Reserved, 0x050 - 0x05C
ADC_OFR1 EQU  0x60   ; ADC offset register 1,                             Address offset: 0x60
ADC_OFR2 EQU  0x64   ; ADC offset register 2,                             Address offset: 0x64
ADC_OFR3 EQU  0x68   ; ADC offset register 3,                             Address offset: 0x68
ADC_OFR4 EQU  0x6C   ; ADC offset register 4,                             Address offset: 0x6C
ADC_RESERVED6    EQU  0x70   ; Reserved, 0x070 - 0x07C
ADC_JDR1 EQU  0x80   ; ADC injected data register 1,                      Address offset: 0x80
ADC_JDR2 EQU  0x84   ; ADC injected data register 2,                      Address offset: 0x84
ADC_JDR3 EQU  0x88   ; ADC injected data register 3,                      Address offset: 0x88
ADC_JDR4 EQU  0x8C   ; ADC injected data register 4,                      Address offset: 0x8C
ADC_RESERVED7    EQU  0x90   ; Reserved, 0x090 - 0x09C
ADC_AWD2CR       EQU  0xA0   ; ADC  Analog Watchdog 2 Configuration Register,     Address offset: 0xA0
ADC_AWD3CR       EQU  0xA4   ; ADC  Analog Watchdog 3 Configuration Register,     Address offset: 0xA4
ADC_RESERVED8    EQU  0xA8   ; Reserved, 0x0A8
ADC_RESERVED9    EQU  0xAC   ; Reserved, 0x0AC
ADC_DIFSEL       EQU  0xB0   ; ADC  Differential Mode Selection Register,         Address offset: 0xB0
ADC_CALFACT      EQU  0xB4   ; ADC  Calibration Factors,                          Address offset: 0xB4

