Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
ADC_CSR  EQU  0x300  ; ADC Common status register,                  Address offset: ADC1 base address + 0x300
ADC_RESERVED     EQU  0x304  ; Reserved, ADC1 base address + 0x304
ADC_CCR  EQU  0x308  ; ADC common control register,                 Address offset: ADC1 base address + 0x308
ADC_CDR  EQU  0x30C  ; ADC common regular data register for dual    Address offset: ADC1 base address + 0x30C


; Controller Area Network TxMailBox
CAN_TxMailBox_TIR     EQU 0x00  ; CAN TX mailbox identifier register
CAN_TxMailBox_TDTR    EQU 0x04  ; CAN mailbox data length control and time stamp register
CAN_TxMailBox_TDLR    EQU 0x08  ; CAN mailbox data low register
CAN_TxMailBox_TDHR    EQU 0x0C  ; CAN mailbox data high register

; Controller Area Network FIFOMailBox
CAN_FIFOMailBox_RIR   EQU 0x00  ; CAN receive FIFO mailbox identifier register
CAN_FIFOMailBox_RDTR  EQU 0x04  ; CAN receive FIFO mailbox data length control and time stamp register
CAN_FIFOMailBox_RDLR  EQU 0x08  ; CAN receive FIFO mailbox data low register
CAN_FIFOMailBox_RDHR  EQU 0x0C  ; CAN receive FIFO mailbox data high register


; Controller Area Network FilterRegister
CAN_FilterRegister_FR1 EQU 0x00 ; CAN Filter bank register 1
CAN_FilterRegister_FR2 EQU 0x04 ; CAN Filter bank register 1

; Controller Area Network
CAN_MCR    EQU  0x00     ; CAN master control register,         Address offset: 0x00
CAN_MSR    EQU  0x04     ; CAN master status register,          Address offset: 0x04
CAN_TSR    EQU  0x08     ; CAN transmit status register,        Address offset: 0x08
CAN_RF0R   EQU  0x0C     ; CAN receive FIFO 0 register,         Address offset: 0x0C
CAN_RF1R   EQU  0x10     ; CAN receive FIFO 1 register,         Address offset: 0x10
CAN_IER    EQU  0x14     ; CAN interrupt enable register,       Address offset: 0x14
CAN_ESR    EQU  0x18     ; CAN error status register,           Address offset: 0x18
CAN_BTR    EQU  0x1C     ; CAN bit timing register,             Address offset: 0x1C

CAN_RESERVED0      EQU  0x20     ; Reserved, 0x020 - 0x17F

CAN_TxMailBox0     EQU  0x180    ; CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC
CAN_TxMailBox1     EQU  0x190    ; CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC
CAN_TxMailBox2     EQU  0x1A0    ; CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC

CAN_FIFOMailBox0   EQU  0x1B0    ; CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC
CAN_FIFOMailBox1   EQU  0x1C0    ; CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC

CAN_RESERVED1      EQU  0x1D0    ; Reserved, 0x1D0 - 0x1FF

CAN_FMR    EQU  0x200    ; CAN filter master register,          Address offset: 0x200
CAN_FM1R   EQU  0x204    ; CAN filter mode register,            Address offset: 0x204
CAN_RESERVED2      EQU  0x208    ; Reserved, 0x208
CAN_FS1R   EQU  0x20C    ; CAN filter scale register,           Address offset: 0x20C
CAN_RESERVED3      EQU  0x210    ; Reserved, 0x210
CAN_FFA1R  EQU  0x214    ; CAN filter FIFO assignment register, Address offset: 0x214
CAN_RESERVED4      EQU  0x218    ; Reserved, 0x218
CAN_FA1R   EQU  0x21C    ; CAN filter activation register,      Address offset: 0x21C
CAN_RESERVED5      EQU  0x220    ; Reserved, 0x220-0x23F
CAN_FilterRegister EQU  0x240    ; CAN Filter Register,                 Address offset: 0x240-0x31C



; Comparator
COMP1_CSR       EQU  0x00 ; COMP comparator control and status register, Address offset: 0x00
COMP2_CSR       EQU  0x04 ; COMP comparator control and status register, Address offset: 0x00
	

; CRC calculation unit
CRC_DR EQU  0x00      ; CRC Data register,                           Address offset: 0x00
CRC_IDR        EQU  0x04      ; CRC Independent data register,               Address offset: 0x04
CRC_RESERVED0  EQU  0x05      ; Reserved,                                                    0x05
CRC_RESERVED1  EQU  0x06      ; Reserved,                                                    0x06
CRC_CR EQU  0x08      ; CRC Control register,                        Address offset: 0x08
CRC_RESERVED2  EQU  0x0C      ; Reserved,                                                    0x0C
CRC_INIT       EQU  0x10      ; Initial CRC value register,                  Address offset: 0x10
CRC_POL        EQU  0x14      ; CRC polynomial register,                     Address offset: 0x14


; Digital to Analog Converter
DAC_CR EQU  0x00  ; DAC control register,                                    Address offset: 0x00
DAC_SWTRGR     EQU  0x04  ; DAC software trigger register,                           Address offset: 0x04
DAC_DHR12R1    EQU  0x08  ; DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08
DAC_DHR12L1    EQU  0x0C  ; DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C
DAC_DHR8R1     EQU  0x10  ; DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10
DAC_DHR12R2    EQU  0x14  ; DAC channel2 12-bit right aligned data holding register, Address offset: 0x14
DAC_DHR12L2    EQU  0x18  ; DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18
DAC_DHR8R2     EQU  0x1C  ; DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C
DAC_DHR12RD    EQU  0x20  ; Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20
DAC_DHR12LD    EQU  0x24  ; DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24
DAC_DHR8RD     EQU  0x28  ; DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28
DAC_DOR1       EQU  0x2C  ; DAC channel1 data output register,                       Address offset: 0x2C
DAC_DOR2       EQU  0x30  ; DAC channel2 data output register,                       Address offset: 0x30
DAC_SR EQU  0x34  ; DAC status register,                                     Address offset: 0x34
DAC_CCR        EQU  0x38  ; DAC calibration control register,                        Address offset: 0x38
DAC_MCR        EQU  0x3C  ; DAC mode control register,                               Address offset: 0x3C
DAC_SHSR1      EQU  0x40  ; DAC Sample and Hold sample time register 1,              Address offset: 0x40
DAC_SHSR2      EQU  0x44  ; DAC Sample and Hold sample time register 2,              Address offset: 0x44
DAC_SHHR       EQU  0x48  ; DAC Sample and Hold hold time register,                  Address offset: 0x48
DAC_SHRR       EQU  0x4C  ; DAC Sample and Hold refresh time register,               Address offset: 0x4C

; DFSDM module registers
DFSDM_FLT0CR1     EQU  0x100   ; DFSDM control register1,                          Address offset: 0x100
DFSDM_FLT0CR2     EQU  0x104   ; DFSDM control register2,                          Address offset: 0x104
DFSDM_FLT0ISR     EQU  0x108   ; DFSDM interrupt and status register,              Address offset: 0x108
DFSDM_FLT0ICR     EQU  0x10C   ; DFSDM interrupt flag clear register,              Address offset: 0x10C
DFSDM_FLT0JCHGR   EQU  0x110   ; DFSDM injected channel group selection register,  Address offset: 0x110
DFSDM_FLT0FCR     EQU  0x114   ; DFSDM filter control register,                    Address offset: 0x114
DFSDM_FLT0JDATAR  EQU  0x118   ; DFSDM data register for injected group,           Address offset: 0x118
DFSDM_FLT0RDATAR  EQU  0x11C   ; DFSDM data register for regular group,            Address offset: 0x11C
DFSDM_FLT0AWHTR   EQU  0x120   ; DFSDM analog watchdog high threshold register,    Address offset: 0x120
DFSDM_FLT0AWLTR   EQU  0x124   ; DFSDM analog watchdog low threshold register,     Address offset: 0x124
DFSDM_FLT0AWSR    EQU  0x128   ; DFSDM analog watchdog status register             Address offset: 0x128
DFSDM_FLT0AWCFR   EQU  0x12C   ; DFSDM analog watchdog clear flag register         Address offset: 0x12C
DFSDM_FLT0EXMAX   EQU  0x130   ; DFSDM extreme detector maximum register,          Address offset: 0x130
DFSDM_FLT0EXMIN   EQU  0x134   ; DFSDM extreme detector minimum register           Address offset: 0x134
DFSDM_FLT0CNVTIMR EQU  0x138   ; DFSDM conversion timer,                           Address offset: 0x138
;
DFSDM_FLT1CR1     EQU  0x180   ; DFSDM control register1,                          Address offset: 0x100
DFSDM_FLT1CR2     EQU  0x184   ; DFSDM control register2,                          Address offset: 0x104
DFSDM_FLT1ISR     EQU  0x188   ; DFSDM interrupt and status register,              Address offset: 0x108
DFSDM_FLT1ICR     EQU  0x18C   ; DFSDM interrupt flag clear register,              Address offset: 0x10C
DFSDM_FLT1JCHGR   EQU  0x190   ; DFSDM injected channel group selection register,  Address offset: 0x110
DFSDM_FLT1FCR     EQU  0x194   ; DFSDM filter control register,                    Address offset: 0x114
DFSDM_FLT1JDATAR  EQU  0x198   ; DFSDM data register for injected group,           Address offset: 0x118
DFSDM_FLT1RDATAR  EQU  0x19C   ; DFSDM data register for regular group,            Address offset: 0x11C
DFSDM_FLT1AWHTR   EQU  0x1A0   ; DFSDM analog watchdog high threshold register,    Address offset: 0x120
DFSDM_FLT1AWLTR   EQU  0x1A4   ; DFSDM analog watchdog low threshold register,     Address offset: 0x124
DFSDM_FLT1AWSR    EQU  0x1A8   ; DFSDM analog watchdog status register             Address offset: 0x128
DFSDM_FLT1AWCFR   EQU  0x1AC   ; DFSDM analog watchdog clear flag register         Address offset: 0x12C
DFSDM_FLT1EXMAX   EQU  0x1B0   ; DFSDM extreme detector maximum register,          Address offset: 0x130
DFSDM_FLT1EXMIN   EQU  0x1B4   ; DFSDM extreme detector minimum register           Address offset: 0x134
DFSDM_FLT1CNVTIMR EQU  0x1B8   ; DFSDM conversion timer,                           Address offset: 0x138
;
DFSDM_FLT2CR1     EQU  0x200   ; DFSDM control register1,                          Address offset: 0x100
DFSDM_FLT2CR2     EQU  0x204   ; DFSDM control register2,                          Address offset: 0x104
DFSDM_FLT2ISR     EQU  0x208   ; DFSDM interrupt and status register,              Address offset: 0x108
DFSDM_FLT2ICR     EQU  0x20C   ; DFSDM interrupt flag clear register,              Address offset: 0x10C
DFSDM_FLT2JCHGR   EQU  0x210   ; DFSDM injected channel group selection register,  Address offset: 0x110
DFSDM_FLT2FCR     EQU  0x214   ; DFSDM filter control register,                    Address offset: 0x114
DFSDM_FLT2JDATAR  EQU  0x218   ; DFSDM data register for injected group,           Address offset: 0x118
DFSDM_FLT2RDATAR  EQU  0x21C   ; DFSDM data register for regular group,            Address offset: 0x11C
DFSDM_FLT2AWHTR   EQU  0x220   ; DFSDM analog watchdog high threshold register,    Address offset: 0x120
DFSDM_FLT2AWLTR   EQU  0x224   ; DFSDM analog watchdog low threshold register,     Address offset: 0x124
DFSDM_FLT2AWSR    EQU  0x228   ; DFSDM analog watchdog status register             Address offset: 0x128
DFSDM_FLT2AWCFR   EQU  0x22C   ; DFSDM analog watchdog clear flag register         Address offset: 0x12C
DFSDM_FLT2EXMAX   EQU  0x230   ; DFSDM extreme detector maximum register,          Address offset: 0x130
DFSDM_FLT2EXMIN   EQU  0x234   ; DFSDM extreme detector minimum register           Address offset: 0x134
DFSDM_FLT2CNVTIMR EQU  0x238   ; DFSDM conversion timer,                           Address offset: 0x138
;
DFSDM_FLT3CR1     EQU  0x280   ; DFSDM control register1,                          Address offset: 0x100
DFSDM_FLT3CR2     EQU  0x284   ; DFSDM control register2,                          Address offset: 0x104
DFSDM_FLT3ISR     EQU  0x288   ; DFSDM interrupt and status register,              Address offset: 0x108
DFSDM_FLT3ICR     EQU  0x28C   ; DFSDM interrupt flag clear register,              Address offset: 0x10C
DFSDM_FLT3JCHGR   EQU  0x290   ; DFSDM injected channel group selection register,  Address offset: 0x110
DFSDM_FLT3FCR     EQU  0x294   ; DFSDM filter control register,                    Address offset: 0x114
DFSDM_FLT3JDATAR  EQU  0x298   ; DFSDM data register for injected group,           Address offset: 0x118
DFSDM_FLT3RDATAR  EQU  0x29C   ; DFSDM data register for regular group,            Address offset: 0x11C
DFSDM_FLT3AWHTR   EQU  0x2A0   ; DFSDM analog watchdog high threshold register,    Address offset: 0x120
DFSDM_FLT3AWLTR   EQU  0x2A4   ; DFSDM analog watchdog low threshold register,     Address offset: 0x124
DFSDM_FLT3AWSR    EQU  0x2A8   ; DFSDM analog watchdog status register             Address offset: 0x128
DFSDM_FLT3AWCFR   EQU  0x2AC   ; DFSDM analog watchdog clear flag register         Address offset: 0x12C
DFSDM_FLT3EXMAX   EQU  0x2B0   ; DFSDM extreme detector maximum register,          Address offset: 0x130
DFSDM_FLT3EXMIN   EQU  0x2B4   ; DFSDM extreme detector minimum register           Address offset: 0x134
DFSDM_FLT3CNVTIMR EQU  0x2B8   ; DFSDM conversion timer,                           Address offset: 0x138

