Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; DFSDM channel configuration registers
DFSDM_CH0CFGR1    EQU  0x00  ; DFSDM channel configuration register1,            Address offset: 0x00
DFSDM_CH0CFGR2    EQU  0x04  ; DFSDM channel configuration register2,            Address offset: 0x04
DFSDM_CH0AWSCDR     EQU  0x08   ; DFSDM channel analog watchdog and short circuit detector register,                  Address offset: 0x08
DFSDM_CH0WDATAR   EQU  0x0C ; DFSDM channel watchdog filter data register,      Address offset: 0x0C
DFSDM_CH0DATINR   EQU  0x10 ; DFSDM channel data input register,                Address offset: 0x10
DFSDM_CH0DLYR	 EQU   0x14
;
DFSDM_CH1CFGR1    EQU  0x20  ; DFSDM channel configuration register1,            Address offset: 0x00
DFSDM_CH1CFGR2    EQU  0x24  ; DFSDM channel configuration register2,            Address offset: 0x04
DFSDM_CH1AWSCDR     EQU  0x28   ; DFSDM channel analog watchdog and short circuit detector register,                  Address offset: 0x08
DFSDM_CH1WDATAR   EQU  0x2C ; DFSDM channel watchdog filter data register,      Address offset: 0x0C
DFSDM_CH1DATINR   EQU  0x30 ; DFSDM channel data input register,                Address offset: 0x10
DFSDM_CH1DLYR	 EQU   0x34
;
DFSDM_CH2CFGR1    EQU  0x40  ; DFSDM channel configuration register1,            Address offset: 0x00
DFSDM_CH2CFGR2    EQU  0x44  ; DFSDM channel configuration register2,            Address offset: 0x04
DFSDM_CH2AWSCDR     EQU  0x48   ; DFSDM channel analog watchdog and short circuit detector register,                  Address offset: 0x08
DFSDM_CH2WDATAR   EQU  0x4C ; DFSDM channel watchdog filter data register,      Address offset: 0x0C
DFSDM_CH2DATINR   EQU  0x50 ; DFSDM channel data input register,                Address offset: 0x10
DFSDM_CH2DLYR	 EQU   0x54
;
DFSDM_CH3CFGR1    EQU  0x60  ; DFSDM channel configuration register1,            Address offset: 0x00
DFSDM_CH3CFGR2    EQU  0x64  ; DFSDM channel configuration register2,            Address offset: 0x04
DFSDM_CH3AWSCDR     EQU  0x68   ; DFSDM channel analog watchdog and short circuit detector register,                  Address offset: 0x08
DFSDM_CH3WDATAR   EQU  0x6C ; DFSDM channel watchdog filter data register,      Address offset: 0x0C
DFSDM_CH3DATINR   EQU  0x70 ; DFSDM channel data input register,                Address offset: 0x10
DFSDM_CH3DLYR	 EQU   0x74
;
DFSDM_CH4CFGR1    EQU  0x80  ; DFSDM channel configuration register1,            Address offset: 0x00
DFSDM_CH4CFGR2    EQU  0x84  ; DFSDM channel configuration register2,            Address offset: 0x04
DFSDM_CH4AWSCDR     EQU  0x88   ; DFSDM channel analog watchdog and short circuit detector register,                  Address offset: 0x08
DFSDM_CH4WDATAR   EQU  0x8C ; DFSDM channel watchdog filter data register,      Address offset: 0x0C
DFSDM_CH4DATINR   EQU  0x90 ; DFSDM channel data input register,                Address offset: 0x10
DFSDM_CH4DLYR	 EQU   0x94
;
DFSDM_CH5CFGR1    EQU  0xA0  ; DFSDM channel configuration register1,            Address offset: 0x00
DFSDM_CH5CFGR2    EQU  0xA4  ; DFSDM channel configuration register2,            Address offset: 0x04
DFSDM_CH5AWSCDR     EQU  0xA8   ; DFSDM channel analog watchdog and short circuit detector register,                  Address offset: 0x08
DFSDM_CH5WDATAR   EQU  0xAC ; DFSDM channel watchdog filter data register,      Address offset: 0x0C
DFSDM_CH5DATINR   EQU  0xB0 ; DFSDM channel data input register,                Address offset: 0x10
DFSDM_CH5DLYR	 EQU   0xB4
;
DFSDM_CH6CFGR1    EQU  0xC0  ; DFSDM channel configuration register1,            Address offset: 0x00
DFSDM_CH6CFGR2    EQU  0xC4  ; DFSDM channel configuration register2,            Address offset: 0x04
DFSDM_CH6AWSCDR     EQU  0xC8   ; DFSDM channel analog watchdog and short circuit detector register,                  Address offset: 0x08
DFSDM_CH6WDATAR   EQU  0xCC ; DFSDM channel watchdog filter data register,      Address offset: 0x0C
DFSDM_CH6DATINR   EQU  0xD0 ; DFSDM channel data input register,                Address offset: 0x10
DFSDM_CH6DLYR	 EQU   0xD4
;
DFSDM_CH7CFGR1    EQU  0xE0  ; DFSDM channel configuration register1,            Address offset: 0x00
DFSDM_CH7CFGR2    EQU  0xE4  ; DFSDM channel configuration register2,            Address offset: 0x04
DFSDM_CH7AWSCDR     EQU  0xE8   ; DFSDM channel analog watchdog and short circuit detector register,                  Address offset: 0x08
DFSDM_CH7WDATAR   EQU  0xEC ; DFSDM channel watchdog filter data register,      Address offset: 0x0C
DFSDM_CH7DATINR   EQU  0xF0 ; DFSDM channel data input register,                Address offset: 0x10
DFSDM_CH7DLYR	 EQU   0xF4
;
; Debug MCU
DBGMCU_IDCODE    EQU  0x00   ; MCU device ID code,                 Address offset: 0x00
DBGMCU_CR        EQU  0x04   ; Debug MCU configuration register,   Address offset: 0x04
DBGMCU_APB1FZR1  EQU  0x08   ; Debug MCU APB1 freeze register 1,   Address offset: 0x08
DBGMCU_APB1FZR2  EQU  0x0C   ; Debug MCU APB1 freeze register 2,   Address offset: 0x0C
DBGMCU_APB2FZ    EQU  0x10   ; Debug MCU APB2 freeze register,     Address offset: 0x10


; DMA Controller
DMA_Channel_CCR    EQU  0x00  ; DMA channel x configuration register
DMA_Channel_CNDTR  EQU  0x04  ; DMA channel x number of data register
DMA_Channel_CPAR   EQU  0x08  ; DMA channel x peripheral address register
DMA_Channel_CMAR   EQU  0x0C  ; DMA channel x memory address register

DMA_ISR    EQU  0x00  ; DMA interrupt status register,                 Address offset: 0x00
DMA_IFCR   EQU  0x04  ; DMA interrupt flag clear register,             Address offset: 0x04

DMA_Request_CSELR  EQU  0x00  ; DMA option register,                           Address offset: 0x00

; External Interrupt/Event Controller
EXTI_IMR1        EQU  0x00     ; EXTI Interrupt mask register 1,             Address offset: 0x00
EXTI_EMR1        EQU  0x04     ; EXTI Event mask register 1,                 Address offset: 0x04
EXTI_RTSR1       EQU  0x08     ; EXTI Rising trigger selection register 1,   Address offset: 0x08
EXTI_FTSR1       EQU  0x0C     ; EXTI Falling trigger selection register 1,  Address offset: 0x0C
EXTI_SWIER1      EQU  0x10     ; EXTI Software interrupt event register 1,   Address offset: 0x10
EXTI_PR1 EQU  0x14     ; EXTI Pending register 1,                    Address offset: 0x14
EXTI_RESERVED1   EQU  0x18     ; Reserved, 0x18
EXTI_RESERVED2   EQU  0x1C     ; Reserved, 0x1C
EXTI_IMR2        EQU  0x20     ; EXTI Interrupt mask register 2,             Address offset: 0x20
EXTI_EMR2        EQU  0x24     ; EXTI Event mask register 2,                 Address offset: 0x24
EXTI_RTSR2       EQU  0x28     ; EXTI Rising trigger selection register 2,   Address offset: 0x28
EXTI_FTSR2       EQU  0x2C     ; EXTI Falling trigger selection register 2,  Address offset: 0x2C
EXTI_SWIER2      EQU  0x30     ; EXTI Software interrupt event register 2,   Address offset: 0x30
EXTI_PR2 EQU  0x34     ; EXTI Pending register 2,                    Address offset: 0x34

; Firewall
FIREWALL_CSSA       EQU  0x00  ; Code Segment Start Address register,               Address offset: 0x00
FIREWALL_CSL        EQU  0x04  ; Code Segment Length register,                      Address offset: 0x04
FIREWALL_NVDSSA     EQU  0x08  ; NON volatile data Segment Start Address register,  Address offset: 0x08
FIREWALL_NVDSL      EQU  0x0C  ; NON volatile data Segment Length register,         Address offset: 0x0C
FIREWALL_VDSSA      EQU  0x10  ; Volatile data Segment Start Address register,      Address offset: 0x10
FIREWALL_VDSL       EQU  0x14  ; Volatile data Segment Length register,             Address offset: 0x14
FIREWALL_RESERVED1  EQU  0x18  ; Reserved1,                                         Address offset: 0x18
FIREWALL_RESERVED2  EQU  0x1C  ; Reserved2,                                         Address offset: 0x1C
FIREWALL_CR EQU  0x20  ; Configuration  register,                           Address offset: 0x20

; FLASH Registers
FLASH_ACR       EQU  0x00      ; FLASH access control register,            Address offset: 0x00
FLASH_PDKEYR    EQU  0x04      ; FLASH power down key register,            Address offset: 0x04
FLASH_KEYR      EQU  0x08      ; FLASH key register,                       Address offset: 0x08
FLASH_OPTKEYR   EQU  0x0C      ; FLASH option key register,                Address offset: 0x0C
FLASH_SR        EQU  0x10      ; FLASH status register,                    Address offset: 0x10
FLASH_CR        EQU  0x14      ; FLASH control register,                   Address offset: 0x14
FLASH_ECCR      EQU  0x18      ; FLASH ECC register,                       Address offset: 0x18
FLASH_RESERVED1 EQU  0x1C      ; Reserved1,                                Address offset: 0x1C
FLASH_OPTR      EQU  0x20      ; FLASH option register,                    Address offset: 0x20
FLASH_PCROP1SR  EQU  0x24      ; FLASH bank1 PCROP start address register, Address offset: 0x24
FLASH_PCROP1ER  EQU  0x28      ; FLASH bank1 PCROP end address register,   Address offset: 0x28
FLASH_WRP1AR    EQU  0x2C      ; FLASH bank1 WRP area A address register,  Address offset: 0x2C
FLASH_WRP1BR    EQU  0x30      ; FLASH bank1 WRP area B address register,  Address offset: 0x30
FLASH_RESERVED2 EQU  0x34      ; Reserved2,                                Address offset: 0x34
FLASH_PCROP2SR  EQU  0x44      ; FLASH bank2 PCROP start address register, Address offset: 0x44
FLASH_PCROP2ER  EQU  0x48      ; FLASH bank2 PCROP end address register,   Address offset: 0x48
FLASH_WRP2AR    EQU  0x4C      ; FLASH bank2 WRP area A address register,  Address offset: 0x4C
FLASH_WRP2BR    EQU  0x50      ; FLASH bank2 WRP area B address register,  Address offset: 0x50

