Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; Flexible Memory Controller
FMC_Bank1_BTCR0     EQU  0x00  ; NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C
FMC_Bank1_BTCR1     EQU  0x04  ; NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C
FMC_Bank1_BTCR2     EQU  0x08  ; NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C
FMC_Bank1_BTCR3     EQU  0x0C  ; NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C
FMC_Bank1_BTCR4     EQU  0x10  ; NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C
FMC_Bank1_BTCR5     EQU  0x14  ; NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C
FMC_Bank1_BTCR6     EQU  0x18  ; NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C
FMC_Bank1_BTCR7     EQU  0x1C  ; NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C

; Flexible Memory Controller Bank1E
FMC_Bank1E_BWTR0    EQU 0x104  ; NOR/PSRAM write timing registers, Address offset: 0x104-0x11C
FMC_Bank1E_BWTR1    EQU 0x108  ; NOR/PSRAM write timing registers, Address offset: 0x104-0x11C
FMC_Bank1E_BWTR2    EQU 0x10C  ; NOR/PSRAM write timing registers, Address offset: 0x104-0x11C
FMC_Bank1E_BWTR3    EQU 0x110  ; NOR/PSRAM write timing registers, Address offset: 0x104-0x11C
FMC_Bank1E_BWTR4    EQU 0x114  ; NOR/PSRAM write timing registers, Address offset: 0x104-0x11C
FMC_Bank1E_BWTR5    EQU 0x118  ; NOR/PSRAM write timing registers, Address offset: 0x104-0x11C
FMC_Bank1E_BWTR6    EQU 0x11C  ; NOR/PSRAM write timing registers, Address offset: 0x104-0x11C

; Flexible Memory Controller Bank3
FMC_Bank3_PCR       EQU  0x80  ; NAND Flash control register,                       Address offset: 0x80
FMC_Bank3_SR        EQU  0x84  ; NAND Flash FIFO status and interrupt register,     Address offset: 0x84
FMC_Bank3_PMEM      EQU  0x88  ; NAND Flash Common memory space timing register,    Address offset: 0x88
FMC_Bank3_PATT      EQU  0x8C  ; NAND Flash Attribute memory space timing register, Address offset: 0x8C
FMC_Bank3_RESERVED0 EQU  0x90  ; Reserved, 0x90
FMC_Bank3_ECCR      EQU  0x94  ; NAND Flash ECC result registers,                   Address offset: 0x94


; General Purpose I/O
GPIO_MODER      EQU  0x00      ; GPIO port mode register,               Address offset: 0x00
GPIO_OTYPER     EQU  0x04      ; GPIO port output type register,        Address offset: 0x04
GPIO_OSPEEDR    EQU  0x08      ; GPIO port output speed register,       Address offset: 0x08
GPIO_PUPDR      EQU  0x0C      ; GPIO port pull-up/pull-down register,  Address offset: 0x0C
GPIO_IDR        EQU  0x10      ; GPIO port input data register,         Address offset: 0x10
GPIO_ODR        EQU  0x14      ; GPIO port output data register,        Address offset: 0x14
GPIO_BSRR       EQU  0x18      ; GPIO port bit set/reset  register,     Address offset: 0x18
GPIO_LCKR       EQU  0x1C      ; GPIO port configuration lock register, Address offset: 0x1C
GPIO_AFRL       EQU  0x20      ; GPIO alternate function registers,     Address offset: 0x20-0x24
GPIO_AFRH       EQU  0x24      ; GPIO alternate function registers,     Address offset: 0x20-0x24
GPIO_BRR        EQU  0x28      ; GPIO Bit Reset register,               Address offset: 0x28
GPIO_ASCR       EQU  0x2C      ; GPIO analog switch control register,   Address offset: 0x2C


; Inter-integrated Circuit Interface
I2C_CR1 EQU  0x00      ; I2C Control register 1,            Address offset: 0x00
I2C_CR2 EQU  0x04      ; I2C Control register 2,            Address offset: 0x04
I2C_OAR1        EQU  0x08      ; I2C Own address 1 register,        Address offset: 0x08
I2C_OAR2        EQU  0x0C      ; I2C Own address 2 register,        Address offset: 0x0C
I2C_TIMINGR     EQU  0x10      ; I2C Timing register,               Address offset: 0x10
I2C_TIMEOUTR    EQU  0x14      ; I2C Timeout register,              Address offset: 0x14
I2C_ISR EQU  0x18      ; I2C Interrupt and status register, Address offset: 0x18
I2C_ICR EQU  0x1C      ; I2C Interrupt clear register,      Address offset: 0x1C
I2C_PECR        EQU  0x20      ; I2C PEC register,                  Address offset: 0x20
I2C_RXDR        EQU  0x24      ; I2C Receive data register,         Address offset: 0x24
I2C_TXDR        EQU  0x28      ; I2C Transmit data register,        Address offset: 0x28

; Independent WATCHDOG
IWDG_KR EQU  0x00      ; IWDG Key register,       Address offset: 0x00
IWDG_PR EQU  0x04      ; IWDG Prescaler register, Address offset: 0x04
IWDG_RLR        EQU  0x08      ; IWDG Reload register,    Address offset: 0x08
IWDG_SR EQU  0x0C      ; IWDG Status register,    Address offset: 0x0C
IWDG_WINR       EQU  0x10      ; IWDG Window register,    Address offset: 0x10

; LCD
LCD_FCR      EQU  0x04  ; LCD frame control register,        Address offset: 0x04
LCD_SR       EQU  0x08  ; LCD status register,               Address offset: 0x08
LCD_CLR      EQU  0x0C  ; LCD clear register,                Address offset: 0x0C
LCD_RESERVED EQU  0x10  ; Reserved,                          Address offset: 0x10
LCD_RAM0     EQU  0x14  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM1     EQU  0x18  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM2     EQU  0x1C  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM3     EQU  0x20  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM4     EQU  0x24  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM5     EQU  0x28  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM6     EQU  0x2C  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM7     EQU  0x30  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM8     EQU  0x34  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM9     EQU  0x38  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM10    EQU  0x3C  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM11    EQU  0x40  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM12    EQU  0x44  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM13    EQU  0x48  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM14    EQU  0x4C  ; LCD display memory,           Address offset: 0x14-0x50
LCD_RAM15    EQU  0x50  ; LCD display memory,           Address offset: 0x14-0x50

; LPTIMER
LPTIM_ISR    EQU  0x00  ; LPTIM Interrupt and Status register,                Address offset: 0x00
LPTIM_ICR    EQU  0x04  ; LPTIM Interrupt Clear register,                     Address offset: 0x04
LPTIM_IER    EQU  0x08  ; LPTIM Interrupt Enable register,                    Address offset: 0x08
LPTIM_CFGR   EQU  0x0C  ; LPTIM Configuration register,                       Address offset: 0x0C
LPTIM_CR     EQU  0x10  ; LPTIM Control register,                             Address offset: 0x10
LPTIM_CMP    EQU  0x14  ; LPTIM Compare register,                             Address offset: 0x14
LPTIM_ARR    EQU  0x18  ; LPTIM Autoreload register,                          Address offset: 0x18
LPTIM_CNT    EQU  0x1C  ; LPTIM Counter register,                             Address offset: 0x1C
LPTIM_OR     EQU  0x20  ; LPTIM Option register,                              Address offset: 0x20


