Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; Operational Amplifier (OPAMP)
OPAMP_CSR    EQU  0x00  ; OPAMP control/status register,                     Address offset: 0x00
OPAMP_OTR    EQU  0x04  ; OPAMP offset trimming register for normal mode,    Address offset: 0x04
OPAMP_LPOTR  EQU  0x08  ; OPAMP offset trimming register for low power mode, Address offset: 0x08


; Power Control
PWR_CR1    EQU  0x00  ; PWR power control register 1,        Address offset: 0x00
PWR_CR2    EQU  0x04  ; PWR power control register 2,        Address offset: 0x04
PWR_CR3    EQU  0x08  ; PWR power control register 3,        Address offset: 0x08
PWR_CR4    EQU  0x0C  ; PWR power control register 4,        Address offset: 0x0C
PWR_SR1    EQU  0x10  ; PWR power status register 1,         Address offset: 0x10
PWR_SR2    EQU  0x14  ; PWR power status register 2,         Address offset: 0x14
PWR_SCR    EQU  0x18  ; PWR power status reset register,     Address offset: 0x18
PWR_RESERVED    EQU  0x1C; Reserved,                            Address offset: 0x1C
PWR_PUCRA  EQU  0x20  ; Pull_up control register of portA,   Address offset: 0x20
PWR_PDCRA  EQU  0x24  ; Pull_Down control register of portA, Address offset: 0x24
PWR_PUCRB  EQU  0x28  ; Pull_up control register of portB,   Address offset: 0x28
PWR_PDCRB  EQU  0x2C  ; Pull_Down control register of portB, Address offset: 0x2C
PWR_PUCRC  EQU  0x30  ; Pull_up control register of portC,   Address offset: 0x30
PWR_PDCRC  EQU  0x34  ; Pull_Down control register of portC, Address offset: 0x34
PWR_PUCRD  EQU  0x38  ; Pull_up control register of portD,   Address offset: 0x38
PWR_PDCRD  EQU  0x3C  ; Pull_Down control register of portD, Address offset: 0x3C
PWR_PUCRE  EQU  0x40  ; Pull_up control register of portE,   Address offset: 0x40
PWR_PDCRE  EQU  0x44  ; Pull_Down control register of portE, Address offset: 0x44
PWR_PUCRF  EQU  0x48  ; Pull_up control register of portF,   Address offset: 0x48
PWR_PDCRF  EQU  0x4C  ; Pull_Down control register of portF, Address offset: 0x4C
PWR_PUCRG  EQU  0x50  ; Pull_up control register of portG,   Address offset: 0x50
PWR_PDCRG  EQU  0x54  ; Pull_Down control register of portG, Address offset: 0x54
PWR_PUCRH  EQU  0x58  ; Pull_up control register of portH,   Address offset: 0x58
PWR_PDCRH  EQU  0x5C  ; Pull_Down control register of portH, Address offset: 0x5C 
PWR_PUCRI  EQU  0x60  ; Pull_up control register of portH,   Address offset: 0x58
PWR_PDCRI  EQU  0x64  ; Pull_Down control register of portH, Address offset: 0x5C 
PWR_CR5	   EQU  0x80

; QUAD Serial Peripheral Interface
;QUADSPI_CR    EQU  0x00  ; QUADSPI Control register,                           Address offset: 0x00
;QUADSPI_DCR   EQU  0x04  ; QUADSPI Device Configuration register,              Address offset: 0x04
;QUADSPI_SR    EQU  0x08  ; QUADSPI Status register,                            Address offset: 0x08
;QUADSPI_FCR   EQU  0x0C  ; QUADSPI Flag Clear register,                        Address offset: 0x0C
;QUADSPI_DLR   EQU  0x10  ; QUADSPI Data Length register,                       Address offset: 0x10
;QUADSPI_CCR   EQU  0x14  ; QUADSPI Communication Configuration register,       Address offset: 0x14
;QUADSPI_AR    EQU  0x18  ; QUADSPI Address register,                           Address offset: 0x18
;QUADSPI_ABR   EQU  0x1C  ; QUADSPI Alternate Bytes register,                   Address offset: 0x1C
;QUADSPI_DR    EQU  0x20  ; QUADSPI Data register,                              Address offset: 0x20
;QUADSPI_PSMKR EQU  0x24  ; QUADSPI Polling Status Mask register,               Address offset: 0x24
;QUADSPI_PSMAR EQU  0x28  ; QUADSPI Polling Status Match register,              Address offset: 0x28
;QUADSPI_PIR   EQU  0x2C  ; QUADSPI Polling Interval register,                  Address offset: 0x2C
;QUADSPI_LPTR  EQU  0x30  ; QUADSPI Low Power Timeout register,                 Address offset: 0x30

; OCTO Serial Peripheral Interface
OCTOSPI_CR    EQU  0x00  ; QUADSPI Control register,                           Address offset: 0x00
OCTOSPI_DCR1   EQU  0x08  ; QUADSPI Device Configuration register,              Address offset: 0x04
OCTOSPI_DCR2  EQU  0x0C
OCTOSPI_DCR3  EQU  0x10
OCTOSPI_DCR4  EQU  0x14
OCTOSPI_SR    EQU  0x20  ; QUADSPI Status register,                            Address offset: 0x08
OCTOSPI_FCR   EQU  0x24  ; QUADSPI Flag Clear register,                        Address offset: 0x0C
OCTOSPI_DLR   EQU  0x40  ; QUADSPI Data Length register,                       Address offset: 0x10
OCTOSPI_AR    EQU  0x48  ; QUADSPI Address register,                           Address offset: 0x18
OCTOSPI_DR    EQU  0x50  ; QUADSPI Data register,                              Address offset: 0x20
OCTOSPI_PSMKR EQU  0x80  ; QUADSPI Polling Status Mask register,               Address offset: 0x24
OCTOSPI_PSMAR EQU  0x88  ; QUADSPI Polling Status Match register,              Address offset: 0x28
OCTOSPI_PIR   EQU  0x90  ; QUADSPI Polling Interval register,                  Address offset: 0x2C
OCTOSPI_CCR   EQU  0x100  ; QUADSPI Communication Configuration register,       Address offset: 0x14
OCTOSPI_TCR   EQU  0x108
OCTOSPI_IR   EQU  0x110
OCTOSPI_ABR   EQU  0x120  ; QUADSPI Alternate Bytes register,                   Address offset: 0x1C
OCTOSPI_LPTR  EQU  0x130  ; QUADSPI Low Power Timeout register,                 Address offset: 0x30
OCTOSPI_WCCR   EQU  0x180
OCTOSPI_WTCR   EQU  0x188
OCTOSPI_WIR   EQU   0x190
OCTOSPI_WABR   EQU  0x1A0
OCTOSPI_HLCR   EQU  0x200

; Reset and Clock Control
RCC_CR  EQU  0x00  ; RCC clock control register,                                              Address offset: 0x00
RCC_ICSCR       EQU  0x04  ; RCC Internal Clock Sources Calibration Register,                         Address offset: 0x04
RCC_CFGR        EQU  0x08  ; RCC clock configuration register,                                        Address offset: 0x08
RCC_PLLCFGR     EQU  0x0C  ; RCC System PLL configuration register,                                   Address offset: 0x0C
RCC_PLLSAI1CFGR EQU  0x10  ; RCC PLL SAI1 Configuration Register,                                     Address offset: 0x10
RCC_PLLSAI2CFGR EQU  0x14  ; RCC PLL SAI2 Configuration Register,                                     Address offset: 0x14
RCC_CIER        EQU  0x18  ; RCC Clock Interrupt Enable Register,                                     Address offset: 0x18
RCC_CIFR        EQU  0x1C  ; RCC Clock Interrupt Flag Register,                                       Address offset: 0x1C
RCC_CICR        EQU  0x20  ; RCC Clock Interrupt Clear Register,                                      Address offset: 0x20
RCC_RESERVED0   EQU  0x24  ; Reserved,                                                                Address offset: 0x24
RCC_AHB1RSTR    EQU  0x28  ; RCC AHB1 peripheral reset register,                                      Address offset: 0x28
RCC_AHB2RSTR    EQU  0x2C  ; RCC AHB2 peripheral reset register,                                      Address offset: 0x2C
RCC_AHB3RSTR    EQU  0x30  ; RCC AHB3 peripheral reset register,                                      Address offset: 0x30
RCC_RESERVED1   EQU  0x34  ; Reserved,                                                                Address offset: 0x34
RCC_APB1RSTR1   EQU  0x38  ; RCC APB1 macrocells resets Low Word,                                     Address offset: 0x38
RCC_APB1RSTR2   EQU  0x3C  ; RCC APB1 macrocells resets High Word,                                    Address offset: 0x3C
RCC_APB2RSTR    EQU  0x40  ; RCC APB2 macrocells resets,                                              Address offset: 0x40
RCC_RESERVED2   EQU  0x44  ; Reserved,                                                                Address offset: 0x44
RCC_AHB1ENR     EQU  0x48  ; RCC AHB1 peripheral clock enable register,                               Address offset: 0x48
RCC_AHB2ENR     EQU  0x4C  ; RCC AHB2 peripheral clock enable register,                               Address offset: 0x4C
RCC_AHB3ENR     EQU  0x50  ; RCC AHB3 peripheral clock enable register,                               Address offset: 0x50
RCC_RESERVED3   EQU  0x54  ; Reserved,                                                                Address offset: 0x54
RCC_APB1ENR1    EQU  0x58  ; RCC APB1 macrocells clock enables Low Word,                              Address offset: 0x58
RCC_APB1ENR2    EQU  0x5C  ; RCC APB1 macrocells clock enables High Word,                             Address offset: 0x5C
RCC_APB2ENR     EQU  0x60  ; RCC APB2 macrocells clock enabled,                                       Address offset: 0x60
RCC_RESERVED4   EQU  0x64  ; Reserved,                                                                Address offset: 0x64
RCC_AHB1SMENR   EQU  0x68  ; RCC AHB1 macrocells clocks enables in sleep mode,                        Address offset: 0x60
RCC_AHB2SMENR   EQU  0x6C  ; RCC AHB2 macrocells clock enables in sleep mode,                         Address offset: 0x64
RCC_AHB3SMENR   EQU  0x70  ; RCC AHB3 macrocells clock enables in sleep mode,                         Address offset: 0x70
RCC_RESERVED5   EQU  0x74  ; Reserved,                                                                Address offset: 0x74
RCC_APB1SMENR1  EQU  0x78  ; RCC APB1 macrocells clock enables in sleep mode Low Word,                Address offset: 0x78
RCC_APB1SMENR2  EQU  0x7C  ; RCC APB1 macrocells clock enables in sleep mode High Word,               Address offset: 0x7C
RCC_APB2SMENR   EQU  0x80  ; RCC APB2 macrocells clock enabled in sleep mode,                         Address offset: 0x80
RCC_RESERVED6   EQU  0x84  ; Reserved,                                                                Address offset: 0x84
RCC_CCIPR       EQU  0x88  ; RCC IPs Clocks Configuration Register,                                   Address offset: 0x88
RCC_RESERVED7   EQU  0x8C  ; Reserved,                                                                Address offset: 0x8C
RCC_BDCR        EQU  0x90  ; RCC Vswitch Backup Domain Control Register,                              Address offset: 0x90
RCC_CSR         EQU  0x94  ; RCC clock control & status register,                                     Address offset: 0x94
RCC_CRRCR		EQU  0x98
RCC_CCIPR2		EQU  0x9C
RCC_DLYCFGR		EQU  0xA4

