Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; Real-Time Clock
RTC_TR         EQU  0x00   ; RTC time register,                                         Address offset: 0x00
RTC_DR         EQU  0x04   ; RTC date register,                                         Address offset: 0x04
RTC_CR         EQU  0x08   ; RTC control register,                                      Address offset: 0x08
RTC_ISR        EQU  0x0C   ; RTC initialization and status register,                    Address offset: 0x0C
RTC_PRER       EQU  0x10   ; RTC prescaler register,                                    Address offset: 0x10
RTC_WUTR       EQU  0x14   ; RTC wakeup timer register,                                 Address offset: 0x14
RTC_Reserved   EQU  0x18   ; Reserved
RTC_ALRMAR     EQU  0x1C   ; RTC alarm A register,                                      Address offset: 0x1C
RTC_ALRMBR     EQU  0x20   ; RTC alarm B register,                                      Address offset: 0x20
RTC_WPR        EQU  0x24   ; RTC write protection register,                             Address offset: 0x24
RTC_SSR        EQU  0x28   ; RTC sub second register,                                   Address offset: 0x28
RTC_SHIFTR     EQU  0x2C   ; RTC shift control register,                                Address offset: 0x2C
RTC_TSTR       EQU  0x30   ; RTC time stamp time register,                              Address offset: 0x30
RTC_TSDR       EQU  0x34   ; RTC time stamp date register,                              Address offset: 0x34
RTC_TSSSR      EQU  0x38   ; RTC time-stamp sub second register,                        Address offset: 0x38
RTC_CALR       EQU  0x3C   ; RTC calibration register,                                  Address offset: 0x3C
RTC_TAMPCR     EQU  0x40   ; RTC tamper configuration register,                         Address offset: 0x40
RTC_ALRMASSR   EQU  0x44   ; RTC alarm A sub second register,                           Address offset: 0x44
RTC_ALRMBSSR   EQU  0x48   ; RTC alarm B sub second register,                           Address offset: 0x48
RTC_OR         EQU  0x4C   ; RTC option register,                                       Address offset: 0x4C
RTC_BKP0R      EQU  0x50   ; RTC backup register 0,                                     Address offset: 0x50
RTC_BKP1R      EQU  0x54   ; RTC backup register 1,                                     Address offset: 0x54
RTC_BKP2R      EQU  0x58   ; RTC backup register 2,                                     Address offset: 0x58
RTC_BKP3R      EQU  0x5C   ; RTC backup register 3,                                     Address offset: 0x5C
RTC_BKP4R      EQU  0x60   ; RTC backup register 4,                                     Address offset: 0x60
RTC_BKP5R      EQU  0x64   ; RTC backup register 5,                                     Address offset: 0x64
RTC_BKP6R      EQU  0x68   ; RTC backup register 6,                                     Address offset: 0x68
RTC_BKP7R      EQU  0x6C   ; RTC backup register 7,                                     Address offset: 0x6C
RTC_BKP8R      EQU  0x70   ; RTC backup register 8,                                     Address offset: 0x70
RTC_BKP9R      EQU  0x74   ; RTC backup register 9,                                     Address offset: 0x74
RTC_BKP10R     EQU  0x78   ; RTC backup register 10,                                    Address offset: 0x78
RTC_BKP11R     EQU  0x7C   ; RTC backup register 11,                                    Address offset: 0x7C
RTC_BKP12R     EQU  0x80   ; RTC backup register 12,                                    Address offset: 0x80
RTC_BKP13R     EQU  0x84   ; RTC backup register 13,                                    Address offset: 0x84
RTC_BKP14R     EQU  0x88   ; RTC backup register 14,                                    Address offset: 0x88
RTC_BKP15R     EQU  0x8C   ; RTC backup register 15,                                    Address offset: 0x8C
RTC_BKP16R     EQU  0x90   ; RTC backup register 16,                                    Address offset: 0x90
RTC_BKP17R     EQU  0x94   ; RTC backup register 17,                                    Address offset: 0x94
RTC_BKP18R     EQU  0x98   ; RTC backup register 18,                                    Address offset: 0x98
RTC_BKP19R     EQU  0x9C   ; RTC backup register 19,                                    Address offset: 0x9C
RTC_BKP20R     EQU  0xA0   ; RTC backup register 20,                                    Address offset: 0xA0
RTC_BKP21R     EQU  0xA4   ; RTC backup register 21,                                    Address offset: 0xA4
RTC_BKP22R     EQU  0xA8   ; RTC backup register 22,                                    Address offset: 0xA8
RTC_BKP23R     EQU  0xAC   ; RTC backup register 23,                                    Address offset: 0xAC
RTC_BKP24R     EQU  0xB0   ; RTC backup register 24,                                    Address offset: 0xB0
RTC_BKP25R     EQU  0xB4   ; RTC backup register 25,                                    Address offset: 0xB4
RTC_BKP26R     EQU  0xB0   ; RTC backup register 26,                                    Address offset: 0xB8
RTC_BKP27R     EQU  0xB0   ; RTC backup register 27,                                    Address offset: 0xBC
RTC_BKP28R     EQU  0xC0   ; RTC backup register 28,                                    Address offset: 0xC0
RTC_BKP29R     EQU  0xC0   ; RTC backup register 29,                                    Address offset: 0xC4
RTC_BKP30R     EQU  0xC0   ; RTC backup register 30,                                    Address offset: 0xC8
RTC_BKP31R     EQU  0xC0   ; RTC backup register 31,                                    Address offset: 0xCC 


; Serial Audio Interface
SAI_GCR          EQU  0x00    ; SAI global configuration register,        Address offset: 0x00
SAI_Block_CR1    EQU  0x04    ; SAI block x configuration register 1,     Address offset: 0x04
SAI_Block_CR2    EQU  0x08    ; SAI block x configuration register 2,     Address offset: 0x08
SAI_Block_FRCR   EQU  0x0C    ; SAI block x frame configuration register, Address offset: 0x0C
SAI_Block_SLOTR  EQU  0x10    ; SAI block x slot register,                Address offset: 0x10
SAI_Block_IMR    EQU  0x14    ; SAI block x interrupt mask register,      Address offset: 0x14
SAI_Block_SR     EQU  0x18    ; SAI block x status register,              Address offset: 0x18
SAI_Block_CLRFR  EQU  0x1C    ; SAI block x clear flag register,          Address offset: 0x1C
SAI_Block_DR     EQU  0x20    ; SAI block x data register,                Address offset: 0x20

; Secure digital input/output Interface
SDMMC_POWER      EQU  0x00    ; SDMMC power control register,    Address offset: 0x00
SDMMC_CLKCR      EQU  0x04    ; SDMMC clock control register,    Address offset: 0x04
SDMMC_ARG        EQU  0x08    ; SDMMC argument register,         Address offset: 0x08
SDMMC_CMD        EQU  0x0C    ; SDMMC command register,          Address offset: 0x0C
SDMMC_RESPCMD    EQU  0x10    ; SDMMC command response register, Address offset: 0x10
SDMMC_RESP1      EQU  0x14    ; SDMMC response 1 register,       Address offset: 0x14
SDMMC_RESP2      EQU  0x18    ; SDMMC response 2 register,       Address offset: 0x18
SDMMC_RESP3      EQU  0x1C    ; SDMMC response 3 register,       Address offset: 0x1C
SDMMC_RESP4      EQU  0x20    ; SDMMC response 4 register,       Address offset: 0x20
SDMMC_DTIMER     EQU  0x24    ; SDMMC data timer register,       Address offset: 0x24
SDMMC_DLEN       EQU  0x28    ; SDMMC data length register,      Address offset: 0x28
SDMMC_DCTRL      EQU  0x2C    ; SDMMC data control register,     Address offset: 0x2C
SDMMC_DCOUNT     EQU  0x30    ; SDMMC data counter register,     Address offset: 0x30
SDMMC_STA        EQU  0x34    ; SDMMC status register,           Address offset: 0x34
SDMMC_ICR        EQU  0x38    ; SDMMC interrupt clear register,  Address offset: 0x38
SDMMC_MASK       EQU  0x3C    ; SDMMC mask register,             Address offset: 0x3C
SDMMC_RESERVED0  EQU  0x40    ; Reserved, 0x40-0x44
SDMMC_FIFOCNT    EQU  0x48    ; SDMMC FIFO counter register,     Address offset: 0x48
SDMMC_RESERVED1  EQU  0x4C    ; Reserved, 0x4C-0x7C
SDMMC_FIFO       EQU  0x80    ; SDMMC data FIFO register,        Address offset: 0x80


; Serial Peripheral Interface
SPI_CR1       EQU  0x00      ; SPI Control register 1,           Address offset: 0x00
SPI_CR2       EQU  0x04      ; SPI Control register 2,           Address offset: 0x04
SPI_SR        EQU  0x08      ; SPI Status register,              Address offset: 0x08
SPI_DR        EQU  0x0C      ; SPI data register,                Address offset: 0x0C
SPI_CRCPR     EQU  0x10      ; SPI CRC polynomial register,      Address offset: 0x10
SPI_RXCRCR    EQU  0x14      ; SPI Rx CRC register,              Address offset: 0x14
SPI_TXCRCR    EQU  0x18      ; SPI Tx CRC register,              Address offset: 0x18
SPI_RESERVED1 EQU  0x1C      ; Reserved,                         Address offset: 0x1C
SPI_RESERVED2 EQU  0x20      ; Reserved,                         Address offset: 0x20


; Single Wire Protocol Master Interface SPWMI
SWPMI_CR      EQU  0x00      ; SWPMI Configuration/Control register,     Address offset: 0x00
SWPMI_BRR     EQU  0x04      ; SWPMI bitrate register,                   Address offset: 0x04
SWPMI_RESERVED1    EQU  0x08 ; Reserved, 0x08
SWPMI_ISR     EQU  0x0C      ; SWPMI Interrupt and Status register,      Address offset: 0x0C
SWPMI_ICR     EQU  0x10      ; SWPMI Interrupt Flag Clear register,      Address offset: 0x10
SWPMI_IER     EQU  0x14      ; SWPMI Interrupt Enable register,          Address offset: 0x14
SWPMI_RFL     EQU  0x18      ; SWPMI Receive Frame Length register,      Address offset: 0x18
SWPMI_TDR     EQU  0x1C      ; SWPMI Transmit data register,             Address offset: 0x1C
SWPMI_RDR     EQU  0x20      ; SWPMI Receive data register,              Address offset: 0x20
SWPMI_OR      EQU  0x24      ; SWPMI Option register,                    Address offset: 0x24


; System configuration controller
SYSCFG_MEMRMP   EQU  0x00   ; SYSCFG memory remap register,                      Address offset: 0x00
SYSCFG_CFGR1    EQU  0x04   ; SYSCFG configuration register 1,                   Address offset: 0x04
SYSCFG_EXTICR1  EQU  0x08   ; SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14
SYSCFG_EXTICR2  EQU  0x0C   ; SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14
SYSCFG_EXTICR3  EQU  0x10   ; SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14
SYSCFG_EXTICR4  EQU  0x14   ; SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14
SYSCFG_SCSR     EQU  0x18   ; SYSCFG SRAM2 control and status register,          Address offset: 0x18
SYSCFG_CFGR2    EQU  0x1C   ; SYSCFG configuration register 2,                   Address offset: 0x1C
SYSCFG_SWPR     EQU  0x20   ; SYSCFG SRAM2 write protection register,            Address offset: 0x20
SYSCFG_SKR      EQU  0x24   ; SYSCFG SRAM2 key register,                         Address offset: 0x24
SYSCFG_SWPR2	EQU  0x28

; TIM
TIM_CR1    EQU  0x00     ; TIM control register 1,                   Address offset: 0x00
TIM_CR2    EQU  0x04     ; TIM control register 2,                   Address offset: 0x04
TIM_SMCR   EQU  0x08     ; TIM slave mode control register,          Address offset: 0x08
TIM_DIER   EQU  0x0C     ; TIM DMA/interrupt enable register,        Address offset: 0x0C
TIM_SR     EQU  0x10     ; TIM status register,                      Address offset: 0x10
TIM_EGR    EQU  0x14     ; TIM event generation register,            Address offset: 0x14
TIM_CCMR1  EQU  0x18     ; TIM capture/compare mode register 1,      Address offset: 0x18
TIM_CCMR2  EQU  0x1C     ; TIM capture/compare mode register 2,      Address offset: 0x1C
TIM_CCER   EQU  0x20     ; TIM capture/compare enable register,      Address offset: 0x20
TIM_CNT    EQU  0x24     ; TIM counter register,                     Address offset: 0x24
TIM_PSC    EQU  0x28     ; TIM prescaler,                            Address offset: 0x28
TIM_ARR    EQU  0x2C     ; TIM auto-reload register,                 Address offset: 0x2C
TIM_RCR    EQU  0x30     ; TIM repetition counter register,          Address offset: 0x30
TIM_CCR1   EQU  0x34     ; TIM capture/compare register 1,           Address offset: 0x34
TIM_CCR2   EQU  0x38     ; TIM capture/compare register 2,           Address offset: 0x38
TIM_CCR3   EQU  0x3C     ; TIM capture/compare register 3,           Address offset: 0x3C
TIM_CCR4   EQU  0x40     ; TIM capture/compare register 4,           Address offset: 0x40
TIM_BDTR   EQU  0x44     ; TIM break and dead-time register,         Address offset: 0x44
TIM_DCR    EQU  0x48     ; TIM DMA control register,                 Address offset: 0x48
TIM_DMAR   EQU  0x4C     ; TIM DMA address for full transfer,        Address offset: 0x4C
TIM_OR1    EQU  0x50     ; TIM option register 1,                    Address offset: 0x50
TIM_CCMR3  EQU  0x54     ; TIM capture/compare mode register 3,      Address offset: 0x54
TIM_CCR5   EQU  0x58     ; TIM capture/compare register5,            Address offset: 0x58
TIM_CCR6   EQU  0x5C     ; TIM capture/compare register6,            Address offset: 0x5C
TIM_OR2    EQU  0x60     ; TIM option register 2,                    Address offset: 0x60
TIM_OR3    EQU  0x64     ; TIM option register 3,                    Address offset: 0x64


; Touch Sensing Controller (TSC)
TSC_CR   EQU  0x00      ; TSC control register,                      Address offset: 0x00
TSC_IER  EQU  0x04      ; TSC interrupt enable register,             Address offset: 0x04
TSC_ICR  EQU  0x08      ; TSC interrupt clear register,              Address offset: 0x08
TSC_ISR  EQU  0x0C      ; TSC interrupt status register,             Address offset: 0x0C
TSC_IOHCR        EQU  0x10      ; TSC I/O hysteresis control register,       Address offset: 0x10
TSC_RESERVED1    EQU  0x14      ; Reserved,                                  Address offset: 0x14
TSC_IOASCR       EQU  0x18      ; TSC I/O analog switch control register,    Address offset: 0x18
TSC_RESERVED2    EQU  0x1C      ; Reserved,                                  Address offset: 0x1C
TSC_IOSCR        EQU  0x20      ; TSC I/O sampling control register,         Address offset: 0x20
TSC_RESERVED3    EQU  0x24      ; Reserved,                                  Address offset: 0x24
TSC_IOCCR        EQU  0x28      ; TSC I/O channel control register,          Address offset: 0x28
TSC_RESERVED4    EQU  0x2C      ; Reserved,                                  Address offset: 0x2C
TSC_IOGCSR       EQU  0x30      ; TSC I/O group control status register,     Address offset: 0x30
TSC_IOGXCR0      EQU  0x34      ; TSC I/O group x counter register,          Address offset: 0x34-50
TSC_IOGXCR1      EQU  0x38      ; TSC I/O group x counter register,          Address offset: 0x34-50
TSC_IOGXCR2      EQU  0x3C      ; TSC I/O group x counter register,          Address offset: 0x34-50
TSC_IOGXCR3      EQU  0x40      ; TSC I/O group x counter register,          Address offset: 0x34-50
TSC_IOGXCR4      EQU  0x44      ; TSC I/O group x counter register,          Address offset: 0x34-50
TSC_IOGXCR5      EQU  0x48      ; TSC I/O group x counter register,          Address offset: 0x34-50
TSC_IOGXCR6      EQU  0x4C      ; TSC I/O group x counter register,          Address offset: 0x34-50
TSC_IOGXCR7      EQU  0x50      ; TSC I/O group x counter register,          Address offset: 0x34-50

