Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; Universal Synchronous Asynchronous Receiver Transmitter
USART_CR1        EQU  0x00      ; USART Control register 1,                 Address offset: 0x00
USART_CR2        EQU  0x04      ; USART Control register 2,                 Address offset: 0x04
USART_CR3        EQU  0x08      ; USART Control register 3,                 Address offset: 0x08
USART_BRR        EQU  0x0C      ; USART Baud rate register,                 Address offset: 0x0C
USART_GTPR       EQU  0x10      ; USART Guard time and prescaler register,  Address offset: 0x10
USART_RESERVED2  EQU  0x12      ; Reserved, 0x12
USART_RTOR       EQU  0x14      ; USART Receiver Time Out register,         Address offset: 0x14
USART_RQR        EQU  0x18      ; USART Request register,                   Address offset: 0x18
USART_RESERVED3  EQU  0x1A      ; Reserved, 0x1A
USART_ISR        EQU  0x1C      ; USART Interrupt and status register,      Address offset: 0x1C
USART_ICR        EQU  0x20      ; USART Interrupt flag Clear register,      Address offset: 0x20
USART_RDR        EQU  0x24      ; USART Receive Data register,              Address offset: 0x24
USART_RESERVED4  EQU  0x26      ; Reserved, 0x26
USART_TDR        EQU  0x28      ; USART Transmit Data register,             Address offset: 0x28
USART_RESERVED5  EQU  0x2A      ; Reserved, 0x2A
USART_PRESC		EQU  0x2C

; VREFBUF
VREFBUF_CSR    EQU  0x00      ; VREFBUF control and status register,         Address offset: 0x00
VREFBUF_CCR    EQU  0x04      ; VREFBUF calibration and control register,    Address offset: 0x04

; Window WATCHDOG
WWDG_CR    EQU  0x00       ; WWDG Control register,       Address offset: 0x00
WWDG_CFR   EQU  0x04       ; WWDG Configuration register, Address offset: 0x04
WWDG_SR    EQU  0x08       ; WWDG Status register,        Address offset: 0x08



; RNG
NRG_CR EQU 0x00  ; RNG control register, Address offset: 0x00
NRG_SR EQU 0x04  ; RNG status register,  Address offset: 0x04
NRG_DR EQU 0x08  ; RNG data register,    Address offset: 0x08

; USB_OTG_Core_register
USB_OTG_Global_GOTGCTL    EQU  0x00           ;  USB_OTG Control and Status Register          000h
USB_OTG_Global_GOTGINT    EQU  0x04           ;  USB_OTG Interrupt Register                   004h
USB_OTG_Global_GAHBCFG    EQU  0x08           ;  Core AHB Configuration Register              008h
USB_OTG_Global_GUSBCFG    EQU  0x0C           ;  Core USB Configuration Register              00Ch
USB_OTG_Global_GRSTCTL    EQU  0x10           ;  Core Reset Register                          010h
USB_OTG_Global_GINTSTS    EQU  0x14           ;  Core Interrupt Register                      014h
USB_OTG_Global_GINTMSK    EQU  0x18           ;  Core Interrupt Mask Register                 018h
USB_OTG_Global_GRXSTSR    EQU  0x1C           ;  Receive Sts Q Read Register                  01Ch
USB_OTG_Global_GRXSTSP    EQU  0x20           ;  Receive Sts Q Read & POP Register            020h
USB_OTG_Global_GRXFSIZ    EQU  0x24           ;  Receive FIFO Size Register                   024h
USB_OTG_Global_DIEPTXF0_HNPTXFSIZ  EQU  0x28  ;  EP0 / Non Periodic Tx FIFO Size Register     028h
USB_OTG_Global_HNPTXSTS    EQU  0x0C          ;  Non Periodic Tx FIFO/Queue Sts reg           02Ch
USB_OTG_Global_Reserved30  EQU  0x30          ; Reserved                                      030h
USB_OTG_Global_GCCFG       EQU  0x38          ; General Purpose IO Register                   038h
USB_OTG_Global_CID         EQU  0x3C          ; User ID Register                              03Ch
USB_OTG_Global_Reserved5   EQU  0x40         ; Reserved                                       040h-048h
USB_OTG_Global_GHWCFG3     EQU  0x4C          ; User HW config3                               04Ch
USB_OTG_Global_Reserved6   EQU  0x50          ; Reserved                                      050h
USB_OTG_Global_GLPMCFG     EQU  0x54          ; LPM Register                                  054h
USB_OTG_Global_GPWRDN      EQU  0x58          ; Power Down Register                           058h
USB_OTG_Global_GDFIFOCFG   EQU  0x5C          ; DFIFO Software Config Register                05Ch
USB_OTG_Global_GADPCTL     EQU  0x60          ; ADP Timer, Control and Status Register        60Ch
USB_OTG_Global_Reserved43  EQU  0x64          ; Reserved                                      058h-0FFh
USB_OTG_Global_HPTXFSIZ    EQU  0x100         ; Host Periodic Tx FIFO Size Reg                100h
USB_OTG_Global_DIEPTXF0    EQU  0x104         ; dev Periodic Transmit FIFO


; USB_OTG_device_Registers
USB_OTG_Device_DCFG        EQU  0x800  ; dev Configuration Register   800h
USB_OTG_Device_DCTL        EQU  0x804  ; dev Control Register         804h
USB_OTG_Device_DSTS        EQU  0x808  ; dev Status Register (RO)     808h
USB_OTG_Device_Reserved0C  EQU  0x80C  ; Reserved                     80Ch
USB_OTG_Device_DIEPMSK     EQU  0x810  ; dev IN Endpoint Mask         810h
USB_OTG_Device_DOEPMSK     EQU  0x814  ; dev OUT Endpoint Mask        814h
USB_OTG_Device_DAINT       EQU  0x818  ; dev All Endpoints Itr Reg    818h
USB_OTG_Device_DAINTMSK    EQU  0x81C  ; dev All Endpoints Itr Mask   81Ch
USB_OTG_Device_Reserved20  EQU  0x820  ; Reserved                     820h
USB_OTG_Device_Reserved9   EQU  0x824  ; Reserved                     824h
USB_OTG_Device_DVBUSDIS    EQU  0x828  ; dev VBUS discharge Register  828h
USB_OTG_Device_DVBUSPULSE  EQU  0x82C  ; dev VBUS Pulse Register      82Ch
USB_OTG_Device_DTHRCTL     EQU  0x830  ; dev thr                      830h
USB_OTG_Device_DIEPEMPMSK  EQU  0x834  ; dev empty msk                834h
USB_OTG_Device_DEACHINT    EQU  0x838  ; dedicated EP interrupt       838h
USB_OTG_Device_DEACHMSK    EQU  0x83C  ; dedicated EP msk             83Ch
USB_OTG_Device_Reserved40  EQU  0x840  ; dedicated EP mask            840h
USB_OTG_Device_DINEP1MSK   EQU  0x844  ; dedicated EP mask            844h
USB_OTG_Device_Reserved44  EQU  0x848  ; Reserved                 844-87Ch
USB_OTG_Device_DOUTEP1MSK  EQU  0x884  ; dedicated EP msk             884h

