Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; USB_OTG_IN_Endpoint-Specific_Register
USB_OTG_INEndpoint_DIEPCTL    EQU  0x900  ; dev IN Endpoint Control Reg 900h + (ep_num * 20h) + 00h
USB_OTG_INEndpoint_Reserved04 EQU  0x904  ; Reserved                       900h + (ep_num * 20h) + 04h
USB_OTG_INEndpoint_DIEPINT    EQU  0x908  ; dev IN Endpoint Itr Reg     900h + (ep_num * 20h) + 08h
USB_OTG_INEndpoint_Reserved0C EQU  0x90C  ; Reserved                       900h + (ep_num * 20h) + 0Ch
USB_OTG_INEndpoint_DIEPTSIZ   EQU  0x910  ; IN Endpoint Txfer Size   900h + (ep_num * 20h) + 10h
USB_OTG_INEndpoint_DIEPDMA    EQU  0x914  ; IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h
USB_OTG_INEndpoint_DTXFSTS    EQU  0x918  ; IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h
USB_OTG_INEndpoint_Reserved18 EQU  0x91C  ; Reserved  900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch

; USB_OTG_OUT_Endpoint-Specific_Registers
SB_OTG_OUTEndpoint_DOEPCTL    EQU  0xB00   ; dev OUT Endpoint Control Reg  B00h + (ep_num * 20h) + 00h
SB_OTG_OUTEndpoint_Reserved04 EQU  0xB04   ; Reserved                      B00h + (ep_num * 20h) + 04h
SB_OTG_OUTEndpoint_DOEPINT    EQU  0xB08   ; dev OUT Endpoint Itr Reg      B00h + (ep_num * 20h) + 08h
SB_OTG_OUTEndpoint_Reserved0C EQU  0xB0C   ; Reserved                      B00h + (ep_num * 20h) + 0Ch
SB_OTG_OUTEndpoint_DOEPTSIZ   EQU  0xB10   ; dev OUT Endpoint Txfer Size   B00h + (ep_num * 20h) + 10h
SB_OTG_OUTEndpoint_DOEPDMA    EQU  0xB14   ; dev OUT Endpoint DMA Address  B00h + (ep_num * 20h) + 14h
SB_OTG_OUTEndpoint_Reserved18 EQU  0xB18   ; Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch

; USB_OTG_Host_Mode_Register_Structures
USB_OTG_Host_HCFG     EQU  0x400  ; Host Configuration Register    400h
USB_OTG_Host_HFIR     EQU  0x404  ; Host Frame Interval Register   404h
USB_OTG_Host_HFNUM    EQU  0x408  ; Host Frame Nbr/Frame Remaining 408h
USB_OTG_Host_Reserved40C      EQU  0x40C  ; Reserved                       40Ch
USB_OTG_Host_HPTXSTS  EQU  0x410  ; Host Periodic Tx FIFO/ Queue Status 410h
USB_OTG_Host_HAINT    EQU  0x414  ; Host All Channels Interrupt Register 414h
USB_OTG_Host_HAINTMSK EQU  0x418  ; Host All Channels Interrupt Mask 418h

; USB_OTG_Host_Channel_Specific_Registers
USB_OTG_HostChannel_HCCHAR    EQU  0x00  
USB_OTG_HostChannel_HCSPLT    EQU  0x04  
USB_OTG_HostChannel_HCINT     EQU  0x08  
USB_OTG_HostChannel_HCINTMSK  EQU  0x0C  
USB_OTG_HostChannel_HCTSIZ    EQU  0x10  
USB_OTG_HostChannel_HCDMA     EQU  0x14  
USB_OTG_HostChannel_Reserved  EQU  0x18  

; Peripheral_memory_map
FLASH_BASE    EQU (0x08000000) ; FLASH(up to 1 MB) base address
SRAM1_BASE    EQU (0x20000000) ; SRAM1(96 KB) base address
PERIPH_BASE   EQU (0x40000000) ; Peripheral base address
FMC_BASE      EQU (0x60000000) ; FMC base address
;SRAM2_BASE    EQU (0x10000000) ; SRAM2(32 KB) base address
FMC_R_BASE    EQU (0xA0000000) ; FMC  control registers base address
OSPI_R_BASE   EQU (0xA0001000) ; QUADSPI control registers base address
SRAM1_BB_BASE EQU (0x22000000) ; SRAM1(96 KB) base address in the bit-band region
PERIPH_BB_BASE        EQU (0x42000000) ; Peripheral base address in the bit-band region
SRAM2_BB_BASE EQU (0x12000000) ; SRAM2(32 KB) base address in the bit-band region

; Legacy defines
SRAM_BASE     EQU SRAM1_BASE
SRAM_BB_BASE  EQU SRAM1_BB_BASE

SRAM1_SIZE_MAX EQU (0x00018000) ; maximum SRAM1 size (up to 96 KBytes)
SRAM2_SIZE     EQU (0x00008000) ; SRAM2 size (32 KBytes)

; Peripheral memory map
APB1PERIPH_BASE       EQU PERIPH_BASE
APB2PERIPH_BASE       EQU (PERIPH_BASE + 0x00010000)
AHB1PERIPH_BASE       EQU (PERIPH_BASE + 0x00020000)
AHB2PERIPH_BASE       EQU (PERIPH_BASE + 0x08000000)

FMC_BANK1     EQU FMC_BASE
FMC_BANK1_1   EQU FMC_BANK1
FMC_BANK1_2   EQU (FMC_BANK1 + 0x04000000)
FMC_BANK1_3   EQU (FMC_BANK1 + 0x08000000)
FMC_BANK1_4   EQU (FMC_BANK1 + 0x0C000000)
FMC_BANK3     EQU (FMC_BASE  + 0x20000000)

; APB1 peripherals
TIM2_BASE     EQU (APB1PERIPH_BASE + 0x0000)
TIM3_BASE     EQU (APB1PERIPH_BASE + 0x0400)
TIM4_BASE     EQU (APB1PERIPH_BASE + 0x0800)
TIM5_BASE     EQU (APB1PERIPH_BASE + 0x0C00)
TIM6_BASE     EQU (APB1PERIPH_BASE + 0x1000)
TIM7_BASE     EQU (APB1PERIPH_BASE + 0x1400)
;LCD_BASE      EQU (APB1PERIPH_BASE + 0x2400)
RTC_BASE      EQU (APB1PERIPH_BASE + 0x2800)
WWDG_BASE     EQU (APB1PERIPH_BASE + 0x2C00)
IWDG_BASE     EQU (APB1PERIPH_BASE + 0x3000)
SPI2_BASE     EQU (APB1PERIPH_BASE + 0x3800)
SPI3_BASE     EQU (APB1PERIPH_BASE + 0x3C00)
USART2_BASE   EQU (APB1PERIPH_BASE + 0x4400)
USART3_BASE   EQU (APB1PERIPH_BASE + 0x4800)
UART4_BASE    EQU (APB1PERIPH_BASE + 0x4C00)
UART5_BASE    EQU (APB1PERIPH_BASE + 0x5000)
I2C1_BASE     EQU (APB1PERIPH_BASE + 0x5400)
I2C2_BASE     EQU (APB1PERIPH_BASE + 0x5800)
I2C3_BASE     EQU (APB1PERIPH_BASE + 0x5C00)
CRS_BASE	  EQU (APB1PERIPH_BASE + 0x6000)
CAN1_BASE     EQU (APB1PERIPH_BASE + 0x6400)
LPTIM1_BASE   EQU (APB1PERIPH_BASE + 0x7C00)
PWR_BASE      EQU (APB1PERIPH_BASE + 0x7000)
DAC_BASE      EQU (APB1PERIPH_BASE + 0x7400)
DAC1_BASE     EQU (APB1PERIPH_BASE + 0x7400)
OPAMP_BASE    EQU (APB1PERIPH_BASE + 0x7800)
OPAMP1_BASE   EQU (APB1PERIPH_BASE + 0x7800)
OPAMP2_BASE   EQU (APB1PERIPH_BASE + 0x7810)
LPUART1_BASE  EQU (APB1PERIPH_BASE + 0x8000)
I2C4_BASE     EQU (APB1PERIPH_BASE + 0x8400)
;SWPMI1_BASE   EQU (APB1PERIPH_BASE + 0x8800)
LPTIM2_BASE   EQU (APB1PERIPH_BASE + 0x9400)


; APB2 peripherals
SYSCFG_BASE   EQU (APB2PERIPH_BASE + 0x0000)
VREFBUF_BASE  EQU (APB2PERIPH_BASE + 0x0030)
COMP1_BASE    EQU (APB2PERIPH_BASE + 0x0200)
COMP2_BASE    EQU (APB2PERIPH_BASE + 0x0204)
EXTI_BASE     EQU (APB2PERIPH_BASE + 0x0400)
FIREWALL_BASE EQU (APB2PERIPH_BASE + 0x1C00)
;SDMMC1_BASE   EQU (APB2PERIPH_BASE + 0x2800)
TIM1_BASE     EQU (APB2PERIPH_BASE + 0x2C00)
SPI1_BASE     EQU (APB2PERIPH_BASE + 0x3000)
TIM8_BASE     EQU (APB2PERIPH_BASE + 0x3400)
USART1_BASE   EQU (APB2PERIPH_BASE + 0x3800)
TIM15_BASE    EQU (APB2PERIPH_BASE + 0x4000)
TIM16_BASE    EQU (APB2PERIPH_BASE + 0x4400)
TIM17_BASE    EQU (APB2PERIPH_BASE + 0x4800)
SAI1_BASE     EQU (APB2PERIPH_BASE + 0x5400)
SAI1_Block_A_BASE     EQU (SAI1_BASE + 0x004)
SAI1_Block_B_BASE     EQU (SAI1_BASE + 0x024)
SAI2_BASE     EQU (APB2PERIPH_BASE + 0x5800)
SAI2_Block_A_BASE     EQU (SAI2_BASE + 0x004)
SAI2_Block_B_BASE     EQU (SAI2_BASE + 0x024)
DFSDM_BASE    EQU (APB2PERIPH_BASE + 0x6000)
DFSDM_Channel0_BASE   EQU (DFSDM_BASE + 0x00)
DFSDM_Channel1_BASE   EQU (DFSDM_BASE + 0x20)
DFSDM_Channel2_BASE   EQU (DFSDM_BASE + 0x40)
DFSDM_Channel3_BASE   EQU (DFSDM_BASE + 0x60)
DFSDM_Channel4_BASE   EQU (DFSDM_BASE + 0x80)
DFSDM_Channel5_BASE   EQU (DFSDM_BASE + 0xA0)
DFSDM_Channel6_BASE   EQU (DFSDM_BASE + 0xC0)
DFSDM_Channel7_BASE   EQU (DFSDM_BASE + 0xE0)
DFSDM_Filter0_BASE    EQU (DFSDM_BASE + 0x100)
DFSDM_Filter1_BASE    EQU (DFSDM_BASE + 0x180)
DFSDM_Filter2_BASE    EQU (DFSDM_BASE + 0x200)
DFSDM_Filter3_BASE    EQU (DFSDM_BASE + 0x280)
LCD_TFT_BASE		  EQU (APB2PERIPH_BASE + 0x6800)

; AHB1 peripherals
DMA1_BASE     EQU (AHB1PERIPH_BASE)
DMA2_BASE     EQU (AHB1PERIPH_BASE + 0x0400)
RCC_BASE      EQU (AHB1PERIPH_BASE + 0x1000)
FLASH_R_BASE  EQU (AHB1PERIPH_BASE + 0x2000)
CRC_BASE      EQU (AHB1PERIPH_BASE + 0x3000)
TSC_BASE      EQU (AHB1PERIPH_BASE + 0x4000)


DMA1_Channel1_BASE    EQU (DMA1_BASE + 0x0008)
DMA1_Channel2_BASE    EQU (DMA1_BASE + 0x001C)
DMA1_Channel3_BASE    EQU (DMA1_BASE + 0x0030)
DMA1_Channel4_BASE    EQU (DMA1_BASE + 0x0044)
DMA1_Channel5_BASE    EQU (DMA1_BASE + 0x0058)
DMA1_Channel6_BASE    EQU (DMA1_BASE + 0x006C)
DMA1_Channel7_BASE    EQU (DMA1_BASE + 0x0080)
DMA1_CSELR_BASE       EQU (DMA1_BASE + 0x00A8)


DMA2_Channel1_BASE    EQU (DMA2_BASE + 0x0008)
DMA2_Channel2_BASE    EQU (DMA2_BASE + 0x001C)
DMA2_Channel3_BASE    EQU (DMA2_BASE + 0x0030)
DMA2_Channel4_BASE    EQU (DMA2_BASE + 0x0044)
DMA2_Channel5_BASE    EQU (DMA2_BASE + 0x0058)
DMA2_Channel6_BASE    EQU (DMA2_BASE + 0x006C)
DMA2_Channel7_BASE    EQU (DMA2_BASE + 0x0080)
DMA2_CSELR_BASE       EQU (DMA2_BASE + 0x00A8)


