Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; AHB2 peripherals
GPIOA_BASE    EQU (AHB2PERIPH_BASE + 0x0000)
GPIOB_BASE    EQU (AHB2PERIPH_BASE + 0x0400)
GPIOC_BASE    EQU (AHB2PERIPH_BASE + 0x0800)
GPIOD_BASE    EQU (AHB2PERIPH_BASE + 0x0C00)
GPIOE_BASE    EQU (AHB2PERIPH_BASE + 0x1000)
GPIOF_BASE    EQU (AHB2PERIPH_BASE + 0x1400)
GPIOG_BASE    EQU (AHB2PERIPH_BASE + 0x1800)
GPIOH_BASE    EQU (AHB2PERIPH_BASE + 0x1C00)
GPIOI_BASE    EQU (AHB2PERIPH_BASE + 0x2000)
	
USBOTG_BASE   EQU (AHB2PERIPH_BASE + 0x08000000)

ADC1_BASE     EQU (AHB2PERIPH_BASE + 0x08040000)
ADC2_BASE     EQU (AHB2PERIPH_BASE + 0x08040100)
ADC3_BASE     EQU (AHB2PERIPH_BASE + 0x08040200)
ADC123_COMMON_BASE    EQU (AHB2PERIPH_BASE + 0x08040300)


RNG_BASE      EQU (AHB2PERIPH_BASE + 0x08060800)

; FMC Banks registers base  address
FMC_Bank1_R_BASE      EQU (FMC_R_BASE + 0x0000)
FMC_Bank1E_R_BASE     EQU (FMC_R_BASE + 0x0104)
FMC_Bank2_R_BASE      EQU (FMC_R_BASE + 0x0060)
FMC_Bank3_R_BASE      EQU (FMC_R_BASE + 0x0080)
FMC_Bank4_R_BASE      EQU (FMC_R_BASE + 0x00A0)

; Debug MCU registers base address
DBGMCU_BASE   EQU (0xE0042000)

; USB registers base address
USB_OTG_FS_PERIPH_BASE       EQU (0x50000000)

USB_OTG_GLOBAL_BASE          EQU (0x000)
USB_OTG_DEVICE_BASE          EQU (0x800)
USB_OTG_IN_ENDPOINT_BASE     EQU (0x900)
USB_OTG_OUT_ENDPOINT_BASE    EQU (0xB00)
USB_OTG_EP_REG_SIZE          EQU (0x20)
USB_OTG_HOST_BASE            EQU (0x400)
USB_OTG_HOST_PORT_BASE       EQU (0x440)
USB_OTG_HOST_CHANNEL_BASE    EQU (0x500)
USB_OTG_HOST_CHANNEL_SIZE    EQU (0x20)
USB_OTG_PCGCCTL_BASE         EQU (0xE00)
USB_OTG_FIFO_BASE            EQU (0x1000)
USB_OTG_FIFO_SIZE            EQU (0x1000)



; Peripheral_Registers_Bits_Definition



; *****************************************************************************
;                      Peripheral Registers_Bits_Definition
; *****************************************************************************

; *****************************************************************************
;                        Analog to Digital Converter
; *****************************************************************************
; ********************  Bit definition for ADC_ISR register  *******************
ADC_ISR_ADRDY EQU (0x00000001) ; ADC Ready (ADRDY) flag
ADC_ISR_EOSMP EQU (0x00000002) ; ADC End of Sampling flag
ADC_ISR_EOC   EQU (0x00000004) ; ADC End of Regular Conversion flag
ADC_ISR_EOS   EQU (0x00000008) ; ADC End of Regular sequence of Conversions flag
ADC_ISR_OVR   EQU (0x00000010) ; ADC overrun flag
ADC_ISR_JEOC  EQU (0x00000020) ; ADC End of Injected Conversion flag
ADC_ISR_JEOS  EQU (0x00000040) ; ADC End of Injected sequence of Conversions flag
ADC_ISR_AWD1  EQU (0x00000080) ; ADC Analog watchdog 1 flag
ADC_ISR_AWD2  EQU (0x00000100) ; ADC Analog watchdog 2 flag
ADC_ISR_AWD3  EQU (0x00000200) ; ADC Analog watchdog 3 flag
ADC_ISR_JQOVF EQU (0x00000400) ; ADC Injected Context Queue Overflow flag

; ********************  Bit definition for ADC_IER register  *******************
ADC_IER_ADRDY EQU (0x00000001) ; ADC Ready (ADRDY) interrupt source
ADC_IER_EOSMP EQU (0x00000002) ; ADC End of Sampling interrupt source
ADC_IER_EOC   EQU (0x00000004) ; ADC End of Regular Conversion interrupt source
ADC_IER_EOS   EQU (0x00000008) ; ADC End of Regular sequence of Conversions interrupt source
ADC_IER_OVR   EQU (0x00000010) ; ADC overrun interrupt source
ADC_IER_JEOC  EQU (0x00000020) ; ADC End of Injected Conversion interrupt source
ADC_IER_JEOS  EQU (0x00000040) ; ADC End of Injected sequence of Conversions interrupt source
ADC_IER_AWD1  EQU (0x00000080) ; ADC Analog watchdog 1 interrupt source
ADC_IER_AWD2  EQU (0x00000100) ; ADC Analog watchdog 2 interrupt source
ADC_IER_AWD3  EQU (0x00000200) ; ADC Analog watchdog 3 interrupt source
ADC_IER_JQOVF EQU (0x00000400) ; ADC Injected Context Queue Overflow interrupt source

; ********************  Bit definition for ADC_CR register  *******************
ADC_CR_ADEN   EQU (0x00000001) ; ADC Enable control
ADC_CR_ADDIS  EQU (0x00000002) ; ADC Disable command
ADC_CR_ADSTART        EQU (0x00000004) ; ADC Start of Regular conversion
ADC_CR_JADSTART       EQU (0x00000008) ; ADC Start of injected conversion
ADC_CR_ADSTP  EQU (0x00000010) ; ADC Stop of Regular conversion
ADC_CR_JADSTP EQU (0x00000020) ; ADC Stop of injected conversion
ADC_CR_ADVREGEN       EQU (0x10000000) ; ADC Voltage regulator Enable
ADC_CR_DEEPPWD        EQU (0x20000000) ; ADC Deep power down Enable
ADC_CR_ADCALDIF       EQU (0x40000000) ; ADC Differential Mode for calibration
ADC_CR_ADCAL  EQU (0x80000000) ; ADC Calibration

; ********************  Bit definition for ADC_CFGR register  *******************
ADC_CFGR_DMAEN        EQU (0x00000001) ; ADC DMA Enable
ADC_CFGR_DMACFG       EQU (0x00000002) ; ADC DMA configuration

ADC_CFGR_RES  EQU (0x00000018) ; ADC Data resolution
ADC_CFGR_RES_0        EQU (0x00000008) ; ADC RES bit 0
ADC_CFGR_RES_1        EQU (0x00000010) ; ADC RES bit 1

ADC_CFGR_ALIGN        EQU (0x00000020) ; ADC Data Alignement

ADC_CFGR_EXTSEL       EQU (0x000003C0) ; ADC External trigger selection for regular group
ADC_CFGR_EXTSEL_0     EQU (0x00000040) ; ADC EXTSEL bit 0
ADC_CFGR_EXTSEL_1     EQU (0x00000080) ; ADC EXTSEL bit 1
ADC_CFGR_EXTSEL_2     EQU (0x00000100) ; ADC EXTSEL bit 2
ADC_CFGR_EXTSEL_3     EQU (0x00000200) ; ADC EXTSEL bit 3

ADC_CFGR_EXTEN        EQU (0x00000C00) ; ADC External trigger enable and polarity selection for regular channels
ADC_CFGR_EXTEN_0      EQU (0x00000400) ; ADC EXTEN bit 0
ADC_CFGR_EXTEN_1      EQU (0x00000800) ; ADC EXTEN bit 1

ADC_CFGR_OVRMOD       EQU (0x00001000) ; ADC overrun mode
ADC_CFGR_CONT EQU (0x00002000) ; ADC Single/continuous conversion mode for regular conversion
ADC_CFGR_AUTDLY       EQU (0x00004000) ; ADC Delayed conversion mode

ADC_CFGR_DISCEN       EQU (0x00010000) ; ADC Discontinuous mode for regular channels

ADC_CFGR_DISCNUM      EQU (0x000E0000) ; ADC Discontinuous mode channel count
ADC_CFGR_DISCNUM_0    EQU (0x00020000) ; ADC DISCNUM bit 0
ADC_CFGR_DISCNUM_1    EQU (0x00040000) ; ADC DISCNUM bit 1
ADC_CFGR_DISCNUM_2    EQU (0x00080000) ; ADC DISCNUM bit 2

ADC_CFGR_JDISCEN      EQU (0x00100000) ; ADC Discontinuous mode on injected channels
ADC_CFGR_JQM  EQU (0x00200000) ; ADC JSQR Queue mode
ADC_CFGR_AWD1SGL      EQU (0x00400000) ; Enable the watchdog 1 on a single channel or on all channels
ADC_CFGR_AWD1EN       EQU (0x00800000) ; ADC Analog watchdog 1 enable on regular Channels
ADC_CFGR_JAWD1EN      EQU (0x01000000) ; ADC Analog watchdog 1 enable on injected Channels
ADC_CFGR_JAUTO        EQU (0x02000000) ; ADC Automatic injected group conversion

ADC_CFGR_AWD1CH       EQU (0x7C000000) ; ADC Analog watchdog 1 Channel selection
ADC_CFGR_AWD1CH_0     EQU (0x04000000) ; ADC AWD1CH bit 0
ADC_CFGR_AWD1CH_1     EQU (0x08000000) ; ADC AWD1CH bit 1
ADC_CFGR_AWD1CH_2     EQU (0x10000000) ; ADC AWD1CH bit 2
ADC_CFGR_AWD1CH_3     EQU (0x20000000) ; ADC AWD1CH bit 3
ADC_CFGR_AWD1CH_4     EQU (0x40000000) ; ADC AWD1CH bit 4

ADC_CFGR_JQDIS        EQU (0x80000000) ; ADC Injected queue disable

; ********************  Bit definition for ADC_CFGR2 register  *******************
ADC_CFGR2_ROVSE       EQU (0x00000001) ; ADC Regular group oversampler enable
ADC_CFGR2_JOVSE       EQU (0x00000002) ; ADC Injected group oversampler enable

ADC_CFGR2_OVSR        EQU (0x0000001C) ; ADC Regular group oversampler enable
ADC_CFGR2_OVSR_0      EQU (0x00000004) ; ADC OVSR bit 0
ADC_CFGR2_OVSR_1      EQU (0x00000008) ; ADC OVSR bit 1
ADC_CFGR2_OVSR_2      EQU (0x00000010) ; ADC OVSR bit 2

ADC_CFGR2_OVSS        EQU (0x000001E0) ; ADC Regular Oversampling shift
ADC_CFGR2_OVSS_0      EQU (0x00000020) ; ADC OVSS bit 0
ADC_CFGR2_OVSS_1      EQU (0x00000040) ; ADC OVSS bit 1
ADC_CFGR2_OVSS_2      EQU (0x00000080) ; ADC OVSS bit 2
ADC_CFGR2_OVSS_3      EQU (0x00000100) ; ADC OVSS bit 3

ADC_CFGR2_TROVS       EQU (0x00000200) ; ADC Triggered regular Oversampling
ADC_CFGR2_ROVSM       EQU (0x00000400) ; ADC Regular oversampling mode

; ********************  Bit definition for ADC_SMPR1 register  *******************
ADC_SMPR1_SMP0        EQU (0x00000007) ; ADC Channel 0 Sampling time selection
ADC_SMPR1_SMP0_0      EQU (0x00000001) ; ADC SMP0 bit 0
ADC_SMPR1_SMP0_1      EQU (0x00000002) ; ADC SMP0 bit 1
ADC_SMPR1_SMP0_2      EQU (0x00000004) ; ADC SMP0 bit 2

