Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
ADC_SMPR1_SMP1        EQU (0x00000038) ; ADC Channel 1 Sampling time selection
ADC_SMPR1_SMP1_0      EQU (0x00000008) ; ADC SMP1 bit 0
ADC_SMPR1_SMP1_1      EQU (0x00000010) ; ADC SMP1 bit 1
ADC_SMPR1_SMP1_2      EQU (0x00000020) ; ADC SMP1 bit 2

ADC_SMPR1_SMP2        EQU (0x000001C0) ; ADC Channel 2 Sampling time selection
ADC_SMPR1_SMP2_0      EQU (0x00000040) ; ADC SMP2 bit 0
ADC_SMPR1_SMP2_1      EQU (0x00000080) ; ADC SMP2 bit 1
ADC_SMPR1_SMP2_2      EQU (0x00000100) ; ADC SMP2 bit 2

ADC_SMPR1_SMP3        EQU (0x00000E00) ; ADC Channel 3 Sampling time selection
ADC_SMPR1_SMP3_0      EQU (0x00000200) ; ADC SMP3 bit 0
ADC_SMPR1_SMP3_1      EQU (0x00000400) ; ADC SMP3 bit 1
ADC_SMPR1_SMP3_2      EQU (0x00000800) ; ADC SMP3 bit 2

ADC_SMPR1_SMP4        EQU (0x00007000) ; ADC Channel 4 Sampling time selection
ADC_SMPR1_SMP4_0      EQU (0x00001000) ; ADC SMP4 bit 0
ADC_SMPR1_SMP4_1      EQU (0x00002000) ; ADC SMP4 bit 1
ADC_SMPR1_SMP4_2      EQU (0x00004000) ; ADC SMP4 bit 2

ADC_SMPR1_SMP5        EQU (0x00038000) ; ADC Channel 5 Sampling time selection
ADC_SMPR1_SMP5_0      EQU (0x00008000) ; ADC SMP5 bit 0
ADC_SMPR1_SMP5_1      EQU (0x00010000) ; ADC SMP5 bit 1
ADC_SMPR1_SMP5_2      EQU (0x00020000) ; ADC SMP5 bit 2

ADC_SMPR1_SMP6        EQU (0x001C0000) ; ADC Channel 6 Sampling time selection
ADC_SMPR1_SMP6_0      EQU (0x00040000) ; ADC SMP6 bit 0
ADC_SMPR1_SMP6_1      EQU (0x00080000) ; ADC SMP6 bit 1
ADC_SMPR1_SMP6_2      EQU (0x00100000) ; ADC SMP6 bit 2

ADC_SMPR1_SMP7        EQU (0x00E00000) ; ADC Channel 7 Sampling time selection
ADC_SMPR1_SMP7_0      EQU (0x00200000) ; ADC SMP7 bit 0
ADC_SMPR1_SMP7_1      EQU (0x00400000) ; ADC SMP7 bit 1
ADC_SMPR1_SMP7_2      EQU (0x00800000) ; ADC SMP7 bit 2

ADC_SMPR1_SMP8        EQU (0x07000000) ; ADC Channel 8 Sampling time selection
ADC_SMPR1_SMP8_0      EQU (0x01000000) ; ADC SMP8 bit 0
ADC_SMPR1_SMP8_1      EQU (0x02000000) ; ADC SMP8 bit 1
ADC_SMPR1_SMP8_2      EQU (0x04000000) ; ADC SMP8 bit 2

ADC_SMPR1_SMP9        EQU (0x38000000) ; ADC Channel 9 Sampling time selection
ADC_SMPR1_SMP9_0      EQU (0x08000000) ; ADC SMP9 bit 0
ADC_SMPR1_SMP9_1      EQU (0x10000000) ; ADC SMP9 bit 1
ADC_SMPR1_SMP9_2      EQU (0x20000000) ; ADC SMP9 bit 2

; ********************  Bit definition for ADC_SMPR2 register  *******************
ADC_SMPR2_SMP10     EQU (0x00000007) ; ADC Channel 10 Sampling time selection
ADC_SMPR2_SMP10_0   EQU (0x00000001) ; ADC SMP10 bit 0
ADC_SMPR2_SMP10_1   EQU (0x00000002) ; ADC SMP10 bit 1
ADC_SMPR2_SMP10_2   EQU (0x00000004) ; ADC SMP10 bit 2

ADC_SMPR2_SMP11     EQU (0x00000038) ; ADC Channel 11 Sampling time selection
ADC_SMPR2_SMP11_0   EQU (0x00000008) ; ADC SMP11 bit 0
ADC_SMPR2_SMP11_1   EQU (0x00000010) ; ADC SMP11 bit 1
ADC_SMPR2_SMP11_2   EQU (0x00000020) ; ADC SMP11 bit 2

ADC_SMPR2_SMP12     EQU (0x000001C0) ; ADC Channel 12 Sampling time selection
ADC_SMPR2_SMP12_0   EQU (0x00000040) ; ADC SMP12 bit 0
ADC_SMPR2_SMP12_1   EQU (0x00000080) ; ADC SMP12 bit 1
ADC_SMPR2_SMP12_2   EQU (0x00000100) ; ADC SMP12 bit 2

ADC_SMPR2_SMP13     EQU (0x00000E00) ; ADC Channel 13 Sampling time selection
ADC_SMPR2_SMP13_0   EQU (0x00000200) ; ADC SMP13 bit 0
ADC_SMPR2_SMP13_1   EQU (0x00000400) ; ADC SMP13 bit 1
ADC_SMPR2_SMP13_2   EQU (0x00000800) ; ADC SMP13 bit 2

ADC_SMPR2_SMP14     EQU (0x00007000) ; ADC Channel 14 Sampling time selection
ADC_SMPR2_SMP14_0   EQU (0x00001000) ; ADC SMP14 bit 0
ADC_SMPR2_SMP14_1   EQU (0x00002000) ; ADC SMP14 bit 1
ADC_SMPR2_SMP14_2   EQU (0x00004000) ; ADC SMP14 bit 2

ADC_SMPR2_SMP15     EQU (0x00038000) ; ADC Channel 15 Sampling time selection
ADC_SMPR2_SMP15_0   EQU (0x00008000) ; ADC SMP15 bit 0
ADC_SMPR2_SMP15_1   EQU (0x00010000) ; ADC SMP15 bit 1
ADC_SMPR2_SMP15_2   EQU (0x00020000) ; ADC SMP15 bit 2

ADC_SMPR2_SMP16     EQU (0x001C0000) ; ADC Channel 16 Sampling time selection
ADC_SMPR2_SMP16_0   EQU (0x00040000) ; ADC SMP16 bit 0
ADC_SMPR2_SMP16_1   EQU (0x00080000) ; ADC SMP16 bit 1
ADC_SMPR2_SMP16_2   EQU (0x00100000) ; ADC SMP16 bit 2

ADC_SMPR2_SMP17     EQU (0x00E00000) ; ADC Channel 17 Sampling time selection
ADC_SMPR2_SMP17_0   EQU (0x00200000) ; ADC SMP17 bit 0
ADC_SMPR2_SMP17_1   EQU (0x00400000) ; ADC SMP17 bit 1
ADC_SMPR2_SMP17_2   EQU (0x00800000) ; ADC SMP17 bit 2

ADC_SMPR2_SMP18     EQU (0x07000000) ; ADC Channel 18 Sampling time selection
ADC_SMPR2_SMP18_0   EQU (0x01000000) ; ADC SMP18 bit 0
ADC_SMPR2_SMP18_1   EQU (0x02000000) ; ADC SMP18 bit 1
ADC_SMPR2_SMP18_2   EQU (0x04000000) ; ADC SMP18 bit 2

; ********************  Bit definition for ADC_TR1 register  *******************
ADC_TR1_LT1 EQU (0x00000FFF) ; ADC Analog watchdog 1 lower threshold
ADC_TR1_LT1_0       EQU (0x00000001) ; ADC LT1 bit 0
ADC_TR1_LT1_1       EQU (0x00000002) ; ADC LT1 bit 1
ADC_TR1_LT1_2       EQU (0x00000004) ; ADC LT1 bit 2
ADC_TR1_LT1_3       EQU (0x00000008) ; ADC LT1 bit 3
ADC_TR1_LT1_4       EQU (0x00000010) ; ADC LT1 bit 4
ADC_TR1_LT1_5       EQU (0x00000020) ; ADC LT1 bit 5
ADC_TR1_LT1_6       EQU (0x00000040) ; ADC LT1 bit 6
ADC_TR1_LT1_7       EQU (0x00000080) ; ADC LT1 bit 7
ADC_TR1_LT1_8       EQU (0x00000100) ; ADC LT1 bit 8
ADC_TR1_LT1_9       EQU (0x00000200) ; ADC LT1 bit 9
ADC_TR1_LT1_10      EQU (0x00000400) ; ADC LT1 bit 10
ADC_TR1_LT1_11      EQU (0x00000800) ; ADC LT1 bit 11

ADC_TR1_HT1 EQU (0x0FFF0000) ; ADC Analog watchdog 1 higher threshold
ADC_TR1_HT1_0       EQU (0x00010000) ; ADC HT1 bit 0
ADC_TR1_HT1_1       EQU (0x00020000) ; ADC HT1 bit 1
ADC_TR1_HT1_2       EQU (0x00040000) ; ADC HT1 bit 2
ADC_TR1_HT1_3       EQU (0x00080000) ; ADC HT1 bit 3
ADC_TR1_HT1_4       EQU (0x00100000) ; ADC HT1 bit 4
ADC_TR1_HT1_5       EQU (0x00200000) ; ADC HT1 bit 5
ADC_TR1_HT1_6       EQU (0x00400000) ; ADC HT1 bit 6
ADC_TR1_HT1_7       EQU (0x00800000) ; ADC HT1 bit 7
ADC_TR1_HT1_8       EQU (0x01000000) ; ADC HT1 bit 8
ADC_TR1_HT1_9       EQU (0x02000000) ; ADC HT1 bit 9
ADC_TR1_HT1_10      EQU (0x04000000) ; ADC HT1 bit 10
ADC_TR1_HT1_11      EQU (0x08000000) ; ADC HT1 bit 11

; ********************  Bit definition for ADC_TR2 register  *******************
ADC_TR2_LT2 EQU (0x000000FF) ; ADC Analog watchdog 2 lower threshold
ADC_TR2_LT2_0       EQU (0x00000001) ; ADC LT2 bit 0
ADC_TR2_LT2_1       EQU (0x00000002) ; ADC LT2 bit 1
ADC_TR2_LT2_2       EQU (0x00000004) ; ADC LT2 bit 2
ADC_TR2_LT2_3       EQU (0x00000008) ; ADC LT2 bit 3
ADC_TR2_LT2_4       EQU (0x00000010) ; ADC LT2 bit 4
ADC_TR2_LT2_5       EQU (0x00000020) ; ADC LT2 bit 5
ADC_TR2_LT2_6       EQU (0x00000040) ; ADC LT2 bit 6
ADC_TR2_LT2_7       EQU (0x00000080) ; ADC LT2 bit 7

ADC_TR2_HT2 EQU (0x00FF0000) ; ADC Analog watchdog 2 higher threshold
ADC_TR2_HT2_0       EQU (0x00010000) ; ADC HT2 bit 0
ADC_TR2_HT2_1       EQU (0x00020000) ; ADC HT2 bit 1
ADC_TR2_HT2_2       EQU (0x00040000) ; ADC HT2 bit 2
ADC_TR2_HT2_3       EQU (0x00080000) ; ADC HT2 bit 3
ADC_TR2_HT2_4       EQU (0x00100000) ; ADC HT2 bit 4
ADC_TR2_HT2_5       EQU (0x00200000) ; ADC HT2 bit 5
ADC_TR2_HT2_6       EQU (0x00400000) ; ADC HT2 bit 6
ADC_TR2_HT2_7       EQU (0x00800000) ; ADC HT2 bit 7

