Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bit definition for ADC_TR3 register  *******************
ADC_TR3_LT3 EQU (0x000000FF) ; ADC Analog watchdog 3 lower threshold
ADC_TR3_LT3_0       EQU (0x00000001) ; ADC LT3 bit 0
ADC_TR3_LT3_1       EQU (0x00000002) ; ADC LT3 bit 1
ADC_TR3_LT3_2       EQU (0x00000004) ; ADC LT3 bit 2
ADC_TR3_LT3_3       EQU (0x00000008) ; ADC LT3 bit 3
ADC_TR3_LT3_4       EQU (0x00000010) ; ADC LT3 bit 4
ADC_TR3_LT3_5       EQU (0x00000020) ; ADC LT3 bit 5
ADC_TR3_LT3_6       EQU (0x00000040) ; ADC LT3 bit 6
ADC_TR3_LT3_7       EQU (0x00000080) ; ADC LT3 bit 7

ADC_TR3_HT3 EQU (0x00FF0000) ; ADC Analog watchdog 3 higher threshold
ADC_TR3_HT3_0       EQU (0x00010000) ; ADC HT3 bit 0
ADC_TR3_HT3_1       EQU (0x00020000) ; ADC HT3 bit 1
ADC_TR3_HT3_2       EQU (0x00040000) ; ADC HT3 bit 2
ADC_TR3_HT3_3       EQU (0x00080000) ; ADC HT3 bit 3
ADC_TR3_HT3_4       EQU (0x00100000) ; ADC HT3 bit 4
ADC_TR3_HT3_5       EQU (0x00200000) ; ADC HT3 bit 5
ADC_TR3_HT3_6       EQU (0x00400000) ; ADC HT3 bit 6
ADC_TR3_HT3_7       EQU (0x00800000) ; ADC HT3 bit 7

; ********************  Bit definition for ADC_SQR1 register  *******************
ADC_SQR1_L  EQU (0x0000000F) ; ADC regular channel sequence lenght
ADC_SQR1_L_0        EQU (0x00000001) ; ADC L bit 0
ADC_SQR1_L_1        EQU (0x00000002) ; ADC L bit 1
ADC_SQR1_L_2        EQU (0x00000004) ; ADC L bit 2
ADC_SQR1_L_3        EQU (0x00000008) ; ADC L bit 3

ADC_SQR1_SQ1        EQU (0x000007C0) ; ADC 1st conversion in regular sequence
ADC_SQR1_SQ1_0      EQU (0x00000040) ; ADC SQ1 bit 0
ADC_SQR1_SQ1_1      EQU (0x00000080) ; ADC SQ1 bit 1
ADC_SQR1_SQ1_2      EQU (0x00000100) ; ADC SQ1 bit 2
ADC_SQR1_SQ1_3      EQU (0x00000200) ; ADC SQ1 bit 3
ADC_SQR1_SQ1_4      EQU (0x00000400) ; ADC SQ1 bit 4

ADC_SQR1_SQ2        EQU (0x0001F000) ; ADC 2nd conversion in regular sequence
ADC_SQR1_SQ2_0      EQU (0x00001000) ; ADC SQ2 bit 0
ADC_SQR1_SQ2_1      EQU (0x00002000) ; ADC SQ2 bit 1
ADC_SQR1_SQ2_2      EQU (0x00004000) ; ADC SQ2 bit 2
ADC_SQR1_SQ2_3      EQU (0x00008000) ; ADC SQ2 bit 3
ADC_SQR1_SQ2_4      EQU (0x00010000) ; ADC SQ2 bit 4

ADC_SQR1_SQ3        EQU (0x007C0000) ; ADC 3rd conversion in regular sequence
ADC_SQR1_SQ3_0      EQU (0x00040000) ; ADC SQ3 bit 0
ADC_SQR1_SQ3_1      EQU (0x00080000) ; ADC SQ3 bit 1
ADC_SQR1_SQ3_2      EQU (0x00100000) ; ADC SQ3 bit 2
ADC_SQR1_SQ3_3      EQU (0x00200000) ; ADC SQ3 bit 3
ADC_SQR1_SQ3_4      EQU (0x00400000) ; ADC SQ3 bit 4

ADC_SQR1_SQ4        EQU (0x1F000000) ; ADC 4th conversion in regular sequence
ADC_SQR1_SQ4_0      EQU (0x01000000) ; ADC SQ4 bit 0
ADC_SQR1_SQ4_1      EQU (0x02000000) ; ADC SQ4 bit 1
ADC_SQR1_SQ4_2      EQU (0x04000000) ; ADC SQ4 bit 2
ADC_SQR1_SQ4_3      EQU (0x08000000) ; ADC SQ4 bit 3
ADC_SQR1_SQ4_4      EQU (0x10000000) ; ADC SQ4 bit 4

; ********************  Bit definition for ADC_SQR2 register  *******************
ADC_SQR2_SQ5        EQU (0x0000001F) ; ADC 5th conversion in regular sequence
ADC_SQR2_SQ5_0      EQU (0x00000001) ; ADC SQ5 bit 0
ADC_SQR2_SQ5_1      EQU (0x00000002) ; ADC SQ5 bit 1
ADC_SQR2_SQ5_2      EQU (0x00000004) ; ADC SQ5 bit 2
ADC_SQR2_SQ5_3      EQU (0x00000008) ; ADC SQ5 bit 3
ADC_SQR2_SQ5_4      EQU (0x00000010) ; ADC SQ5 bit 4

ADC_SQR2_SQ6        EQU (0x000007C0) ; ADC 6th conversion in regular sequence
ADC_SQR2_SQ6_0      EQU (0x00000040) ; ADC SQ6 bit 0
ADC_SQR2_SQ6_1      EQU (0x00000080) ; ADC SQ6 bit 1
ADC_SQR2_SQ6_2      EQU (0x00000100) ; ADC SQ6 bit 2
ADC_SQR2_SQ6_3      EQU (0x00000200) ; ADC SQ6 bit 3
ADC_SQR2_SQ6_4      EQU (0x00000400) ; ADC SQ6 bit 4

ADC_SQR2_SQ7        EQU (0x0001F000) ; ADC 7th conversion in regular sequence
ADC_SQR2_SQ7_0      EQU (0x00001000) ; ADC SQ7 bit 0
ADC_SQR2_SQ7_1      EQU (0x00002000) ; ADC SQ7 bit 1
ADC_SQR2_SQ7_2      EQU (0x00004000) ; ADC SQ7 bit 2
ADC_SQR2_SQ7_3      EQU (0x00008000) ; ADC SQ7 bit 3
ADC_SQR2_SQ7_4      EQU (0x00010000) ; ADC SQ7 bit 4

ADC_SQR2_SQ8        EQU (0x007C0000) ; ADC 8th conversion in regular sequence
ADC_SQR2_SQ8_0      EQU (0x00040000) ; ADC SQ8 bit 0
ADC_SQR2_SQ8_1      EQU (0x00080000) ; ADC SQ8 bit 1
ADC_SQR2_SQ8_2      EQU (0x00100000) ; ADC SQ8 bit 2
ADC_SQR2_SQ8_3      EQU (0x00200000) ; ADC SQ8 bit 3
ADC_SQR2_SQ8_4      EQU (0x00400000) ; ADC SQ8 bit 4

ADC_SQR2_SQ9        EQU (0x1F000000) ; ADC 9th conversion in regular sequence
ADC_SQR2_SQ9_0      EQU (0x01000000) ; ADC SQ9 bit 0
ADC_SQR2_SQ9_1      EQU (0x02000000) ; ADC SQ9 bit 1
ADC_SQR2_SQ9_2      EQU (0x04000000) ; ADC SQ9 bit 2
ADC_SQR2_SQ9_3      EQU (0x08000000) ; ADC SQ9 bit 3
ADC_SQR2_SQ9_4      EQU (0x10000000) ; ADC SQ9 bit 4

; ********************  Bit definition for ADC_SQR3 register  *******************
ADC_SQR3_SQ10       EQU (0x0000001F) ; ADC 10th conversion in regular sequence
ADC_SQR3_SQ10_0     EQU (0x00000001) ; ADC SQ10 bit 0
ADC_SQR3_SQ10_1     EQU (0x00000002) ; ADC SQ10 bit 1
ADC_SQR3_SQ10_2     EQU (0x00000004) ; ADC SQ10 bit 2
ADC_SQR3_SQ10_3     EQU (0x00000008) ; ADC SQ10 bit 3
ADC_SQR3_SQ10_4     EQU (0x00000010) ; ADC SQ10 bit 4

ADC_SQR3_SQ11       EQU (0x000007C0) ; ADC 11th conversion in regular sequence
ADC_SQR3_SQ11_0     EQU (0x00000040) ; ADC SQ11 bit 0
ADC_SQR3_SQ11_1     EQU (0x00000080) ; ADC SQ11 bit 1
ADC_SQR3_SQ11_2     EQU (0x00000100) ; ADC SQ11 bit 2
ADC_SQR3_SQ11_3     EQU (0x00000200) ; ADC SQ11 bit 3
ADC_SQR3_SQ11_4     EQU (0x00000400) ; ADC SQ11 bit 4

ADC_SQR3_SQ12       EQU (0x0001F000) ; ADC 12th conversion in regular sequence
ADC_SQR3_SQ12_0     EQU (0x00001000) ; ADC SQ12 bit 0
ADC_SQR3_SQ12_1     EQU (0x00002000) ; ADC SQ12 bit 1
ADC_SQR3_SQ12_2     EQU (0x00004000) ; ADC SQ12 bit 2
ADC_SQR3_SQ12_3     EQU (0x00008000) ; ADC SQ12 bit 3
ADC_SQR3_SQ12_4     EQU (0x00010000) ; ADC SQ12 bit 4

ADC_SQR3_SQ13       EQU (0x007C0000) ; ADC 13th conversion in regular sequence
ADC_SQR3_SQ13_0     EQU (0x00040000) ; ADC SQ13 bit 0
ADC_SQR3_SQ13_1     EQU (0x00080000) ; ADC SQ13 bit 1
ADC_SQR3_SQ13_2     EQU (0x00100000) ; ADC SQ13 bit 2
ADC_SQR3_SQ13_3     EQU (0x00200000) ; ADC SQ13 bit 3
ADC_SQR3_SQ13_4     EQU (0x00400000) ; ADC SQ13 bit 4

ADC_SQR3_SQ14       EQU (0x1F000000) ; ADC 14th conversion in regular sequence
ADC_SQR3_SQ14_0     EQU (0x01000000) ; ADC SQ14 bit 0
ADC_SQR3_SQ14_1     EQU (0x02000000) ; ADC SQ14 bit 1
ADC_SQR3_SQ14_2     EQU (0x04000000) ; ADC SQ14 bit 2
ADC_SQR3_SQ14_3     EQU (0x08000000) ; ADC SQ14 bit 3
ADC_SQR3_SQ14_4     EQU (0x10000000) ; ADC SQ14 bit 4

