Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bit definition for ADC_SQR4 register  *******************
ADC_SQR4_SQ15       EQU (0x0000001F) ; ADC 15th conversion in regular sequence
ADC_SQR4_SQ15_0     EQU (0x00000001) ; ADC SQ15 bit 0
ADC_SQR4_SQ15_1     EQU (0x00000002) ; ADC SQ15 bit 1
ADC_SQR4_SQ15_2     EQU (0x00000004) ; ADC SQ15 bit 2
ADC_SQR4_SQ15_3     EQU (0x00000008) ; ADC SQ15 bit 3
ADC_SQR4_SQ15_4     EQU (0x00000010) ; ADC SQ105 bit 4

ADC_SQR4_SQ16       EQU (0x000007C0) ; ADC 16th conversion in regular sequence
ADC_SQR4_SQ16_0     EQU (0x00000040) ; ADC SQ16 bit 0
ADC_SQR4_SQ16_1     EQU (0x00000080) ; ADC SQ16 bit 1
ADC_SQR4_SQ16_2     EQU (0x00000100) ; ADC SQ16 bit 2
ADC_SQR4_SQ16_3     EQU (0x00000200) ; ADC SQ16 bit 3
ADC_SQR4_SQ16_4     EQU (0x00000400) ; ADC SQ16 bit 4

; ********************  Bit definition for ADC_DR register  *******************
ADC_DR_RDATA        EQU (0x0000FFFF) ; ADC regular Data converted
ADC_DR_RDATA_0      EQU (0x00000001) ; ADC RDATA bit 0
ADC_DR_RDATA_1      EQU (0x00000002) ; ADC RDATA bit 1
ADC_DR_RDATA_2      EQU (0x00000004) ; ADC RDATA bit 2
ADC_DR_RDATA_3      EQU (0x00000008) ; ADC RDATA bit 3
ADC_DR_RDATA_4      EQU (0x00000010) ; ADC RDATA bit 4
ADC_DR_RDATA_5      EQU (0x00000020) ; ADC RDATA bit 5
ADC_DR_RDATA_6      EQU (0x00000040) ; ADC RDATA bit 6
ADC_DR_RDATA_7      EQU (0x00000080) ; ADC RDATA bit 7
ADC_DR_RDATA_8      EQU (0x00000100) ; ADC RDATA bit 8
ADC_DR_RDATA_9      EQU (0x00000200) ; ADC RDATA bit 9
ADC_DR_RDATA_10     EQU (0x00000400) ; ADC RDATA bit 10
ADC_DR_RDATA_11     EQU (0x00000800) ; ADC RDATA bit 11
ADC_DR_RDATA_12     EQU (0x00001000) ; ADC RDATA bit 12
ADC_DR_RDATA_13     EQU (0x00002000) ; ADC RDATA bit 13
ADC_DR_RDATA_14     EQU (0x00004000) ; ADC RDATA bit 14
ADC_DR_RDATA_15     EQU (0x00008000) ; ADC RDATA bit 15

; ********************  Bit definition for ADC_JSQR register  *******************
ADC_JSQR_JL EQU (0x00000003) ; ADC injected channel sequence length
ADC_JSQR_JL_0       EQU (0x00000001) ; ADC JL bit 0
ADC_JSQR_JL_1       EQU (0x00000002) ; ADC JL bit 1

ADC_JSQR_JEXTSEL    EQU (0x0000003C) ; ADC external trigger selection for injected group
ADC_JSQR_JEXTSEL_0  EQU (0x00000004) ; ADC JEXTSEL bit 0
ADC_JSQR_JEXTSEL_1  EQU (0x00000008) ; ADC JEXTSEL bit 1
ADC_JSQR_JEXTSEL_2  EQU (0x00000010) ; ADC JEXTSEL bit 2
ADC_JSQR_JEXTSEL_3  EQU (0x00000020) ; ADC JEXTSEL bit 3

ADC_JSQR_JEXTEN     EQU (0x000000C0) ; ADC external trigger enable and polarity selection for injected channels
ADC_JSQR_JEXTEN_0   EQU (0x00000040) ; ADC JEXTEN bit 0
ADC_JSQR_JEXTEN_1   EQU (0x00000080) ; ADC JEXTEN bit 1

ADC_JSQR_JSQ1       EQU (0x00001F00) ; ADC 1st conversion in injected sequence
ADC_JSQR_JSQ1_0     EQU (0x00000100) ; ADC JSQ1 bit 0
ADC_JSQR_JSQ1_1     EQU (0x00000200) ; ADC JSQ1 bit 1
ADC_JSQR_JSQ1_2     EQU (0x00000400) ; ADC JSQ1 bit 2
ADC_JSQR_JSQ1_3     EQU (0x00000800) ; ADC JSQ1 bit 3
ADC_JSQR_JSQ1_4     EQU (0x00001000) ; ADC JSQ1 bit 4

ADC_JSQR_JSQ2       EQU (0x0007C000) ; ADC 2nd conversion in injected sequence
ADC_JSQR_JSQ2_0     EQU (0x00004000) ; ADC JSQ2 bit 0
ADC_JSQR_JSQ2_1     EQU (0x00008000) ; ADC JSQ2 bit 1
ADC_JSQR_JSQ2_2     EQU (0x00010000) ; ADC JSQ2 bit 2
ADC_JSQR_JSQ2_3     EQU (0x00020000) ; ADC JSQ2 bit 3
ADC_JSQR_JSQ2_4     EQU (0x00040000) ; ADC JSQ2 bit 4

ADC_JSQR_JSQ3       EQU (0x01F00000) ; ADC 3rd conversion in injected sequence
ADC_JSQR_JSQ3_0     EQU (0x00100000) ; ADC JSQ3 bit 0
ADC_JSQR_JSQ3_1     EQU (0x00200000) ; ADC JSQ3 bit 1
ADC_JSQR_JSQ3_2     EQU (0x00400000) ; ADC JSQ3 bit 2
ADC_JSQR_JSQ3_3     EQU (0x00800000) ; ADC JSQ3 bit 3
ADC_JSQR_JSQ3_4     EQU (0x01000000) ; ADC JSQ3 bit 4

ADC_JSQR_JSQ4       EQU (0x7C000000) ; ADC 4th conversion in injected sequence
ADC_JSQR_JSQ4_0     EQU (0x04000000) ; ADC JSQ4 bit 0
ADC_JSQR_JSQ4_1     EQU (0x08000000) ; ADC JSQ4 bit 1
ADC_JSQR_JSQ4_2     EQU (0x10000000) ; ADC JSQ4 bit 2
ADC_JSQR_JSQ4_3     EQU (0x20000000) ; ADC JSQ4 bit 3
ADC_JSQR_JSQ4_4     EQU (0x40000000) ; ADC JSQ4 bit 4


; ********************  Bit definition for ADC_OFR1 register  *******************
ADC_OFR1_OFFSET1    EQU (0x00000FFF) ; ADC data offset 1 for channel programmed into bits OFFSET1_CH[4:0]
ADC_OFR1_OFFSET1_0  EQU (0x00000001) ; ADC OFFSET1 bit 0
ADC_OFR1_OFFSET1_1  EQU (0x00000002) ; ADC OFFSET1 bit 1
ADC_OFR1_OFFSET1_2  EQU (0x00000004) ; ADC OFFSET1 bit 2
ADC_OFR1_OFFSET1_3  EQU (0x00000008) ; ADC OFFSET1 bit 3
ADC_OFR1_OFFSET1_4  EQU (0x00000010) ; ADC OFFSET1 bit 4
ADC_OFR1_OFFSET1_5  EQU (0x00000020) ; ADC OFFSET1 bit 5
ADC_OFR1_OFFSET1_6  EQU (0x00000040) ; ADC OFFSET1 bit 6
ADC_OFR1_OFFSET1_7  EQU (0x00000080) ; ADC OFFSET1 bit 7
ADC_OFR1_OFFSET1_8  EQU (0x00000100) ; ADC OFFSET1 bit 8
ADC_OFR1_OFFSET1_9  EQU (0x00000200) ; ADC OFFSET1 bit 9
ADC_OFR1_OFFSET1_10 EQU (0x00000400) ; ADC OFFSET1 bit 10
ADC_OFR1_OFFSET1_11 EQU (0x00000800) ; ADC OFFSET1 bit 11

ADC_OFR1_OFFSET1_CH    EQU (0x7C000000) ; ADC Channel selection for the data offset 1
ADC_OFR1_OFFSET1_CH_0  EQU (0x04000000) ; ADC OFFSET1_CH bit 0
ADC_OFR1_OFFSET1_CH_1  EQU (0x08000000) ; ADC OFFSET1_CH bit 1
ADC_OFR1_OFFSET1_CH_2  EQU (0x10000000) ; ADC OFFSET1_CH bit 2
ADC_OFR1_OFFSET1_CH_3  EQU (0x20000000) ; ADC OFFSET1_CH bit 3
ADC_OFR1_OFFSET1_CH_4  EQU (0x40000000) ; ADC OFFSET1_CH bit 4

ADC_OFR1_OFFSET1_EN    EQU (0x80000000) ; ADC offset 1 enable

; ********************  Bit definition for ADC_OFR2 register  *******************
ADC_OFR2_OFFSET2    EQU (0x00000FFF) ; ADC data offset 2 for channel programmed into bits OFFSET2_CH[4:0]
ADC_OFR2_OFFSET2_0  EQU (0x00000001) ; ADC OFFSET2 bit 0
ADC_OFR2_OFFSET2_1  EQU (0x00000002) ; ADC OFFSET2 bit 1
ADC_OFR2_OFFSET2_2  EQU (0x00000004) ; ADC OFFSET2 bit 2
ADC_OFR2_OFFSET2_3  EQU (0x00000008) ; ADC OFFSET2 bit 3
ADC_OFR2_OFFSET2_4  EQU (0x00000010) ; ADC OFFSET2 bit 4
ADC_OFR2_OFFSET2_5  EQU (0x00000020) ; ADC OFFSET2 bit 5
ADC_OFR2_OFFSET2_6  EQU (0x00000040) ; ADC OFFSET2 bit 6
ADC_OFR2_OFFSET2_7  EQU (0x00000080) ; ADC OFFSET2 bit 7
ADC_OFR2_OFFSET2_8  EQU (0x00000100) ; ADC OFFSET2 bit 8
ADC_OFR2_OFFSET2_9  EQU (0x00000200) ; ADC OFFSET2 bit 9
ADC_OFR2_OFFSET2_10 EQU (0x00000400) ; ADC OFFSET2 bit 10
ADC_OFR2_OFFSET2_11 EQU (0x00000800) ; ADC OFFSET2 bit 11

ADC_OFR2_OFFSET2_CH    EQU (0x7C000000) ; ADC Channel selection for the data offset 2
ADC_OFR2_OFFSET2_CH_0  EQU (0x04000000) ; ADC OFFSET2_CH bit 0
ADC_OFR2_OFFSET2_CH_1  EQU (0x08000000) ; ADC OFFSET2_CH bit 1
ADC_OFR2_OFFSET2_CH_2  EQU (0x10000000) ; ADC OFFSET2_CH bit 2
ADC_OFR2_OFFSET2_CH_3  EQU (0x20000000) ; ADC OFFSET2_CH bit 3
ADC_OFR2_OFFSET2_CH_4  EQU (0x40000000) ; ADC OFFSET2_CH bit 4

ADC_OFR2_OFFSET2_EN    EQU (0x80000000) ; ADC offset 2 enable

; ********************  Bit definition for ADC_OFR3 register  *******************
ADC_OFR3_OFFSET3    EQU (0x00000FFF) ; ADC data offset 3 for channel programmed into bits OFFSET3_CH[4:0]
ADC_OFR3_OFFSET3_0  EQU (0x00000001) ; ADC OFFSET3 bit 0
ADC_OFR3_OFFSET3_1  EQU (0x00000002) ; ADC OFFSET3 bit 1
ADC_OFR3_OFFSET3_2  EQU (0x00000004) ; ADC OFFSET3 bit 2
ADC_OFR3_OFFSET3_3  EQU (0x00000008) ; ADC OFFSET3 bit 3
ADC_OFR3_OFFSET3_4  EQU (0x00000010) ; ADC OFFSET3 bit 4
ADC_OFR3_OFFSET3_5  EQU (0x00000020) ; ADC OFFSET3 bit 5
ADC_OFR3_OFFSET3_6  EQU (0x00000040) ; ADC OFFSET3 bit 6
ADC_OFR3_OFFSET3_7  EQU (0x00000080) ; ADC OFFSET3 bit 7
ADC_OFR3_OFFSET3_8  EQU (0x00000100) ; ADC OFFSET3 bit 8
ADC_OFR3_OFFSET3_9  EQU (0x00000200) ; ADC OFFSET3 bit 9
ADC_OFR3_OFFSET3_10 EQU (0x00000400) ; ADC OFFSET3 bit 10
ADC_OFR3_OFFSET3_11 EQU (0x00000800) ; ADC OFFSET3 bit 11

ADC_OFR3_OFFSET3_CH    EQU (0x7C000000) ; ADC Channel selection for the data offset 3
ADC_OFR3_OFFSET3_CH_0  EQU (0x04000000) ; ADC OFFSET3_CH bit 0
ADC_OFR3_OFFSET3_CH_1  EQU (0x08000000) ; ADC OFFSET3_CH bit 1
ADC_OFR3_OFFSET3_CH_2  EQU (0x10000000) ; ADC OFFSET3_CH bit 2
ADC_OFR3_OFFSET3_CH_3  EQU (0x20000000) ; ADC OFFSET3_CH bit 3
ADC_OFR3_OFFSET3_CH_4  EQU (0x40000000) ; ADC OFFSET3_CH bit 4

