Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
ADC_OFR3_OFFSET3_EN    EQU (0x80000000) ; ADC offset 3 enable

; ********************  Bit definition for ADC_OFR4 register  *******************
ADC_OFR4_OFFSET4    EQU (0x00000FFF) ; ADC data offset 4 for channel programmed into bits OFFSET4_CH[4:0]
ADC_OFR4_OFFSET4_0  EQU (0x00000001) ; ADC OFFSET4 bit 0
ADC_OFR4_OFFSET4_1  EQU (0x00000002) ; ADC OFFSET4 bit 1
ADC_OFR4_OFFSET4_2  EQU (0x00000004) ; ADC OFFSET4 bit 2
ADC_OFR4_OFFSET4_3  EQU (0x00000008) ; ADC OFFSET4 bit 3
ADC_OFR4_OFFSET4_4  EQU (0x00000010) ; ADC OFFSET4 bit 4
ADC_OFR4_OFFSET4_5  EQU (0x00000020) ; ADC OFFSET4 bit 5
ADC_OFR4_OFFSET4_6  EQU (0x00000040) ; ADC OFFSET4 bit 6
ADC_OFR4_OFFSET4_7  EQU (0x00000080) ; ADC OFFSET4 bit 7
ADC_OFR4_OFFSET4_8  EQU (0x00000100) ; ADC OFFSET4 bit 8
ADC_OFR4_OFFSET4_9  EQU (0x00000200) ; ADC OFFSET4 bit 9
ADC_OFR4_OFFSET4_10 EQU (0x00000400) ; ADC OFFSET4 bit 10
ADC_OFR4_OFFSET4_11 EQU (0x00000800) ; ADC OFFSET4 bit 11

ADC_OFR4_OFFSET4_CH    EQU (0x7C000000) ; ADC Channel selection for the data offset 4
ADC_OFR4_OFFSET4_CH_0  EQU (0x04000000) ; ADC OFFSET4_CH bit 0
ADC_OFR4_OFFSET4_CH_1  EQU (0x08000000) ; ADC OFFSET4_CH bit 1
ADC_OFR4_OFFSET4_CH_2  EQU (0x10000000) ; ADC OFFSET4_CH bit 2
ADC_OFR4_OFFSET4_CH_3  EQU (0x20000000) ; ADC OFFSET4_CH bit 3
ADC_OFR4_OFFSET4_CH_4  EQU (0x40000000) ; ADC OFFSET4_CH bit 4

ADC_OFR4_OFFSET4_EN    EQU (0x80000000) ; ADC offset 4 enable

; ********************  Bit definition for ADC_JDR1 register  *******************
ADC_JDR1_JDATA      EQU (0x0000FFFF) ; ADC Injected DATA
ADC_JDR1_JDATA_0    EQU (0x00000001) ; ADC JDATA bit 0
ADC_JDR1_JDATA_1    EQU (0x00000002) ; ADC JDATA bit 1
ADC_JDR1_JDATA_2    EQU (0x00000004) ; ADC JDATA bit 2
ADC_JDR1_JDATA_3    EQU (0x00000008) ; ADC JDATA bit 3
ADC_JDR1_JDATA_4    EQU (0x00000010) ; ADC JDATA bit 4
ADC_JDR1_JDATA_5    EQU (0x00000020) ; ADC JDATA bit 5
ADC_JDR1_JDATA_6    EQU (0x00000040) ; ADC JDATA bit 6
ADC_JDR1_JDATA_7    EQU (0x00000080) ; ADC JDATA bit 7
ADC_JDR1_JDATA_8    EQU (0x00000100) ; ADC JDATA bit 8
ADC_JDR1_JDATA_9    EQU (0x00000200) ; ADC JDATA bit 9
ADC_JDR1_JDATA_10   EQU (0x00000400) ; ADC JDATA bit 10
ADC_JDR1_JDATA_11   EQU (0x00000800) ; ADC JDATA bit 11
ADC_JDR1_JDATA_12   EQU (0x00001000) ; ADC JDATA bit 12
ADC_JDR1_JDATA_13   EQU (0x00002000) ; ADC JDATA bit 13
ADC_JDR1_JDATA_14   EQU (0x00004000) ; ADC JDATA bit 14
ADC_JDR1_JDATA_15   EQU (0x00008000) ; ADC JDATA bit 15

; ********************  Bit definition for ADC_JDR2 register  *******************
ADC_JDR2_JDATA      EQU (0x0000FFFF) ; ADC Injected DATA
ADC_JDR2_JDATA_0    EQU (0x00000001) ; ADC JDATA bit 0
ADC_JDR2_JDATA_1    EQU (0x00000002) ; ADC JDATA bit 1
ADC_JDR2_JDATA_2    EQU (0x00000004) ; ADC JDATA bit 2
ADC_JDR2_JDATA_3    EQU (0x00000008) ; ADC JDATA bit 3
ADC_JDR2_JDATA_4    EQU (0x00000010) ; ADC JDATA bit 4
ADC_JDR2_JDATA_5    EQU (0x00000020) ; ADC JDATA bit 5
ADC_JDR2_JDATA_6    EQU (0x00000040) ; ADC JDATA bit 6
ADC_JDR2_JDATA_7    EQU (0x00000080) ; ADC JDATA bit 7
ADC_JDR2_JDATA_8    EQU (0x00000100) ; ADC JDATA bit 8
ADC_JDR2_JDATA_9    EQU (0x00000200) ; ADC JDATA bit 9
ADC_JDR2_JDATA_10   EQU (0x00000400) ; ADC JDATA bit 10
ADC_JDR2_JDATA_11   EQU (0x00000800) ; ADC JDATA bit 11
ADC_JDR2_JDATA_12   EQU (0x00001000) ; ADC JDATA bit 12
ADC_JDR2_JDATA_13   EQU (0x00002000) ; ADC JDATA bit 13
ADC_JDR2_JDATA_14   EQU (0x00004000) ; ADC JDATA bit 14
ADC_JDR2_JDATA_15   EQU (0x00008000) ; ADC JDATA bit 15

; ********************  Bit definition for ADC_JDR3 register  *******************
ADC_JDR3_JDATA      EQU (0x0000FFFF) ; ADC Injected DATA
ADC_JDR3_JDATA_0    EQU (0x00000001) ; ADC JDATA bit 0
ADC_JDR3_JDATA_1    EQU (0x00000002) ; ADC JDATA bit 1
ADC_JDR3_JDATA_2    EQU (0x00000004) ; ADC JDATA bit 2
ADC_JDR3_JDATA_3    EQU (0x00000008) ; ADC JDATA bit 3
ADC_JDR3_JDATA_4    EQU (0x00000010) ; ADC JDATA bit 4
ADC_JDR3_JDATA_5    EQU (0x00000020) ; ADC JDATA bit 5
ADC_JDR3_JDATA_6    EQU (0x00000040) ; ADC JDATA bit 6
ADC_JDR3_JDATA_7    EQU (0x00000080) ; ADC JDATA bit 7
ADC_JDR3_JDATA_8    EQU (0x00000100) ; ADC JDATA bit 8
ADC_JDR3_JDATA_9    EQU (0x00000200) ; ADC JDATA bit 9
ADC_JDR3_JDATA_10   EQU (0x00000400) ; ADC JDATA bit 10
ADC_JDR3_JDATA_11   EQU (0x00000800) ; ADC JDATA bit 11
ADC_JDR3_JDATA_12   EQU (0x00001000) ; ADC JDATA bit 12
ADC_JDR3_JDATA_13   EQU (0x00002000) ; ADC JDATA bit 13
ADC_JDR3_JDATA_14   EQU (0x00004000) ; ADC JDATA bit 14
ADC_JDR3_JDATA_15   EQU (0x00008000) ; ADC JDATA bit 15

; ********************  Bit definition for ADC_JDR4 register  *******************
ADC_JDR4_JDATA      EQU (0x0000FFFF) ; ADC Injected DATA
ADC_JDR4_JDATA_0    EQU (0x00000001) ; ADC JDATA bit 0
ADC_JDR4_JDATA_1    EQU (0x00000002) ; ADC JDATA bit 1
ADC_JDR4_JDATA_2    EQU (0x00000004) ; ADC JDATA bit 2
ADC_JDR4_JDATA_3    EQU (0x00000008) ; ADC JDATA bit 3
ADC_JDR4_JDATA_4    EQU (0x00000010) ; ADC JDATA bit 4
ADC_JDR4_JDATA_5    EQU (0x00000020) ; ADC JDATA bit 5
ADC_JDR4_JDATA_6    EQU (0x00000040) ; ADC JDATA bit 6
ADC_JDR4_JDATA_7    EQU (0x00000080) ; ADC JDATA bit 7
ADC_JDR4_JDATA_8    EQU (0x00000100) ; ADC JDATA bit 8
ADC_JDR4_JDATA_9    EQU (0x00000200) ; ADC JDATA bit 9
ADC_JDR4_JDATA_10   EQU (0x00000400) ; ADC JDATA bit 10
ADC_JDR4_JDATA_11   EQU (0x00000800) ; ADC JDATA bit 11
ADC_JDR4_JDATA_12   EQU (0x00001000) ; ADC JDATA bit 12
ADC_JDR4_JDATA_13   EQU (0x00002000) ; ADC JDATA bit 13
ADC_JDR4_JDATA_14   EQU (0x00004000) ; ADC JDATA bit 14
ADC_JDR4_JDATA_15   EQU (0x00008000) ; ADC JDATA bit 15

; ********************  Bit definition for ADC_AWD2CR register  *******************
ADC_AWD2CR_AWD2CH    EQU (0x0007FFFF) ; ADC Analog watchdog 2 channel selection
ADC_AWD2CR_AWD2CH_0  EQU (0x00000001) ; ADC AWD2CH bit 0
ADC_AWD2CR_AWD2CH_1  EQU (0x00000002) ; ADC AWD2CH bit 1
ADC_AWD2CR_AWD2CH_2  EQU (0x00000004) ; ADC AWD2CH bit 2
ADC_AWD2CR_AWD2CH_3  EQU (0x00000008) ; ADC AWD2CH bit 3
ADC_AWD2CR_AWD2CH_4  EQU (0x00000010) ; ADC AWD2CH bit 4
ADC_AWD2CR_AWD2CH_5  EQU (0x00000020) ; ADC AWD2CH bit 5
ADC_AWD2CR_AWD2CH_6  EQU (0x00000040) ; ADC AWD2CH bit 6
ADC_AWD2CR_AWD2CH_7  EQU (0x00000080) ; ADC AWD2CH bit 7
ADC_AWD2CR_AWD2CH_8  EQU (0x00000100) ; ADC AWD2CH bit 8
ADC_AWD2CR_AWD2CH_9  EQU (0x00000200) ; ADC AWD2CH bit 9
ADC_AWD2CR_AWD2CH_10 EQU (0x00000400) ; ADC AWD2CH bit 10
ADC_AWD2CR_AWD2CH_11 EQU (0x00000800) ; ADC AWD2CH bit 11
ADC_AWD2CR_AWD2CH_12 EQU (0x00001000) ; ADC AWD2CH bit 12
ADC_AWD2CR_AWD2CH_13 EQU (0x00002000) ; ADC AWD2CH bit 13
ADC_AWD2CR_AWD2CH_14 EQU (0x00004000) ; ADC AWD2CH bit 14
ADC_AWD2CR_AWD2CH_15 EQU (0x00008000) ; ADC AWD2CH bit 15
ADC_AWD2CR_AWD2CH_16 EQU (0x00010000) ; ADC AWD2CH bit 16
ADC_AWD2CR_AWD2CH_17 EQU (0x00020000) ; ADC AWD2CH bit 17
ADC_AWD2CR_AWD2CH_18 EQU (0x00040000) ; ADC AWD2CH bit 18

; ********************  Bit definition for ADC_AWD3CR register  *******************
ADC_AWD3CR_AWD3CH    EQU (0x0007FFFF) ; ADC Analog watchdog 3 channel selection
ADC_AWD3CR_AWD3CH_0  EQU (0x00000001) ; ADC AWD3CH bit 0
ADC_AWD3CR_AWD3CH_1  EQU (0x00000002) ; ADC AWD3CH bit 1
ADC_AWD3CR_AWD3CH_2  EQU (0x00000004) ; ADC AWD3CH bit 2
ADC_AWD3CR_AWD3CH_3  EQU (0x00000008) ; ADC AWD3CH bit 3
ADC_AWD3CR_AWD3CH_4  EQU (0x00000010) ; ADC AWD3CH bit 4
ADC_AWD3CR_AWD3CH_5  EQU (0x00000020) ; ADC AWD3CH bit 5
ADC_AWD3CR_AWD3CH_6  EQU (0x00000040) ; ADC AWD3CH bit 6
ADC_AWD3CR_AWD3CH_7  EQU (0x00000080) ; ADC AWD3CH bit 7
ADC_AWD3CR_AWD3CH_8  EQU (0x00000100) ; ADC AWD3CH bit 8
ADC_AWD3CR_AWD3CH_9  EQU (0x00000200) ; ADC AWD3CH bit 9
ADC_AWD3CR_AWD3CH_10 EQU (0x00000400) ; ADC AWD3CH bit 10
ADC_AWD3CR_AWD3CH_11 EQU (0x00000800) ; ADC AWD3CH bit 11
ADC_AWD3CR_AWD3CH_12 EQU (0x00001000) ; ADC AWD3CH bit 12
ADC_AWD3CR_AWD3CH_13 EQU (0x00002000) ; ADC AWD3CH bit 13
ADC_AWD3CR_AWD3CH_14 EQU (0x00004000) ; ADC AWD3CH bit 14
ADC_AWD3CR_AWD3CH_15 EQU (0x00008000) ; ADC AWD3CH bit 15
ADC_AWD3CR_AWD3CH_16 EQU (0x00010000) ; ADC AWD3CH bit 16
ADC_AWD3CR_AWD3CH_17 EQU (0x00020000) ; ADC AWD3CH bit 17
ADC_AWD3CR_AWD3CH_18 EQU (0x00040000) ; ADC AWD3CH bit 18

; ********************  Bit definition for ADC_DIFSEL register  *******************
ADC_DIFSEL_DIFSEL    EQU (0x0007FFFF) ; ADC differential modes for channels 1 to 18
ADC_DIFSEL_DIFSEL_0  EQU (0x00000001) ; ADC DIFSEL bit 0
ADC_DIFSEL_DIFSEL_1  EQU (0x00000002) ; ADC DIFSEL bit 1
ADC_DIFSEL_DIFSEL_2  EQU (0x00000004) ; ADC DIFSEL bit 2
ADC_DIFSEL_DIFSEL_3  EQU (0x00000008) ; ADC DIFSEL bit 3
ADC_DIFSEL_DIFSEL_4  EQU (0x00000010) ; ADC DIFSEL bit 4
ADC_DIFSEL_DIFSEL_5  EQU (0x00000020) ; ADC DIFSEL bit 5
ADC_DIFSEL_DIFSEL_6  EQU (0x00000040) ; ADC DIFSEL bit 6
ADC_DIFSEL_DIFSEL_7  EQU (0x00000080) ; ADC DIFSEL bit 7
ADC_DIFSEL_DIFSEL_8  EQU (0x00000100) ; ADC DIFSEL bit 8
ADC_DIFSEL_DIFSEL_9  EQU (0x00000200) ; ADC DIFSEL bit 9
ADC_DIFSEL_DIFSEL_10 EQU (0x00000400) ; ADC DIFSEL bit 10
ADC_DIFSEL_DIFSEL_11 EQU (0x00000800) ; ADC DIFSEL bit 11
ADC_DIFSEL_DIFSEL_12 EQU (0x00001000) ; ADC DIFSEL bit 12
ADC_DIFSEL_DIFSEL_13 EQU (0x00002000) ; ADC DIFSEL bit 13
ADC_DIFSEL_DIFSEL_14 EQU (0x00004000) ; ADC DIFSEL bit 14
ADC_DIFSEL_DIFSEL_15 EQU (0x00008000) ; ADC DIFSEL bit 15
ADC_DIFSEL_DIFSEL_16 EQU (0x00010000) ; ADC DIFSEL bit 16
ADC_DIFSEL_DIFSEL_17 EQU (0x00020000) ; ADC DIFSEL bit 17
ADC_DIFSEL_DIFSEL_18 EQU (0x00040000) ; ADC DIFSEL bit 18

; ********************  Bit definition for ADC_CALFACT register  *******************
ADC_CALFACT_CALFACT_S    EQU (0x0000007F) ; ADC calibration factors in single-ended mode
ADC_CALFACT_CALFACT_S_0  EQU (0x00000001) ; ADC CALFACT_S bit 0
ADC_CALFACT_CALFACT_S_1  EQU (0x00000002) ; ADC CALFACT_S bit 1
ADC_CALFACT_CALFACT_S_2  EQU (0x00000004) ; ADC CALFACT_S bit 2
ADC_CALFACT_CALFACT_S_3  EQU (0x00000008) ; ADC CALFACT_S bit 3
ADC_CALFACT_CALFACT_S_4  EQU (0x00000010) ; ADC CALFACT_S bit 4
ADC_CALFACT_CALFACT_S_5  EQU (0x00000020) ; ADC CALFACT_S bit 5
ADC_CALFACT_CALFACT_S_6  EQU (0x00000040) ; ADC CALFACT_S bit 6

ADC_CALFACT_CALFACT_D    EQU (0x007F0000) ; ADC calibration factors in differential mode
ADC_CALFACT_CALFACT_D_0  EQU (0x00010000) ; ADC CALFACT_D bit 0
ADC_CALFACT_CALFACT_D_1  EQU (0x00020000) ; ADC CALFACT_D bit 1
ADC_CALFACT_CALFACT_D_2  EQU (0x00040000) ; ADC CALFACT_D bit 2
ADC_CALFACT_CALFACT_D_3  EQU (0x00080000) ; ADC CALFACT_D bit 3
ADC_CALFACT_CALFACT_D_4  EQU (0x00100000) ; ADC CALFACT_D bit 4
ADC_CALFACT_CALFACT_D_5  EQU (0x00200000) ; ADC CALFACT_D bit 5
ADC_CALFACT_CALFACT_D_6  EQU (0x00400000) ; ADC CALFACT_D bit 6

; *************************  ADC Common registers  ****************************
; ********************  Bit definition for ADC_CSR register  *******************
ADC_CSR_ADRDY_MST EQU (0x00000001) ; Master ADC ready
ADC_CSR_EOSMP_MST EQU (0x00000002) ; End of sampling phase flag of the master ADC
ADC_CSR_EOC_MST   EQU (0x00000004) ; End of regular conversion of the master ADC
ADC_CSR_EOS_MST   EQU (0x00000008) ; End of regular sequence flag of the master ADC
ADC_CSR_OVR_MST   EQU (0x00000010) ; Overrun flag of the master ADC
ADC_CSR_JEOC_MST  EQU (0x00000020) ; End of injected conversion of the master ADC
ADC_CSR_JEOS_MST  EQU (0x00000040) ; End of injected sequence flag of the master ADC
ADC_CSR_AWD1_MST  EQU (0x00000080) ; Analog watchdog 1 flag of the master ADC
ADC_CSR_AWD2_MST  EQU (0x00000100) ; Analog watchdog 2 flag of the master ADC
ADC_CSR_AWD3_MST  EQU (0x00000200) ; Analog watchdog 3 flag of the master ADC
ADC_CSR_JQOVF_MST EQU (0x00000400) ; Injected context queue overflow flag of the master ADC

ADC_CSR_ADRDY_SLV EQU (0x00010000) ; Slave ADC ready
ADC_CSR_EOSMP_SLV EQU (0x00020000) ; End of sampling phase flag of the slave ADC
ADC_CSR_EOC_SLV   EQU (0x00040000) ; End of regular conversion of the slave ADC
ADC_CSR_EOS_SLV   EQU (0x00080000) ; End of regular sequence flag of the slave ADC
ADC_CSR_OVR_SLV   EQU (0x00100000) ; Overrun flag of the slave ADC
ADC_CSR_JEOC_SLV  EQU (0x00200000) ; End of injected conversion of the slave ADC
ADC_CSR_JEOS_SLV  EQU (0x00400000) ; End of injected sequence flag of the slave ADC
ADC_CSR_AWD1_SLV  EQU (0x00800000) ; Analog watchdog 1 flag of the slave ADC
ADC_CSR_AWD2_SLV  EQU (0x01000000) ; Analog watchdog 2 flag of the slave ADC
ADC_CSR_AWD3_SLV  EQU (0x02000000) ; Analog watchdog 3 flag of the slave ADC
ADC_CSR_JQOVF_SLV EQU (0x04000000) ; Injected context queue overflow flag of the slave ADC

; ********************  Bit definition for ADC_CCR register  *******************
ADC_CCR_DUAL      EQU (0x0000001F) ; Dual ADC mode selection
ADC_CCR_DUAL_0    EQU (0x00000001) ; Dual bit 0
ADC_CCR_DUAL_1    EQU (0x00000002) ; Dual bit 1
ADC_CCR_DUAL_2    EQU (0x00000004) ; Dual bit 2
ADC_CCR_DUAL_3    EQU (0x00000008) ; Dual bit 3
ADC_CCR_DUAL_4    EQU (0x00000010) ; Dual bit 4

