Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
ADC_CCR_DELAY     EQU (0x00000F00) ; Delay between 2 sampling phases
ADC_CCR_DELAY_0   EQU (0x00000100) ; DELAY bit 0
ADC_CCR_DELAY_1   EQU (0x00000200) ; DELAY bit 1
ADC_CCR_DELAY_2   EQU (0x00000400) ; DELAY bit 2
ADC_CCR_DELAY_3   EQU (0x00000800) ; DELAY bit 3

ADC_CCR_DMACFG    EQU (0x00002000) ; DMA configuration for multi-ADC mode

ADC_CCR_MDMA      EQU (0x0000C000) ; DMA mode for multi-ADC mode
ADC_CCR_MDMA_0    EQU (0x00004000) ; MDMA bit 0
ADC_CCR_MDMA_1    EQU (0x00008000) ; MDMA bit 1

ADC_CCR_CKMODE    EQU (0x00030000) ; ADC clock mode
ADC_CCR_CKMODE_0  EQU (0x00010000) ; CKMODE bit 0
ADC_CCR_CKMODE_1  EQU (0x00020000) ; CKMODE bit 1

ADC_CCR_PRESC     EQU (0x003C0000) ; ADC prescaler
ADC_CCR_PRESC_0   EQU (0x00040000) ; ADC prescaler bit 0
ADC_CCR_PRESC_1   EQU (0x00080000) ; ADC prescaler bit 1
ADC_CCR_PRESC_2   EQU (0x00100000) ; ADC prescaler bit 2
ADC_CCR_PRESC_3   EQU (0x00200000) ; ADC prescaler bit 3

ADC_CCR_VREFEN    EQU (0x00400000) ; VREFINT enable
ADC_CCR_TSEN      EQU (0x00800000) ; Temperature sensor enable
ADC_CCR_VBATEN    EQU (0x01000000) ; VBAT enable

; ********************  Bit definition for ADC_CDR register  *******************
ADC_CDR_RDATA_MST EQU (0x0000FFFF) ; Regular Data of the master ADC
ADC_CDR_RDATA_MST_0       EQU (0x00000001) ; RDATA_MST bit 0
ADC_CDR_RDATA_MST_1       EQU (0x00000002) ; RDATA_MST bit 1
ADC_CDR_RDATA_MST_2       EQU (0x00000004) ; RDATA_MST bit 2
ADC_CDR_RDATA_MST_3       EQU (0x00000008) ; RDATA_MST bit 3
ADC_CDR_RDATA_MST_4       EQU (0x00000010) ; RDATA_MST bit 4
ADC_CDR_RDATA_MST_5       EQU (0x00000020) ; RDATA_MST bit 5
ADC_CDR_RDATA_MST_6       EQU (0x00000040) ; RDATA_MST bit 6
ADC_CDR_RDATA_MST_7       EQU (0x00000080) ; RDATA_MST bit 7
ADC_CDR_RDATA_MST_8       EQU (0x00000100) ; RDATA_MST bit 8
ADC_CDR_RDATA_MST_9       EQU (0x00000200) ; RDATA_MST bit 9
ADC_CDR_RDATA_MST_10      EQU (0x00000400) ; RDATA_MST bit 10
ADC_CDR_RDATA_MST_11      EQU (0x00000800) ; RDATA_MST bit 11
ADC_CDR_RDATA_MST_12      EQU (0x00001000) ; RDATA_MST bit 12
ADC_CDR_RDATA_MST_13      EQU (0x00002000) ; RDATA_MST bit 13
ADC_CDR_RDATA_MST_14      EQU (0x00004000) ; RDATA_MST bit 14
ADC_CDR_RDATA_MST_15      EQU (0x00008000) ; RDATA_MST bit 15

ADC_CDR_RDATA_SLV EQU (0xFFFF0000) ; Regular Data of the master ADC
ADC_CDR_RDATA_SLV_0       EQU (0x00010000) ; RDATA_SLV bit 0
ADC_CDR_RDATA_SLV_1       EQU (0x00020000) ; RDATA_SLV bit 1
ADC_CDR_RDATA_SLV_2       EQU (0x00040000) ; RDATA_SLV bit 2
ADC_CDR_RDATA_SLV_3       EQU (0x00080000) ; RDATA_SLV bit 3
ADC_CDR_RDATA_SLV_4       EQU (0x00100000) ; RDATA_SLV bit 4
ADC_CDR_RDATA_SLV_5       EQU (0x00200000) ; RDATA_SLV bit 5
ADC_CDR_RDATA_SLV_6       EQU (0x00400000) ; RDATA_SLV bit 6
ADC_CDR_RDATA_SLV_7       EQU (0x00800000) ; RDATA_SLV bit 7
ADC_CDR_RDATA_SLV_8       EQU (0x01000000) ; RDATA_SLV bit 8
ADC_CDR_RDATA_SLV_9       EQU (0x02000000) ; RDATA_SLV bit 9
ADC_CDR_RDATA_SLV_10      EQU (0x04000000) ; RDATA_SLV bit 10
ADC_CDR_RDATA_SLV_11      EQU (0x08000000) ; RDATA_SLV bit 11
ADC_CDR_RDATA_SLV_12      EQU (0x10000000) ; RDATA_SLV bit 12
ADC_CDR_RDATA_SLV_13      EQU (0x20000000) ; RDATA_SLV bit 13
ADC_CDR_RDATA_SLV_14      EQU (0x40000000) ; RDATA_SLV bit 14
ADC_CDR_RDATA_SLV_15      EQU (0x80000000) ; RDATA_SLV bit 15

; *****************************************************************************
;
;                         Controller Area Network
;
; *****************************************************************************
;CAN control and status registers
; *******************  Bit definition for CAN_MCR register  *******************
CAN_MCR_INRQ                EQU (0x0001)            ;Initialization Request
CAN_MCR_SLEEP               EQU (0x0002)            ;Sleep Mode Request
CAN_MCR_TXFP                EQU (0x0004)            ;Transmit FIFO Priority
CAN_MCR_RFLM                EQU (0x0008)            ;Receive FIFO Locked Mode
CAN_MCR_NART                EQU (0x0010)            ;No Automatic Retransmission
CAN_MCR_AWUM                EQU (0x0020)            ;Automatic Wakeup Mode
CAN_MCR_ABOM                EQU (0x0040)            ;Automatic Bus-Off Management
CAN_MCR_TTCM                EQU (0x0080)            ;Time Triggered Communication Mode
CAN_MCR_RESET               EQU (0x8000)            ;bxCAN software master reset

; *******************  Bit definition for CAN_MSR register  *******************
CAN_MSR_INAK                EQU (0x0001)            ;Initialization Acknowledge
CAN_MSR_SLAK                EQU (0x0002)            ;Sleep Acknowledge
CAN_MSR_ERRI                EQU (0x0004)            ;Error Interrupt
CAN_MSR_WKUI                EQU (0x0008)            ;Wakeup Interrupt
CAN_MSR_SLAKI               EQU (0x0010)            ;Sleep Acknowledge Interrupt
CAN_MSR_TXM                 EQU (0x0100)            ;Transmit Mode
CAN_MSR_RXM                 EQU (0x0200)            ;Receive Mode
CAN_MSR_SAMP                EQU (0x0400)            ;Last Sample Point
CAN_MSR_RX                  EQU (0x0800)            ;CAN Rx Signal

; *******************  Bit definition for CAN_TSR register  *******************
CAN_TSR_RQCP0               EQU (0x00000001)        ;Request Completed Mailbox0
CAN_TSR_TXOK0               EQU (0x00000002)        ;Transmission OK of Mailbox0
CAN_TSR_ALST0               EQU (0x00000004)        ;Arbitration Lost for Mailbox0
CAN_TSR_TERR0               EQU (0x00000008)        ;Transmission Error of Mailbox0
CAN_TSR_ABRQ0               EQU (0x00000080)        ;Abort Request for Mailbox0
CAN_TSR_RQCP1               EQU (0x00000100)        ;Request Completed Mailbox1
CAN_TSR_TXOK1               EQU (0x00000200)        ;Transmission OK of Mailbox1
CAN_TSR_ALST1               EQU (0x00000400)        ;Arbitration Lost for Mailbox1
CAN_TSR_TERR1               EQU (0x00000800)        ;Transmission Error of Mailbox1
CAN_TSR_ABRQ1               EQU (0x00008000)        ;Abort Request for Mailbox 1
CAN_TSR_RQCP2               EQU (0x00010000)        ;Request Completed Mailbox2
CAN_TSR_TXOK2               EQU (0x00020000)        ;Transmission OK of Mailbox 2
CAN_TSR_ALST2               EQU (0x00040000)        ;Arbitration Lost for mailbox 2
CAN_TSR_TERR2               EQU (0x00080000)        ;Transmission Error of Mailbox 2
CAN_TSR_ABRQ2               EQU (0x00800000)        ;Abort Request for Mailbox 2
CAN_TSR_CODE                EQU (0x03000000)        ;Mailbox Code

