Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
CAN_TSR_TME                 EQU (0x1C000000)        ;TME[2:0] bits
CAN_TSR_TME0                EQU (0x04000000)        ;Transmit Mailbox 0 Empty
CAN_TSR_TME1                EQU (0x08000000)        ;Transmit Mailbox 1 Empty
CAN_TSR_TME2                EQU (0x10000000)        ;Transmit Mailbox 2 Empty

CAN_TSR_LOW                 EQU (0xE0000000)        ;LOW[2:0] bits
CAN_TSR_LOW0                EQU (0x20000000)        ;Lowest Priority Flag for Mailbox 0
CAN_TSR_LOW1                EQU (0x40000000)        ;Lowest Priority Flag for Mailbox 1
CAN_TSR_LOW2                EQU (0x80000000)        ;Lowest Priority Flag for Mailbox 2

; *******************  Bit definition for CAN_RF0R register  ******************
CAN_RF0R_FMP0               EQU (0x03)               ;FIFO 0 Message Pending
CAN_RF0R_FULL0              EQU (0x08)               ;FIFO 0 Full
CAN_RF0R_FOVR0              EQU (0x10)               ;FIFO 0 Overrun
CAN_RF0R_RFOM0              EQU (0x20)               ;Release FIFO 0 Output Mailbox

; *******************  Bit definition for CAN_RF1R register  ******************
CAN_RF1R_FMP1               EQU (0x03)               ;FIFO 1 Message Pending
CAN_RF1R_FULL1              EQU (0x08)               ;FIFO 1 Full
CAN_RF1R_FOVR1              EQU (0x10)               ;FIFO 1 Overrun
CAN_RF1R_RFOM1              EQU (0x20)               ;Release FIFO 1 Output Mailbox

; ********************  Bit definition for CAN_IER register  ******************
CAN_IER_TMEIE               EQU (0x00000001)        ;Transmit Mailbox Empty Interrupt Enable
CAN_IER_FMPIE0              EQU (0x00000002)        ;FIFO Message Pending Interrupt Enable
CAN_IER_FFIE0               EQU (0x00000004)        ;FIFO Full Interrupt Enable
CAN_IER_FOVIE0              EQU (0x00000008)        ;FIFO Overrun Interrupt Enable
CAN_IER_FMPIE1              EQU (0x00000010)        ;FIFO Message Pending Interrupt Enable
CAN_IER_FFIE1               EQU (0x00000020)        ;FIFO Full Interrupt Enable
CAN_IER_FOVIE1              EQU (0x00000040)        ;FIFO Overrun Interrupt Enable
CAN_IER_EWGIE               EQU (0x00000100)        ;Error Warning Interrupt Enable
CAN_IER_EPVIE               EQU (0x00000200)        ;Error Passive Interrupt Enable
CAN_IER_BOFIE               EQU (0x00000400)        ;Bus-Off Interrupt Enable
CAN_IER_LECIE               EQU (0x00000800)        ;Last Error Code Interrupt Enable
CAN_IER_ERRIE               EQU (0x00008000)        ;Error Interrupt Enable
CAN_IER_WKUIE               EQU (0x00010000)        ;Wakeup Interrupt Enable
CAN_IER_SLKIE               EQU (0x00020000)        ;Sleep Interrupt Enable

; ********************  Bit definition for CAN_ESR register  ******************
CAN_ESR_EWGF                EQU (0x00000001)        ;Error Warning Flag
CAN_ESR_EPVF                EQU (0x00000002)        ;Error Passive Flag
CAN_ESR_BOFF                EQU (0x00000004)        ;Bus-Off Flag

CAN_ESR_LEC                 EQU (0x00000070)        ;LEC[2:0] bits (Last Error Code)
CAN_ESR_LEC_0               EQU (0x00000010)        ;Bit 0
CAN_ESR_LEC_1               EQU (0x00000020)        ;Bit 1
CAN_ESR_LEC_2               EQU (0x00000040)        ;Bit 2

CAN_ESR_TEC                 EQU (0x00FF0000)        ;Least significant byte of the 9-bit Transmit Error Counter
CAN_ESR_REC                 EQU (0xFF000000)        ;Receive Error Counter

; *******************  Bit definition for CAN_BTR register  *******************
CAN_BTR_BRP                 EQU (0x000003FF)        ;Baud Rate Prescaler
CAN_BTR_TS1_0               EQU (0x00010000)        ;Time Segment 1 (Bit 0)
CAN_BTR_TS1_1               EQU (0x00020000)        ;Time Segment 1 (Bit 1)
CAN_BTR_TS1_2               EQU (0x00040000)        ;Time Segment 1 (Bit 2)
CAN_BTR_TS1_3               EQU (0x00080000)        ;Time Segment 1 (Bit 3)
CAN_BTR_TS1                 EQU (0x000F0000)        ;Time Segment 1
CAN_BTR_TS2_0               EQU (0x00100000)        ;Time Segment 2 (Bit 0)
CAN_BTR_TS2_1               EQU (0x00200000)        ;Time Segment 2 (Bit 1)
CAN_BTR_TS2_2               EQU (0x00400000)        ;Time Segment 2 (Bit 2)
CAN_BTR_TS2                 EQU (0x00700000)        ;Time Segment 2
CAN_BTR_SJW_0               EQU (0x01000000)        ;Resynchronization Jump Width (Bit 0)
CAN_BTR_SJW_1               EQU (0x02000000)        ;Resynchronization Jump Width (Bit 1)
CAN_BTR_SJW                 EQU (0x03000000)        ;Resynchronization Jump Width
CAN_BTR_LBKM                EQU (0x40000000)        ;Loop Back Mode (Debug)
CAN_BTR_SILM                EQU (0x80000000)        ;Silent Mode

;Mailbox registers
; ******************  Bit definition for CAN_TI0R register  *******************
CAN_TI0R_TXRQ               EQU (0x00000001)        ;Transmit Mailbox Request
CAN_TI0R_RTR                EQU (0x00000002)        ;Remote Transmission Request
CAN_TI0R_IDE                EQU (0x00000004)        ;Identifier Extension
CAN_TI0R_EXID               EQU (0x001FFFF8)        ;Extended Identifier
CAN_TI0R_STID               EQU (0xFFE00000)        ;Standard Identifier or Extended Identifier

; ******************  Bit definition for CAN_TDT0R register  ******************
CAN_TDT0R_DLC               EQU (0x0000000F)        ;Data Length Code
CAN_TDT0R_TGT               EQU (0x00000100)        ;Transmit Global Time
CAN_TDT0R_TIME              EQU (0xFFFF0000)        ;Message Time Stamp

; ******************  Bit definition for CAN_TDL0R register  ******************
CAN_TDL0R_DATA0             EQU (0x000000FF)        ;Data byte 0
CAN_TDL0R_DATA1             EQU (0x0000FF00)        ;Data byte 1
CAN_TDL0R_DATA2             EQU (0x00FF0000)        ;Data byte 2
CAN_TDL0R_DATA3             EQU (0xFF000000)        ;Data byte 3

; ******************  Bit definition for CAN_TDH0R register  ******************
CAN_TDH0R_DATA4             EQU (0x000000FF)        ;Data byte 4
CAN_TDH0R_DATA5             EQU (0x0000FF00)        ;Data byte 5
CAN_TDH0R_DATA6             EQU (0x00FF0000)        ;Data byte 6
CAN_TDH0R_DATA7             EQU (0xFF000000)        ;Data byte 7

; *******************  Bit definition for CAN_TI1R register  ******************
CAN_TI1R_TXRQ               EQU (0x00000001)        ;Transmit Mailbox Request
CAN_TI1R_RTR                EQU (0x00000002)        ;Remote Transmission Request
CAN_TI1R_IDE                EQU (0x00000004)        ;Identifier Extension
CAN_TI1R_EXID               EQU (0x001FFFF8)        ;Extended Identifier
CAN_TI1R_STID               EQU (0xFFE00000)        ;Standard Identifier or Extended Identifier

; *******************  Bit definition for CAN_TDT1R register  *****************
CAN_TDT1R_DLC               EQU (0x0000000F)        ;Data Length Code
CAN_TDT1R_TGT               EQU (0x00000100)        ;Transmit Global Time
CAN_TDT1R_TIME              EQU (0xFFFF0000)        ;Message Time Stamp

; *******************  Bit definition for CAN_TDL1R register  *****************
CAN_TDL1R_DATA0             EQU (0x000000FF)        ;Data byte 0
CAN_TDL1R_DATA1             EQU (0x0000FF00)        ;Data byte 1
CAN_TDL1R_DATA2             EQU (0x00FF0000)        ;Data byte 2
CAN_TDL1R_DATA3             EQU (0xFF000000)        ;Data byte 3

; *******************  Bit definition for CAN_TDH1R register  *****************
CAN_TDH1R_DATA4             EQU (0x000000FF)        ;Data byte 4
CAN_TDH1R_DATA5             EQU (0x0000FF00)        ;Data byte 5
CAN_TDH1R_DATA6             EQU (0x00FF0000)        ;Data byte 6
CAN_TDH1R_DATA7             EQU (0xFF000000)        ;Data byte 7

; *******************  Bit definition for CAN_TI2R register  ******************
CAN_TI2R_TXRQ               EQU (0x00000001)        ;Transmit Mailbox Request
CAN_TI2R_RTR                EQU (0x00000002)        ;Remote Transmission Request
CAN_TI2R_IDE                EQU (0x00000004)        ;Identifier Extension
CAN_TI2R_EXID               EQU (0x001FFFF8)        ;Extended identifier
CAN_TI2R_STID               EQU (0xFFE00000)        ;Standard Identifier or Extended Identifier

; *******************  Bit definition for CAN_TDT2R register  *****************
CAN_TDT2R_DLC               EQU (0x0000000F)        ;Data Length Code
CAN_TDT2R_TGT               EQU (0x00000100)        ;Transmit Global Time
CAN_TDT2R_TIME              EQU (0xFFFF0000)        ;Message Time Stamp

; *******************  Bit definition for CAN_TDL2R register  *****************
CAN_TDL2R_DATA0             EQU (0x000000FF)        ;Data byte 0
CAN_TDL2R_DATA1             EQU (0x0000FF00)        ;Data byte 1
CAN_TDL2R_DATA2             EQU (0x00FF0000)        ;Data byte 2
CAN_TDL2R_DATA3             EQU (0xFF000000)        ;Data byte 3

; *******************  Bit definition for CAN_TDH2R register  *****************
CAN_TDH2R_DATA4             EQU (0x000000FF)        ;Data byte 4
CAN_TDH2R_DATA5             EQU (0x0000FF00)        ;Data byte 5
CAN_TDH2R_DATA6             EQU (0x00FF0000)        ;Data byte 6
CAN_TDH2R_DATA7             EQU (0xFF000000)        ;Data byte 7

; *******************  Bit definition for CAN_RI0R register  ******************
CAN_RI0R_RTR                EQU (0x00000002)        ;Remote Transmission Request
CAN_RI0R_IDE                EQU (0x00000004)        ;Identifier Extension
CAN_RI0R_EXID               EQU (0x001FFFF8)        ;Extended Identifier
CAN_RI0R_STID               EQU (0xFFE00000)        ;Standard Identifier or Extended Identifier

; *******************  Bit definition for CAN_RDT0R register  *****************
CAN_RDT0R_DLC               EQU (0x0000000F)        ;Data Length Code
CAN_RDT0R_FMI               EQU (0x0000FF00)        ;Filter Match Index
CAN_RDT0R_TIME              EQU (0xFFFF0000)        ;Message Time Stamp

; *******************  Bit definition for CAN_RDL0R register  *****************
CAN_RDL0R_DATA0             EQU (0x000000FF)        ;Data byte 0
CAN_RDL0R_DATA1             EQU (0x0000FF00)        ;Data byte 1
CAN_RDL0R_DATA2             EQU (0x00FF0000)        ;Data byte 2
CAN_RDL0R_DATA3             EQU (0xFF000000)        ;Data byte 3

; *******************  Bit definition for CAN_RDH0R register  *****************
CAN_RDH0R_DATA4             EQU (0x000000FF)        ;Data byte 4
CAN_RDH0R_DATA5             EQU (0x0000FF00)        ;Data byte 5
CAN_RDH0R_DATA6             EQU (0x00FF0000)        ;Data byte 6
CAN_RDH0R_DATA7             EQU (0xFF000000)        ;Data byte 7

; *******************  Bit definition for CAN_RI1R register  ******************
CAN_RI1R_RTR                EQU (0x00000002)        ;Remote Transmission Request
CAN_RI1R_IDE                EQU (0x00000004)        ;Identifier Extension
CAN_RI1R_EXID               EQU (0x001FFFF8)        ;Extended identifier
CAN_RI1R_STID               EQU (0xFFE00000)        ;Standard Identifier or Extended Identifier

; *******************  Bit definition for CAN_RDT1R register  *****************
CAN_RDT1R_DLC               EQU (0x0000000F)        ;Data Length Code
CAN_RDT1R_FMI               EQU (0x0000FF00)        ;Filter Match Index
CAN_RDT1R_TIME              EQU (0xFFFF0000)        ;Message Time Stamp

; *******************  Bit definition for CAN_RDL1R register  *****************
CAN_RDL1R_DATA0             EQU (0x000000FF)        ;Data byte 0
CAN_RDL1R_DATA1             EQU (0x0000FF00)        ;Data byte 1
CAN_RDL1R_DATA2             EQU (0x00FF0000)        ;Data byte 2
CAN_RDL1R_DATA3             EQU (0xFF000000)        ;Data byte 3

; *******************  Bit definition for CAN_RDH1R register  *****************
CAN_RDH1R_DATA4             EQU (0x000000FF)        ;Data byte 4
CAN_RDH1R_DATA5             EQU (0x0000FF00)        ;Data byte 5
CAN_RDH1R_DATA6             EQU (0x00FF0000)        ;Data byte 6
CAN_RDH1R_DATA7             EQU (0xFF000000)        ;Data byte 7

;CAN filter registers
; *******************  Bit definition for CAN_FMR register  *******************
CAN_FMR_FINIT               EQU (0x01)               ;Filter Init Mode

; *******************  Bit definition for CAN_FM1R register  ******************
CAN_FM1R_FBM                EQU (0x3FFF)            ;Filter Mode
CAN_FM1R_FBM0               EQU (0x0001)            ;Filter Init Mode bit 0
CAN_FM1R_FBM1               EQU (0x0002)            ;Filter Init Mode bit 1
CAN_FM1R_FBM2               EQU (0x0004)            ;Filter Init Mode bit 2
CAN_FM1R_FBM3               EQU (0x0008)            ;Filter Init Mode bit 3
CAN_FM1R_FBM4               EQU (0x0010)            ;Filter Init Mode bit 4
CAN_FM1R_FBM5               EQU (0x0020)            ;Filter Init Mode bit 5
CAN_FM1R_FBM6               EQU (0x0040)            ;Filter Init Mode bit 6
CAN_FM1R_FBM7               EQU (0x0080)            ;Filter Init Mode bit 7
CAN_FM1R_FBM8               EQU (0x0100)            ;Filter Init Mode bit 8
CAN_FM1R_FBM9               EQU (0x0200)            ;Filter Init Mode bit 9
CAN_FM1R_FBM10              EQU (0x0400)            ;Filter Init Mode bit 10
CAN_FM1R_FBM11              EQU (0x0800)            ;Filter Init Mode bit 11
CAN_FM1R_FBM12              EQU (0x1000)            ;Filter Init Mode bit 12
CAN_FM1R_FBM13              EQU (0x2000)            ;Filter Init Mode bit 13

; *******************  Bit definition for CAN_FS1R register  ******************
CAN_FS1R_FSC                EQU (0x3FFF)            ;Filter Scale Configuration
CAN_FS1R_FSC0               EQU (0x0001)            ;Filter Scale Configuration bit 0
CAN_FS1R_FSC1               EQU (0x0002)            ;Filter Scale Configuration bit 1
CAN_FS1R_FSC2               EQU (0x0004)            ;Filter Scale Configuration bit 2
CAN_FS1R_FSC3               EQU (0x0008)            ;Filter Scale Configuration bit 3
CAN_FS1R_FSC4               EQU (0x0010)            ;Filter Scale Configuration bit 4
CAN_FS1R_FSC5               EQU (0x0020)            ;Filter Scale Configuration bit 5
CAN_FS1R_FSC6               EQU (0x0040)            ;Filter Scale Configuration bit 6
CAN_FS1R_FSC7               EQU (0x0080)            ;Filter Scale Configuration bit 7
CAN_FS1R_FSC8               EQU (0x0100)            ;Filter Scale Configuration bit 8
CAN_FS1R_FSC9               EQU (0x0200)            ;Filter Scale Configuration bit 9
CAN_FS1R_FSC10              EQU (0x0400)            ;Filter Scale Configuration bit 10
CAN_FS1R_FSC11              EQU (0x0800)            ;Filter Scale Configuration bit 11
CAN_FS1R_FSC12              EQU (0x1000)            ;Filter Scale Configuration bit 12
CAN_FS1R_FSC13              EQU (0x2000)            ;Filter Scale Configuration bit 13

; ******************  Bit definition for CAN_FFA1R register  ******************
CAN_FFA1R_FFA               EQU (0x3FFF)            ;Filter FIFO Assignment
CAN_FFA1R_FFA0              EQU (0x0001)            ;Filter FIFO Assignment for Filter 0
CAN_FFA1R_FFA1              EQU (0x0002)            ;Filter FIFO Assignment for Filter 1
CAN_FFA1R_FFA2              EQU (0x0004)            ;Filter FIFO Assignment for Filter 2
CAN_FFA1R_FFA3              EQU (0x0008)            ;Filter FIFO Assignment for Filter 3
CAN_FFA1R_FFA4              EQU (0x0010)            ;Filter FIFO Assignment for Filter 4
CAN_FFA1R_FFA5              EQU (0x0020)            ;Filter FIFO Assignment for Filter 5
CAN_FFA1R_FFA6              EQU (0x0040)            ;Filter FIFO Assignment for Filter 6
CAN_FFA1R_FFA7              EQU (0x0080)            ;Filter FIFO Assignment for Filter 7
CAN_FFA1R_FFA8              EQU (0x0100)            ;Filter FIFO Assignment for Filter 8
CAN_FFA1R_FFA9              EQU (0x0200)            ;Filter FIFO Assignment for Filter 9
CAN_FFA1R_FFA10             EQU (0x0400)            ;Filter FIFO Assignment for Filter 10
CAN_FFA1R_FFA11             EQU (0x0800)            ;Filter FIFO Assignment for Filter 11
CAN_FFA1R_FFA12             EQU (0x1000)            ;Filter FIFO Assignment for Filter 12
CAN_FFA1R_FFA13             EQU (0x2000)            ;Filter FIFO Assignment for Filter 13

; *******************  Bit definition for CAN_FA1R register  ******************
CAN_FA1R_FACT               EQU (0x3FFF)            ;Filter Active
CAN_FA1R_FACT0              EQU (0x0001)            ;Filter 0 Active
CAN_FA1R_FACT1              EQU (0x0002)            ;Filter 1 Active
CAN_FA1R_FACT2              EQU (0x0004)            ;Filter 2 Active
CAN_FA1R_FACT3              EQU (0x0008)            ;Filter 3 Active
CAN_FA1R_FACT4              EQU (0x0010)            ;Filter 4 Active
CAN_FA1R_FACT5              EQU (0x0020)            ;Filter 5 Active
CAN_FA1R_FACT6              EQU (0x0040)            ;Filter 6 Active
CAN_FA1R_FACT7              EQU (0x0080)            ;Filter 7 Active
CAN_FA1R_FACT8              EQU (0x0100)            ;Filter 8 Active
CAN_FA1R_FACT9              EQU (0x0200)            ;Filter 9 Active
CAN_FA1R_FACT10             EQU (0x0400)            ;Filter 10 Active
CAN_FA1R_FACT11             EQU (0x0800)            ;Filter 11 Active
CAN_FA1R_FACT12             EQU (0x1000)            ;Filter 12 Active
CAN_FA1R_FACT13             EQU (0x2000)            ;Filter 13 Active

; *******************  Bit definition for CAN_F0R1 register  ******************
CAN_F0R1_FB0                EQU (0x00000001)        ;Filter bit 0
CAN_F0R1_FB1                EQU (0x00000002)        ;Filter bit 1
CAN_F0R1_FB2                EQU (0x00000004)        ;Filter bit 2
CAN_F0R1_FB3                EQU (0x00000008)        ;Filter bit 3
CAN_F0R1_FB4                EQU (0x00000010)        ;Filter bit 4
CAN_F0R1_FB5                EQU (0x00000020)        ;Filter bit 5
CAN_F0R1_FB6                EQU (0x00000040)        ;Filter bit 6
CAN_F0R1_FB7                EQU (0x00000080)        ;Filter bit 7
CAN_F0R1_FB8                EQU (0x00000100)        ;Filter bit 8
CAN_F0R1_FB9                EQU (0x00000200)        ;Filter bit 9
CAN_F0R1_FB10               EQU (0x00000400)        ;Filter bit 10
CAN_F0R1_FB11               EQU (0x00000800)        ;Filter bit 11
CAN_F0R1_FB12               EQU (0x00001000)        ;Filter bit 12
CAN_F0R1_FB13               EQU (0x00002000)        ;Filter bit 13
CAN_F0R1_FB14               EQU (0x00004000)        ;Filter bit 14
CAN_F0R1_FB15               EQU (0x00008000)        ;Filter bit 15
CAN_F0R1_FB16               EQU (0x00010000)        ;Filter bit 16
CAN_F0R1_FB17               EQU (0x00020000)        ;Filter bit 17
CAN_F0R1_FB18               EQU (0x00040000)        ;Filter bit 18
CAN_F0R1_FB19               EQU (0x00080000)        ;Filter bit 19
CAN_F0R1_FB20               EQU (0x00100000)        ;Filter bit 20
CAN_F0R1_FB21               EQU (0x00200000)        ;Filter bit 21
CAN_F0R1_FB22               EQU (0x00400000)        ;Filter bit 22
CAN_F0R1_FB23               EQU (0x00800000)        ;Filter bit 23
CAN_F0R1_FB24               EQU (0x01000000)        ;Filter bit 24
CAN_F0R1_FB25               EQU (0x02000000)        ;Filter bit 25
CAN_F0R1_FB26               EQU (0x04000000)        ;Filter bit 26
CAN_F0R1_FB27               EQU (0x08000000)        ;Filter bit 27
CAN_F0R1_FB28               EQU (0x10000000)        ;Filter bit 28
CAN_F0R1_FB29               EQU (0x20000000)        ;Filter bit 29
CAN_F0R1_FB30               EQU (0x40000000)        ;Filter bit 30
CAN_F0R1_FB31               EQU (0x80000000)        ;Filter bit 31

; *******************  Bit definition for CAN_F1R1 register  ******************
CAN_F1R1_FB0                EQU (0x00000001)        ;Filter bit 0
CAN_F1R1_FB1                EQU (0x00000002)        ;Filter bit 1
CAN_F1R1_FB2                EQU (0x00000004)        ;Filter bit 2
CAN_F1R1_FB3                EQU (0x00000008)        ;Filter bit 3
CAN_F1R1_FB4                EQU (0x00000010)        ;Filter bit 4
CAN_F1R1_FB5                EQU (0x00000020)        ;Filter bit 5
CAN_F1R1_FB6                EQU (0x00000040)        ;Filter bit 6
CAN_F1R1_FB7                EQU (0x00000080)        ;Filter bit 7
CAN_F1R1_FB8                EQU (0x00000100)        ;Filter bit 8
CAN_F1R1_FB9                EQU (0x00000200)        ;Filter bit 9
CAN_F1R1_FB10               EQU (0x00000400)        ;Filter bit 10
CAN_F1R1_FB11               EQU (0x00000800)        ;Filter bit 11
CAN_F1R1_FB12               EQU (0x00001000)        ;Filter bit 12
CAN_F1R1_FB13               EQU (0x00002000)        ;Filter bit 13
CAN_F1R1_FB14               EQU (0x00004000)        ;Filter bit 14
CAN_F1R1_FB15               EQU (0x00008000)        ;Filter bit 15
CAN_F1R1_FB16               EQU (0x00010000)        ;Filter bit 16
CAN_F1R1_FB17               EQU (0x00020000)        ;Filter bit 17
CAN_F1R1_FB18               EQU (0x00040000)        ;Filter bit 18
CAN_F1R1_FB19               EQU (0x00080000)        ;Filter bit 19
CAN_F1R1_FB20               EQU (0x00100000)        ;Filter bit 20
CAN_F1R1_FB21               EQU (0x00200000)        ;Filter bit 21
CAN_F1R1_FB22               EQU (0x00400000)        ;Filter bit 22
CAN_F1R1_FB23               EQU (0x00800000)        ;Filter bit 23
CAN_F1R1_FB24               EQU (0x01000000)        ;Filter bit 24
CAN_F1R1_FB25               EQU (0x02000000)        ;Filter bit 25
CAN_F1R1_FB26               EQU (0x04000000)        ;Filter bit 26
CAN_F1R1_FB27               EQU (0x08000000)        ;Filter bit 27
CAN_F1R1_FB28               EQU (0x10000000)        ;Filter bit 28
CAN_F1R1_FB29               EQU (0x20000000)        ;Filter bit 29
CAN_F1R1_FB30               EQU (0x40000000)        ;Filter bit 30
CAN_F1R1_FB31               EQU (0x80000000)        ;Filter bit 31

