Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *******************  Bit definition for CAN_F12R1 register  *****************
CAN_F12R1_FB0               EQU (0x00000001)        ;Filter bit 0
CAN_F12R1_FB1               EQU (0x00000002)        ;Filter bit 1
CAN_F12R1_FB2               EQU (0x00000004)        ;Filter bit 2
CAN_F12R1_FB3               EQU (0x00000008)        ;Filter bit 3
CAN_F12R1_FB4               EQU (0x00000010)        ;Filter bit 4
CAN_F12R1_FB5               EQU (0x00000020)        ;Filter bit 5
CAN_F12R1_FB6               EQU (0x00000040)        ;Filter bit 6
CAN_F12R1_FB7               EQU (0x00000080)        ;Filter bit 7
CAN_F12R1_FB8               EQU (0x00000100)        ;Filter bit 8
CAN_F12R1_FB9               EQU (0x00000200)        ;Filter bit 9
CAN_F12R1_FB10              EQU (0x00000400)        ;Filter bit 10
CAN_F12R1_FB11              EQU (0x00000800)        ;Filter bit 11
CAN_F12R1_FB12              EQU (0x00001000)        ;Filter bit 12
CAN_F12R1_FB13              EQU (0x00002000)        ;Filter bit 13
CAN_F12R1_FB14              EQU (0x00004000)        ;Filter bit 14
CAN_F12R1_FB15              EQU (0x00008000)        ;Filter bit 15
CAN_F12R1_FB16              EQU (0x00010000)        ;Filter bit 16
CAN_F12R1_FB17              EQU (0x00020000)        ;Filter bit 17
CAN_F12R1_FB18              EQU (0x00040000)        ;Filter bit 18
CAN_F12R1_FB19              EQU (0x00080000)        ;Filter bit 19
CAN_F12R1_FB20              EQU (0x00100000)        ;Filter bit 20
CAN_F12R1_FB21              EQU (0x00200000)        ;Filter bit 21
CAN_F12R1_FB22              EQU (0x00400000)        ;Filter bit 22
CAN_F12R1_FB23              EQU (0x00800000)        ;Filter bit 23
CAN_F12R1_FB24              EQU (0x01000000)        ;Filter bit 24
CAN_F12R1_FB25              EQU (0x02000000)        ;Filter bit 25
CAN_F12R1_FB26              EQU (0x04000000)        ;Filter bit 26
CAN_F12R1_FB27              EQU (0x08000000)        ;Filter bit 27
CAN_F12R1_FB28              EQU (0x10000000)        ;Filter bit 28
CAN_F12R1_FB29              EQU (0x20000000)        ;Filter bit 29
CAN_F12R1_FB30              EQU (0x40000000)        ;Filter bit 30
CAN_F12R1_FB31              EQU (0x80000000)        ;Filter bit 31

; *******************  Bit definition for CAN_F13R1 register  *****************
CAN_F13R1_FB0               EQU (0x00000001)        ;Filter bit 0
CAN_F13R1_FB1               EQU (0x00000002)        ;Filter bit 1
CAN_F13R1_FB2               EQU (0x00000004)        ;Filter bit 2
CAN_F13R1_FB3               EQU (0x00000008)        ;Filter bit 3
CAN_F13R1_FB4               EQU (0x00000010)        ;Filter bit 4
CAN_F13R1_FB5               EQU (0x00000020)        ;Filter bit 5
CAN_F13R1_FB6               EQU (0x00000040)        ;Filter bit 6
CAN_F13R1_FB7               EQU (0x00000080)        ;Filter bit 7
CAN_F13R1_FB8               EQU (0x00000100)        ;Filter bit 8
CAN_F13R1_FB9               EQU (0x00000200)        ;Filter bit 9
CAN_F13R1_FB10              EQU (0x00000400)        ;Filter bit 10
CAN_F13R1_FB11              EQU (0x00000800)        ;Filter bit 11
CAN_F13R1_FB12              EQU (0x00001000)        ;Filter bit 12
CAN_F13R1_FB13              EQU (0x00002000)        ;Filter bit 13
CAN_F13R1_FB14              EQU (0x00004000)        ;Filter bit 14
CAN_F13R1_FB15              EQU (0x00008000)        ;Filter bit 15
CAN_F13R1_FB16              EQU (0x00010000)        ;Filter bit 16
CAN_F13R1_FB17              EQU (0x00020000)        ;Filter bit 17
CAN_F13R1_FB18              EQU (0x00040000)        ;Filter bit 18
CAN_F13R1_FB19              EQU (0x00080000)        ;Filter bit 19
CAN_F13R1_FB20              EQU (0x00100000)        ;Filter bit 20
CAN_F13R1_FB21              EQU (0x00200000)        ;Filter bit 21
CAN_F13R1_FB22              EQU (0x00400000)        ;Filter bit 22
CAN_F13R1_FB23              EQU (0x00800000)        ;Filter bit 23
CAN_F13R1_FB24              EQU (0x01000000)        ;Filter bit 24
CAN_F13R1_FB25              EQU (0x02000000)        ;Filter bit 25
CAN_F13R1_FB26              EQU (0x04000000)        ;Filter bit 26
CAN_F13R1_FB27              EQU (0x08000000)        ;Filter bit 27
CAN_F13R1_FB28              EQU (0x10000000)        ;Filter bit 28
CAN_F13R1_FB29              EQU (0x20000000)        ;Filter bit 29
CAN_F13R1_FB30              EQU (0x40000000)        ;Filter bit 30
CAN_F13R1_FB31              EQU (0x80000000)        ;Filter bit 31

; *******************  Bit definition for CAN_F0R2 register  ******************
CAN_F0R2_FB0                EQU (0x00000001)        ;Filter bit 0
CAN_F0R2_FB1                EQU (0x00000002)        ;Filter bit 1
CAN_F0R2_FB2                EQU (0x00000004)        ;Filter bit 2
CAN_F0R2_FB3                EQU (0x00000008)        ;Filter bit 3
CAN_F0R2_FB4                EQU (0x00000010)        ;Filter bit 4
CAN_F0R2_FB5                EQU (0x00000020)        ;Filter bit 5
CAN_F0R2_FB6                EQU (0x00000040)        ;Filter bit 6
CAN_F0R2_FB7                EQU (0x00000080)        ;Filter bit 7
CAN_F0R2_FB8                EQU (0x00000100)        ;Filter bit 8
CAN_F0R2_FB9                EQU (0x00000200)        ;Filter bit 9
CAN_F0R2_FB10               EQU (0x00000400)        ;Filter bit 10
CAN_F0R2_FB11               EQU (0x00000800)        ;Filter bit 11
CAN_F0R2_FB12               EQU (0x00001000)        ;Filter bit 12
CAN_F0R2_FB13               EQU (0x00002000)        ;Filter bit 13
CAN_F0R2_FB14               EQU (0x00004000)        ;Filter bit 14
CAN_F0R2_FB15               EQU (0x00008000)        ;Filter bit 15
CAN_F0R2_FB16               EQU (0x00010000)        ;Filter bit 16
CAN_F0R2_FB17               EQU (0x00020000)        ;Filter bit 17
CAN_F0R2_FB18               EQU (0x00040000)        ;Filter bit 18
CAN_F0R2_FB19               EQU (0x00080000)        ;Filter bit 19
CAN_F0R2_FB20               EQU (0x00100000)        ;Filter bit 20
CAN_F0R2_FB21               EQU (0x00200000)        ;Filter bit 21
CAN_F0R2_FB22               EQU (0x00400000)        ;Filter bit 22
CAN_F0R2_FB23               EQU (0x00800000)        ;Filter bit 23
CAN_F0R2_FB24               EQU (0x01000000)        ;Filter bit 24
CAN_F0R2_FB25               EQU (0x02000000)        ;Filter bit 25
CAN_F0R2_FB26               EQU (0x04000000)        ;Filter bit 26
CAN_F0R2_FB27               EQU (0x08000000)        ;Filter bit 27
CAN_F0R2_FB28               EQU (0x10000000)        ;Filter bit 28
CAN_F0R2_FB29               EQU (0x20000000)        ;Filter bit 29
CAN_F0R2_FB30               EQU (0x40000000)        ;Filter bit 30
CAN_F0R2_FB31               EQU (0x80000000)        ;Filter bit 31

; *******************  Bit definition for CAN_F1R2 register  ******************
CAN_F1R2_FB0                EQU (0x00000001)        ;Filter bit 0
CAN_F1R2_FB1                EQU (0x00000002)        ;Filter bit 1
CAN_F1R2_FB2                EQU (0x00000004)        ;Filter bit 2
CAN_F1R2_FB3                EQU (0x00000008)        ;Filter bit 3
CAN_F1R2_FB4                EQU (0x00000010)        ;Filter bit 4
CAN_F1R2_FB5                EQU (0x00000020)        ;Filter bit 5
CAN_F1R2_FB6                EQU (0x00000040)        ;Filter bit 6
CAN_F1R2_FB7                EQU (0x00000080)        ;Filter bit 7
CAN_F1R2_FB8                EQU (0x00000100)        ;Filter bit 8
CAN_F1R2_FB9                EQU (0x00000200)        ;Filter bit 9
CAN_F1R2_FB10               EQU (0x00000400)        ;Filter bit 10
CAN_F1R2_FB11               EQU (0x00000800)        ;Filter bit 11
CAN_F1R2_FB12               EQU (0x00001000)        ;Filter bit 12
CAN_F1R2_FB13               EQU (0x00002000)        ;Filter bit 13
CAN_F1R2_FB14               EQU (0x00004000)        ;Filter bit 14
CAN_F1R2_FB15               EQU (0x00008000)        ;Filter bit 15
CAN_F1R2_FB16               EQU (0x00010000)        ;Filter bit 16
CAN_F1R2_FB17               EQU (0x00020000)        ;Filter bit 17
CAN_F1R2_FB18               EQU (0x00040000)        ;Filter bit 18
CAN_F1R2_FB19               EQU (0x00080000)        ;Filter bit 19
CAN_F1R2_FB20               EQU (0x00100000)        ;Filter bit 20
CAN_F1R2_FB21               EQU (0x00200000)        ;Filter bit 21
CAN_F1R2_FB22               EQU (0x00400000)        ;Filter bit 22
CAN_F1R2_FB23               EQU (0x00800000)        ;Filter bit 23
CAN_F1R2_FB24               EQU (0x01000000)        ;Filter bit 24
CAN_F1R2_FB25               EQU (0x02000000)        ;Filter bit 25
CAN_F1R2_FB26               EQU (0x04000000)        ;Filter bit 26
CAN_F1R2_FB27               EQU (0x08000000)        ;Filter bit 27
CAN_F1R2_FB28               EQU (0x10000000)        ;Filter bit 28
CAN_F1R2_FB29               EQU (0x20000000)        ;Filter bit 29
CAN_F1R2_FB30               EQU (0x40000000)        ;Filter bit 30
CAN_F1R2_FB31               EQU (0x80000000)        ;Filter bit 31

