Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *******************  Bit definition for CAN_F12R2 register  *****************
CAN_F12R2_FB0               EQU (0x00000001)        ;Filter bit 0
CAN_F12R2_FB1               EQU (0x00000002)        ;Filter bit 1
CAN_F12R2_FB2               EQU (0x00000004)        ;Filter bit 2
CAN_F12R2_FB3               EQU (0x00000008)        ;Filter bit 3
CAN_F12R2_FB4               EQU (0x00000010)        ;Filter bit 4
CAN_F12R2_FB5               EQU (0x00000020)        ;Filter bit 5
CAN_F12R2_FB6               EQU (0x00000040)        ;Filter bit 6
CAN_F12R2_FB7               EQU (0x00000080)        ;Filter bit 7
CAN_F12R2_FB8               EQU (0x00000100)        ;Filter bit 8
CAN_F12R2_FB9               EQU (0x00000200)        ;Filter bit 9
CAN_F12R2_FB10              EQU (0x00000400)        ;Filter bit 10
CAN_F12R2_FB11              EQU (0x00000800)        ;Filter bit 11
CAN_F12R2_FB12              EQU (0x00001000)        ;Filter bit 12
CAN_F12R2_FB13              EQU (0x00002000)        ;Filter bit 13
CAN_F12R2_FB14              EQU (0x00004000)        ;Filter bit 14
CAN_F12R2_FB15              EQU (0x00008000)        ;Filter bit 15
CAN_F12R2_FB16              EQU (0x00010000)        ;Filter bit 16
CAN_F12R2_FB17              EQU (0x00020000)        ;Filter bit 17
CAN_F12R2_FB18              EQU (0x00040000)        ;Filter bit 18
CAN_F12R2_FB19              EQU (0x00080000)        ;Filter bit 19
CAN_F12R2_FB20              EQU (0x00100000)        ;Filter bit 20
CAN_F12R2_FB21              EQU (0x00200000)        ;Filter bit 21
CAN_F12R2_FB22              EQU (0x00400000)        ;Filter bit 22
CAN_F12R2_FB23              EQU (0x00800000)        ;Filter bit 23
CAN_F12R2_FB24              EQU (0x01000000)        ;Filter bit 24
CAN_F12R2_FB25              EQU (0x02000000)        ;Filter bit 25
CAN_F12R2_FB26              EQU (0x04000000)        ;Filter bit 26
CAN_F12R2_FB27              EQU (0x08000000)        ;Filter bit 27
CAN_F12R2_FB28              EQU (0x10000000)        ;Filter bit 28
CAN_F12R2_FB29              EQU (0x20000000)        ;Filter bit 29
CAN_F12R2_FB30              EQU (0x40000000)        ;Filter bit 30
CAN_F12R2_FB31              EQU (0x80000000)        ;Filter bit 31

; *******************  Bit definition for CAN_F13R2 register  *****************
CAN_F13R2_FB0               EQU (0x00000001)        ;Filter bit 0
CAN_F13R2_FB1               EQU (0x00000002)        ;Filter bit 1
CAN_F13R2_FB2               EQU (0x00000004)        ;Filter bit 2
CAN_F13R2_FB3               EQU (0x00000008)        ;Filter bit 3
CAN_F13R2_FB4               EQU (0x00000010)        ;Filter bit 4
CAN_F13R2_FB5               EQU (0x00000020)        ;Filter bit 5
CAN_F13R2_FB6               EQU (0x00000040)        ;Filter bit 6
CAN_F13R2_FB7               EQU (0x00000080)        ;Filter bit 7
CAN_F13R2_FB8               EQU (0x00000100)        ;Filter bit 8
CAN_F13R2_FB9               EQU (0x00000200)        ;Filter bit 9
CAN_F13R2_FB10              EQU (0x00000400)        ;Filter bit 10
CAN_F13R2_FB11              EQU (0x00000800)        ;Filter bit 11
CAN_F13R2_FB12              EQU (0x00001000)        ;Filter bit 12
CAN_F13R2_FB13              EQU (0x00002000)        ;Filter bit 13
CAN_F13R2_FB14              EQU (0x00004000)        ;Filter bit 14
CAN_F13R2_FB15              EQU (0x00008000)        ;Filter bit 15
CAN_F13R2_FB16              EQU (0x00010000)        ;Filter bit 16
CAN_F13R2_FB17              EQU (0x00020000)        ;Filter bit 17
CAN_F13R2_FB18              EQU (0x00040000)        ;Filter bit 18
CAN_F13R2_FB19              EQU (0x00080000)        ;Filter bit 19
CAN_F13R2_FB20              EQU (0x00100000)        ;Filter bit 20
CAN_F13R2_FB21              EQU (0x00200000)        ;Filter bit 21
CAN_F13R2_FB22              EQU (0x00400000)        ;Filter bit 22
CAN_F13R2_FB23              EQU (0x00800000)        ;Filter bit 23
CAN_F13R2_FB24              EQU (0x01000000)        ;Filter bit 24
CAN_F13R2_FB25              EQU (0x02000000)        ;Filter bit 25
CAN_F13R2_FB26              EQU (0x04000000)        ;Filter bit 26
CAN_F13R2_FB27              EQU (0x08000000)        ;Filter bit 27
CAN_F13R2_FB28              EQU (0x10000000)        ;Filter bit 28
CAN_F13R2_FB29              EQU (0x20000000)        ;Filter bit 29
CAN_F13R2_FB30              EQU (0x40000000)        ;Filter bit 30
CAN_F13R2_FB31              EQU (0x80000000)        ;Filter bit 31

; *****************************************************************************
;
;                          CRC calculation unit
;
; *****************************************************************************
; *******************  Bit definition for CRC_DR register  ********************
CRC_DR_DR                   EQU (0xFFFFFFFF) ; Data register bits

; *******************  Bit definition for CRC_IDR register  *******************
CRC_IDR_IDR                 EQU (0xFF)        ; General-purpose 8-bit data register bits

; ********************  Bit definition for CRC_CR register  *******************
CRC_CR_RESET                EQU (0x00000001) ; RESET the CRC computation unit bit
CRC_CR_POLYSIZE             EQU (0x00000018) ; Polynomial size bits
CRC_CR_POLYSIZE_0           EQU (0x00000008) ; Polynomial size bit 0
CRC_CR_POLYSIZE_1           EQU (0x00000010) ; Polynomial size bit 1
CRC_CR_REV_IN               EQU (0x00000060) ; REV_IN Reverse Input Data bits
CRC_CR_REV_IN_0             EQU (0x00000020) ; Bit 0
CRC_CR_REV_IN_1             EQU (0x00000040) ; Bit 1
CRC_CR_REV_OUT              EQU (0x00000080) ; REV_OUT Reverse Output Data bits

; *******************  Bit definition for CRC_INIT register  ******************
CRC_INIT_INIT               EQU (0xFFFFFFFF) ; Initial CRC value bits

; *******************  Bit definition for CRC_POL register  *******************
CRC_POL_POL                 EQU (0xFFFFFFFF) ; Coefficients of the polynomial

; *****************************************************************************
;
;                      Digital to Analog Converter
;
; *****************************************************************************
; ********************  Bit definition for DAC_CR register  *******************
DAC_CR_EN1                  EQU (0x00000001)        ;DAC channel1 enable
DAC_CR_TEN1                 EQU (0x00000004)        ;DAC channel1 Trigger enable

DAC_CR_TSEL1                EQU (0x00000038)        ;TSEL1[2:0] (DAC channel1 Trigger selection)
DAC_CR_TSEL1_0              EQU (0x00000008)        ;Bit 0
DAC_CR_TSEL1_1              EQU (0x00000010)        ;Bit 1
DAC_CR_TSEL1_2              EQU (0x00000020)        ;Bit 2

DAC_CR_WAVE1                EQU (0x000000C0)        ;WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable)
DAC_CR_WAVE1_0              EQU (0x00000040)        ;Bit 0
DAC_CR_WAVE1_1              EQU (0x00000080)        ;Bit 1

DAC_CR_MAMP1                EQU (0x00000F00)        ;MAMP1[3:0] (DAC channel1 Mask/Amplitude selector)
DAC_CR_MAMP1_0              EQU (0x00000100)        ;Bit 0
DAC_CR_MAMP1_1              EQU (0x00000200)        ;Bit 1
DAC_CR_MAMP1_2              EQU (0x00000400)        ;Bit 2
DAC_CR_MAMP1_3              EQU (0x00000800)        ;Bit 3

DAC_CR_DMAEN1               EQU (0x00001000)        ;DAC channel1 DMA enable
DAC_CR_DMAUDRIE1            EQU (0x00002000)        ;DAC channel 1 DMA underrun interrupt enable  >
DAC_CR_CEN1                 EQU (0x00004000)        ;DAC channel 1 calibration enable >

DAC_CR_EN2                  EQU (0x00010000)        ;DAC channel2 enable
DAC_CR_TEN2                 EQU (0x00040000)        ;DAC channel2 Trigger enable

DAC_CR_TSEL2                EQU (0x00380000)        ;TSEL2[2:0] (DAC channel2 Trigger selection)
DAC_CR_TSEL2_0              EQU (0x00080000)        ;Bit 0
DAC_CR_TSEL2_1              EQU (0x00100000)        ;Bit 1
DAC_CR_TSEL2_2              EQU (0x00200000)        ;Bit 2

DAC_CR_WAVE2                EQU (0x00C00000)        ;WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable)
DAC_CR_WAVE2_0              EQU (0x00400000)        ;Bit 0
DAC_CR_WAVE2_1              EQU (0x00800000)        ;Bit 1

DAC_CR_MAMP2                EQU (0x0F000000)        ;MAMP2[3:0] (DAC channel2 Mask/Amplitude selector)
DAC_CR_MAMP2_0              EQU (0x01000000)        ;Bit 0
DAC_CR_MAMP2_1              EQU (0x02000000)        ;Bit 1
DAC_CR_MAMP2_2              EQU (0x04000000)        ;Bit 2
DAC_CR_MAMP2_3              EQU (0x08000000)        ;Bit 3

DAC_CR_DMAEN2               EQU (0x10000000)        ;DAC channel2 DMA enabled
DAC_CR_DMAUDRIE2            EQU (0x20000000)        ;DAC channel2 DMA underrun interrupt enable  >
DAC_CR_CEN2                 EQU (0x40000000)        ;DAC channel2 calibration enable >

; *****************  Bit definition for DAC_SWTRIGR register  *****************
DAC_SWTRIGR_SWTRIG1         EQU (0x00000001)        ;DAC channel1 software trigger
DAC_SWTRIGR_SWTRIG2         EQU (0x00000002)        ;DAC channel2 software trigger

