Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *****************  Bit definition for DAC_DHR12R1 register  *****************
DAC_DHR12R1_DACC1DHR        EQU (0x00000FFF)        ;DAC channel1 12-bit Right aligned data

; *****************  Bit definition for DAC_DHR12L1 register  *****************
DAC_DHR12L1_DACC1DHR        EQU (0x0000FFF0)        ;DAC channel1 12-bit Left aligned data

; ******************  Bit definition for DAC_DHR8R1 register  *****************
DAC_DHR8R1_DACC1DHR         EQU (0x000000FF)        ;DAC channel1 8-bit Right aligned data

; *****************  Bit definition for DAC_DHR12R2 register  *****************
DAC_DHR12R2_DACC2DHR        EQU (0x00000FFF)        ;DAC channel2 12-bit Right aligned data

; *****************  Bit definition for DAC_DHR12L2 register  *****************
DAC_DHR12L2_DACC2DHR        EQU (0x0000FFF0)        ;DAC channel2 12-bit Left aligned data

; ******************  Bit definition for DAC_DHR8R2 register  *****************
DAC_DHR8R2_DACC2DHR         EQU (0x000000FF)        ;DAC channel2 8-bit Right aligned data

; *****************  Bit definition for DAC_DHR12RD register  *****************
DAC_DHR12RD_DACC1DHR        EQU (0x00000FFF)        ;DAC channel1 12-bit Right aligned data
DAC_DHR12RD_DACC2DHR        EQU (0x0FFF0000)        ;DAC channel2 12-bit Right aligned data

; *****************  Bit definition for DAC_DHR12LD register  *****************
DAC_DHR12LD_DACC1DHR        EQU (0x0000FFF0)        ;DAC channel1 12-bit Left aligned data
DAC_DHR12LD_DACC2DHR        EQU (0xFFF00000)        ;DAC channel2 12-bit Left aligned data

; ******************  Bit definition for DAC_DHR8RD register  *****************
DAC_DHR8RD_DACC1DHR         EQU (0x000000FF)        ;DAC channel1 8-bit Right aligned data
DAC_DHR8RD_DACC2DHR         EQU (0x0000FF00)        ;DAC channel2 8-bit Right aligned data

; *******************  Bit definition for DAC_DOR1 register  ******************
DAC_DOR1_DACC1DOR           EQU (0x00000FFF)        ;DAC channel1 data output

; *******************  Bit definition for DAC_DOR2 register  ******************
DAC_DOR2_DACC2DOR           EQU (0x00000FFF)        ;DAC channel2 data output

; ********************  Bit definition for DAC_SR register  *******************
DAC_SR_DMAUDR1              EQU (0x00002000)        ;DAC channel1 DMA underrun flag
DAC_SR_CAL_FLAG1            EQU (0x00004000)        ;DAC channel1 calibration offset status
DAC_SR_BWST1                EQU (0x20008000)        ;DAC channel1 busy writing sample time flag

DAC_SR_DMAUDR2              EQU (0x20000000)        ;DAC channel2 DMA underrun flag
DAC_SR_CAL_FLAG2            EQU (0x40000000)        ;DAC channel2 calibration offset status
DAC_SR_BWST2                EQU (0x80000000)        ;DAC channel2 busy writing sample time flag

; *******************  Bit definition for DAC_CCR register  *******************
DAC_CCR_OTRIM1              EQU (0x0000001F)        ;DAC channel1 offset trimming value
DAC_CCR_OTRIM2              EQU (0x001F0000)        ;DAC channel2 offset trimming value

; *******************  Bit definition for DAC_MCR register  ******************
DAC_MCR_MODE1                EQU (0x00000007)        ;MODE1[2:0] (DAC channel1 mode)
DAC_MCR_MODE1_0              EQU (0x00000001)        ;Bit 0
DAC_MCR_MODE1_1              EQU (0x00000002)        ;Bit 1
DAC_MCR_MODE1_2              EQU (0x00000004)        ;Bit 2

DAC_MCR_MODE2                EQU (0x00070000)        ;MODE2[2:0] (DAC channel2 mode)
DAC_MCR_MODE2_0              EQU (0x00010000)        ;Bit 0
DAC_MCR_MODE2_1              EQU (0x00020000)        ;Bit 1
DAC_MCR_MODE2_2              EQU (0x00040000)        ;Bit 2

; ******************  Bit definition for DAC_SHSR1 register  *****************
DAC_SHSR1_TSAMPLE1           EQU (0x000003FF)        ;DAC channel1 sample time

; ******************  Bit definition for DAC_SHSR2 register  *****************
DAC_SHSR2_TSAMPLE2           EQU (0x000003FF)        ;DAC channel2 sample time

; ******************  Bit definition for DAC_SHHR register  *****************
DAC_SHHR_THOLD1              EQU (0x000003FF)        ;DAC channel1 hold time
DAC_SHHR_THOLD2              EQU (0x03FF0000)        ;DAC channel2 hold time

; ******************  Bit definition for DAC_SHRR register  *****************
DAC_SHRR_TREFRESH1           EQU (0x000000FF)        ;DAC channel1 refresh time
DAC_SHRR_TREFRESH2           EQU (0x00FF0000)        ;DAC channel2 refresh time


; *****************************************************************************
;
;                 Digital Filter for Sigma Delta Modulators
;
; *****************************************************************************

; ****************   DFSDM channel configuration registers  *******************

; ***************  Bit definition for DFSDM_CHCFGR1 register  *****************
DFSDM_CHCFGR1_DFSDMEN        EQU (0x80000000)            ; Global enable for DFSDM interface
DFSDM_CHCFGR1_CKOUTSRC       EQU (0x40000000)            ; Output serial clock source selection
DFSDM_CHCFGR1_CKOUTDIV       EQU (0x00FF0000)            ; CKOUTDIV[7:0] output serial clock divider
DFSDM_CHCFGR1_DATPACK        EQU (0x0000C000)            ; DATPACK[1:0] Data packing mode
DFSDM_CHCFGR1_DATPACK_1      EQU (0x00008000)            ; Data packing mode, Bit 1
DFSDM_CHCFGR1_DATPACK_0      EQU (0x00004000)            ; Data packing mode, Bit 0
DFSDM_CHCFGR1_DATMPX         EQU (0x00003000)            ; DATMPX[1:0] Input data multiplexer for channel y
DFSDM_CHCFGR1_DATMPX_1       EQU (0x00002000)            ; Input data multiplexer for channel y, Bit 1
DFSDM_CHCFGR1_DATMPX_0       EQU (0x00001000)            ; Input data multiplexer for channel y, Bit 0
DFSDM_CHCFGR1_CHINSEL        EQU (0x00000100)            ; Serial inputs selection for channel y
DFSDM_CHCFGR1_CHEN           EQU (0x00000080)            ; Channel y enable
DFSDM_CHCFGR1_CKABEN         EQU (0x00000040)            ; Clock absence detector enable on channel y
DFSDM_CHCFGR1_SCDEN          EQU (0x00000020)            ; Short circuit detector enable on channel y
DFSDM_CHCFGR1_SPICKSEL       EQU (0x0000000C)            ; SPICKSEL[1:0] SPI clock select for channel y
DFSDM_CHCFGR1_SPICKSEL_1     EQU (0x00000008)            ; SPI clock select for channel y, Bit 1
DFSDM_CHCFGR1_SPICKSEL_0     EQU (0x00000004)            ; SPI clock select for channel y, Bit 0
DFSDM_CHCFGR1_SITP           EQU (0x00000003)            ; SITP[1:0] Serial interface type for channel y
DFSDM_CHCFGR1_SITP_1         EQU (0x00000002)            ; Serial interface type for channel y, Bit 1
DFSDM_CHCFGR1_SITP_0         EQU (0x00000001)            ; Serial interface type for channel y, Bit 0

