Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ***************  Bit definition for DFSDM_CHCFGR2 register  *****************
DFSDM_CHCFGR2_OFFSET         EQU (0xFFFFFF00)            ; OFFSET[23:0] 24-bit calibration offset for channel y
DFSDM_CHCFGR2_DTRBS          EQU (0x000000F8)            ; DTRBS[4:0] Data right bit-shift for channel y

; ******************  Bit definition for DFSDM_AWSCDR register ****************
DFSDM_AWSCDR_AWFORD          EQU (0x00C00000)            ; AWFORD[1:0] Analog watchdog Sinc filter order on channel y
DFSDM_AWSCDR_AWFORD_1        EQU (0x00800000)            ; Analog watchdog Sinc filter order on channel y, Bit 1
DFSDM_AWSCDR_AWFORD_0        EQU (0x00400000)            ; Analog watchdog Sinc filter order on channel y, Bit 0
DFSDM_AWSCDR_AWFOSR          EQU (0x001F0000)            ; AWFOSR[4:0] Analog watchdog filter oversampling ratio on channel y
DFSDM_AWSCDR_BKSCD           EQU (0x0000F000)            ; BKSCD[3:0] Break signal assignment for short circuit detector on channel y
DFSDM_AWSCDR_SCDT            EQU (0x000000FF)            ; SCDT[7:0] Short circuit detector threshold for channel y

; ****************  Bit definition for DFSDM_CHWDATR register ******************
DFSDM_AWSCDR_WDATA           EQU (0x0000FFFF)            ; WDATA[15:0] Input channel y watchdog data

; ****************  Bit definition for DFSDM_CHDATINR register ****************
DFSDM_AWSCDR_INDAT0           EQU (0x0000FFFF)            ; INDAT0[31:16] Input data for channel y or channel (y+1)
DFSDM_AWSCDR_INDAT1           EQU (0xFFFF0000)            ; INDAT0[15:0] Input data for channel y

; ************************   DFSDM module registers  ***************************

; ********************  Bit definition for DFSDM_CR1 register ******************
DFSDM_CR1_AWFSEL             EQU (0x40000000)            ; Analog watchdog fast mode select
DFSDM_CR1_FAST               EQU (0x20000000)            ; Fast conversion mode selection
DFSDM_CR1_RCH                EQU (0x07000000)            ; RCH[2:0] Regular channel selection
DFSDM_CR1_RDMAEN             EQU (0x00200000)            ; DMA channel enabled to read data for the regular conversion
DFSDM_CR1_RSYNC              EQU (0x00080000)            ; Launch regular conversion synchronously with DFSDMx
DFSDM_CR1_RCONT              EQU (0x00040000)            ; Continuous mode selection for regular conversions
DFSDM_CR1_RSWSTART           EQU (0x00020000)            ; Software start of a conversion on the regular channel
DFSDM_CR1_JEXTEN             EQU (0x00006000)            ; JEXTEN[1:0] Trigger enable and trigger edge selection for injected conversions
DFSDM_CR1_JEXTEN_1           EQU (0x00004000)            ; Trigger enable and trigger edge selection for injected conversions, Bit 1
DFSDM_CR1_JEXTEN_0           EQU (0x00002000)            ; Trigger enable and trigger edge selection for injected conversions, Bit 0
DFSDM_CR1_JEXTSEL            EQU (0x00000700)            ; JEXTSEL[2:0]Trigger signal selection for launching injected conversions
DFSDM_CR1_JEXTSEL_2          EQU (0x00000400)            ; Trigger signal selection for launching injected conversions, Bit 2
DFSDM_CR1_JEXTSEL_1          EQU (0x00000200)            ; Trigger signal selection for launching injected conversions, Bit 1
DFSDM_CR1_JEXTSEL_0          EQU (0x00000100)            ; Trigger signal selection for launching injected conversions, Bit 0
DFSDM_CR1_JDMAEN             EQU (0x00000020)            ; DMA channel enabled to read data for the injected channel group
DFSDM_CR1_JSCAN              EQU (0x00000010)            ; Scanning conversion in continuous mode selection for injected conversions
DFSDM_CR1_JSYNC              EQU (0x00000008)            ; Launch an injected conversion synchronously with DFSDMx JSWSTART trigger
DFSDM_CR1_JSWSTART           EQU (0x00000002)            ; Start the conversion of the injected group of channels
DFSDM_CR1_DFEN               EQU (0x00000001)            ; DFSDM enable

; ********************  Bit definition for DFSDM_CR2 register ******************
DFSDM_CR2_AWDCH              EQU (0x00FF0000)            ; AWDCH[7:0] Analog watchdog channel selection
DFSDM_CR2_EXCH               EQU (0x0000FF00)            ; EXCH[7:0] Extreme detector channel selection
DFSDM_CR2_CKABIE             EQU (0x00000040)            ; Clock absence interrupt enable
DFSDM_CR2_SCDIE              EQU (0x00000020)            ; Short circuit detector interrupt enable
DFSDM_CR2_AWDIE              EQU (0x00000010)            ; Analog watchdog interrupt enable
DFSDM_CR2_ROVRIE             EQU (0x00000008)            ; Regular data overrun interrupt enable
DFSDM_CR2_JOVRIE             EQU (0x00000004)            ; Injected data overrun interrupt enable
DFSDM_CR2_REOCIE             EQU (0x00000002)            ; Regular end of conversion interrupt enable
DFSDM_CR2_JEOCIE             EQU (0x00000001)            ; Injected end of conversion interrupt enable

; ********************  Bit definition for DFSDM_ISR register ******************
DFSDM_ISR_SCDF               EQU (0xFF000000)            ; SCDF[7:0] Short circuit detector flag
DFSDM_ISR_CKABF              EQU (0x00FF0000)            ; CKABF[7:0] Clock absence flag
DFSDM_ISR_RCIP               EQU (0x00004000)            ; Regular conversion in progress status
DFSDM_ISR_JCIP               EQU (0x00002000)            ; Injected conversion in progress status
DFSDM_ISR_AWDF               EQU (0x00000010)            ; Analog watchdog
DFSDM_ISR_ROVRF              EQU (0x00000008)            ; Regular conversion overrun flag
DFSDM_ISR_JOVRF              EQU (0x00000004)            ; Injected conversion overrun flag
DFSDM_ISR_REOCF              EQU (0x00000002)            ; End of regular conversion flag
DFSDM_ISR_JEOCF              EQU (0x00000001)            ; End of injected conversion flag

; ********************  Bit definition for DFSDM_ICR register ******************
DFSDM_ICR_CLRSCSDF           EQU (0xFF000000)            ; CLRSCSDF[7:0] Clear the short circuit detector flag
DFSDM_ICR_CLRCKABF           EQU (0x00FF0000)            ; CLRCKABF[7:0] Clear the clock absence flag
DFSDM_ICR_CLRROVRF           EQU (0x00000008)            ; Clear the regular conversion overrun flag
DFSDM_ICR_CLRJOVRF           EQU (0x00000004)            ; Clear the injected conversion overrun flag

