Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *******************  Bit definition for DFSDM_JCHGR register *****************
DFSDM_JCHGR_JCHG             EQU (0x000000FF)            ; JCHG[7:0] Injected channel group selection

; ********************  Bit definition for DFSDM_FCR register ******************
DFSDM_FCR_FORD               EQU (0xE0000000)            ; FORD[2:0] Sinc filter order
DFSDM_FCR_FORD_2             EQU (0x80000000)            ; Sinc filter order, Bit 2
DFSDM_FCR_FORD_1             EQU (0x40000000)            ; Sinc filter order, Bit 1
DFSDM_FCR_FORD_0             EQU (0x20000000)            ; Sinc filter order, Bit 0
DFSDM_FCR_FOSR               EQU (0x03FF0000)            ; FOSR[9:0] Sinc filter oversampling ratio (decimation rate)
DFSDM_FCR_IOSR               EQU (0x000000FF)            ; IOSR[7:0] Integrator oversampling ratio (averaging length)

; ******************  Bit definition for DFSDM_JDATAR register ****************
DFSDM_JDATAR_JDATA           EQU (0xFFFFFF00)            ; JDATA[23:0] Injected group conversion data
DFSDM_JDATAR_JDATACH         EQU (0x00000007)            ; JDATACH[2:0] Injected channel most recently converted

; ******************  Bit definition for DFSDM_RDATAR register ****************
DFSDM_RDATAR_RDATA           EQU (0xFFFFFF00)            ; RDATA[23:0] Regular channel conversion data
DFSDM_RDATAR_RPEND           EQU (0x00000010)            ; RPEND Regular channel pending data
DFSDM_RDATAR_RDATACH         EQU (0x00000007)            ; RDATACH[2:0] Regular channel most recently converted

; ******************  Bit definition for DFSDM_AWHTR register *****************
DFSDM_AWHTR_AWHT            EQU (0xFFFFFF00)             ; AWHT[23:0] Analog watchdog high threshold
DFSDM_AWHTR_BKAWH           EQU (0x0000000F)             ; BKAWH[3:0] Break signal assignment to analog watchdog high threshold event

; ******************  Bit definition for DFSDM_AWLTR register *****************
DFSDM_AWLTR_AWLT            EQU (0xFFFFFF00)             ; AWHT[23:0] Analog watchdog low threshold
DFSDM_AWLTR_BKAWL           EQU (0x0000000F)             ; BKAWL[3:0] Break signal assignment to analog watchdog low threshold event

; ******************  Bit definition for DFSDM_AWSR register *****************
DFSDM_AWSR_AWHTF            EQU (0x0000FF00)             ; AWHTF[15:8] Analog watchdog high threshold error on given channels
DFSDM_AWSR_AWLTF            EQU (0x000000FF)             ; AWLTF[7:0] Analog watchdog low threshold error on given channels

; ******************  Bit definition for DFSDM_AWCFR) register ****************
DFSDM_AWCFR_CLRAWHTF        EQU (0x0000FF00)             ; CLRAWHTF[15:8] Clear the Analog watchdog high threshold flag
DFSDM_AWCFR_CLRAWLTF        EQU (0x000000FF)             ; CLRAWLTF[7:0] Clear the Analog watchdog low threshold flag

; ******************  Bit definition for DFSDM_EXMAX register *****************
DFSDM_EXMAX_EXMAX           EQU (0xFFFFFF00)             ; EXMAX[23:0] Extreme detector maximum value
DFSDM_EXMAX_EXMAXCH         EQU (0x00000007)             ; EXMAXCH[2:0] Extreme detector maximum data channel

; ******************  Bit definition for DFSDM_EXMIN register *****************
DFSDM_EXMIN_EXMIN           EQU (0xFFFFFF00)             ; EXMIN[23:0] Extreme detector minimum value
DFSDM_EXMIN_EXMINCH         EQU (0x00000007)             ; EXMINCH[2:0] Extreme detector minimum data channel

; ******************  Bit definition for DFSDM_EXMIN register *****************
DFSDM_CNVTIMR_CNVCNT        EQU (0xFFFFFFF0)             ; CNVCNT[27:0]: 28-bit timer counting conversion time

; *****************************************************************************
;
;                           DMA Controller (DMA)
;
; *****************************************************************************

; *******************  Bit definition for DMA_ISR register  *******************
DMA_ISR_GIF1                EQU (0x00000001)        ; Channel 1 Global interrupt flag
DMA_ISR_TCIF1               EQU (0x00000002)        ; Channel 1 Transfer Complete flag
DMA_ISR_HTIF1               EQU (0x00000004)        ; Channel 1 Half Transfer flag
DMA_ISR_TEIF1               EQU (0x00000008)        ; Channel 1 Transfer Error flag
DMA_ISR_GIF2                EQU (0x00000010)        ; Channel 2 Global interrupt flag
DMA_ISR_TCIF2               EQU (0x00000020)        ; Channel 2 Transfer Complete flag
DMA_ISR_HTIF2               EQU (0x00000040)        ; Channel 2 Half Transfer flag
DMA_ISR_TEIF2               EQU (0x00000080)        ; Channel 2 Transfer Error flag
DMA_ISR_GIF3                EQU (0x00000100)        ; Channel 3 Global interrupt flag
DMA_ISR_TCIF3               EQU (0x00000200)        ; Channel 3 Transfer Complete flag
DMA_ISR_HTIF3               EQU (0x00000400)        ; Channel 3 Half Transfer flag
DMA_ISR_TEIF3               EQU (0x00000800)        ; Channel 3 Transfer Error flag
DMA_ISR_GIF4                EQU (0x00001000)        ; Channel 4 Global interrupt flag
DMA_ISR_TCIF4               EQU (0x00002000)        ; Channel 4 Transfer Complete flag
DMA_ISR_HTIF4               EQU (0x00004000)        ; Channel 4 Half Transfer flag
DMA_ISR_TEIF4               EQU (0x00008000)        ; Channel 4 Transfer Error flag
DMA_ISR_GIF5                EQU (0x00010000)        ; Channel 5 Global interrupt flag
DMA_ISR_TCIF5               EQU (0x00020000)        ; Channel 5 Transfer Complete flag
DMA_ISR_HTIF5               EQU (0x00040000)        ; Channel 5 Half Transfer flag
DMA_ISR_TEIF5               EQU (0x00080000)        ; Channel 5 Transfer Error flag
DMA_ISR_GIF6                EQU (0x00100000)        ; Channel 6 Global interrupt flag
DMA_ISR_TCIF6               EQU (0x00200000)        ; Channel 6 Transfer Complete flag
DMA_ISR_HTIF6               EQU (0x00400000)        ; Channel 6 Half Transfer flag
DMA_ISR_TEIF6               EQU (0x00800000)        ; Channel 6 Transfer Error flag
DMA_ISR_GIF7                EQU (0x01000000)        ; Channel 7 Global interrupt flag
DMA_ISR_TCIF7               EQU (0x02000000)        ; Channel 7 Transfer Complete flag
DMA_ISR_HTIF7               EQU (0x04000000)        ; Channel 7 Half Transfer flag
DMA_ISR_TEIF7               EQU (0x08000000)        ; Channel 7 Transfer Error flag

; *******************  Bit definition for DMA_IFCR register  ******************
DMA_IFCR_CGIF1              EQU (0x00000001)        ; Channel 1 Global interrupt clearr
DMA_IFCR_CTCIF1             EQU (0x00000002)        ; Channel 1 Transfer Complete clear
DMA_IFCR_CHTIF1             EQU (0x00000004)        ; Channel 1 Half Transfer clear
DMA_IFCR_CTEIF1             EQU (0x00000008)        ; Channel 1 Transfer Error clear
DMA_IFCR_CGIF2              EQU (0x00000010)        ; Channel 2 Global interrupt clear
DMA_IFCR_CTCIF2             EQU (0x00000020)        ; Channel 2 Transfer Complete clear
DMA_IFCR_CHTIF2             EQU (0x00000040)        ; Channel 2 Half Transfer clear
DMA_IFCR_CTEIF2             EQU (0x00000080)        ; Channel 2 Transfer Error clear
DMA_IFCR_CGIF3              EQU (0x00000100)        ; Channel 3 Global interrupt clear
DMA_IFCR_CTCIF3             EQU (0x00000200)        ; Channel 3 Transfer Complete clear
DMA_IFCR_CHTIF3             EQU (0x00000400)        ; Channel 3 Half Transfer clear
DMA_IFCR_CTEIF3             EQU (0x00000800)        ; Channel 3 Transfer Error clear
DMA_IFCR_CGIF4              EQU (0x00001000)        ; Channel 4 Global interrupt clear
DMA_IFCR_CTCIF4             EQU (0x00002000)        ; Channel 4 Transfer Complete clear
DMA_IFCR_CHTIF4             EQU (0x00004000)        ; Channel 4 Half Transfer clear
DMA_IFCR_CTEIF4             EQU (0x00008000)        ; Channel 4 Transfer Error clear
DMA_IFCR_CGIF5              EQU (0x00010000)        ; Channel 5 Global interrupt clear
DMA_IFCR_CTCIF5             EQU (0x00020000)        ; Channel 5 Transfer Complete clear
DMA_IFCR_CHTIF5             EQU (0x00040000)        ; Channel 5 Half Transfer clear
DMA_IFCR_CTEIF5             EQU (0x00080000)        ; Channel 5 Transfer Error clear
DMA_IFCR_CGIF6              EQU (0x00100000)        ; Channel 6 Global interrupt clear
DMA_IFCR_CTCIF6             EQU (0x00200000)        ; Channel 6 Transfer Complete clear
DMA_IFCR_CHTIF6             EQU (0x00400000)        ; Channel 6 Half Transfer clear
DMA_IFCR_CTEIF6             EQU (0x00800000)        ; Channel 6 Transfer Error clear
DMA_IFCR_CGIF7              EQU (0x01000000)        ; Channel 7 Global interrupt clear
DMA_IFCR_CTCIF7             EQU (0x02000000)        ; Channel 7 Transfer Complete clear
DMA_IFCR_CHTIF7             EQU (0x04000000)        ; Channel 7 Half Transfer clear
DMA_IFCR_CTEIF7             EQU (0x08000000)        ; Channel 7 Transfer Error clear

