Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *******************  Bit definition for DMA_CCR register  *******************
DMA_CCR_EN                  EQU (0x00000001)        ; Channel enable
DMA_CCR_TCIE                EQU (0x00000002)        ; Transfer complete interrupt enable
DMA_CCR_HTIE                EQU (0x00000004)        ; Half Transfer interrupt enable
DMA_CCR_TEIE                EQU (0x00000008)        ; Transfer error interrupt enable
DMA_CCR_DIR                 EQU (0x00000010)        ; Data transfer direction
DMA_CCR_CIRC                EQU (0x00000020)        ; Circular mode
DMA_CCR_PINC                EQU (0x00000040)        ; Peripheral increment mode
DMA_CCR_MINC                EQU (0x00000080)        ; Memory increment mode

DMA_CCR_PSIZE               EQU (0x00000300)        ; PSIZE[1:0] bits (Peripheral size)
DMA_CCR_PSIZE_0             EQU (0x00000100)        ; Bit 0
DMA_CCR_PSIZE_1             EQU (0x00000200)        ; Bit 1

DMA_CCR_MSIZE               EQU (0x00000C00)        ; MSIZE[1:0] bits (Memory size)
DMA_CCR_MSIZE_0             EQU (0x00000400)        ; Bit 0
DMA_CCR_MSIZE_1             EQU (0x00000800)        ; Bit 1

DMA_CCR_PL                  EQU (0x00003000)        ; PL[1:0] bits(Channel Priority level)
DMA_CCR_PL_0                EQU (0x00001000)        ; Bit 0
DMA_CCR_PL_1                EQU (0x00002000)        ; Bit 1

DMA_CCR_MEM2MEM             EQU (0x00004000)        ; Memory to memory mode

; ******************  Bit definition for DMA_CNDTR register  ******************
DMA_CNDTR_NDT               EQU (0x0000FFFF)        ; Number of data to Transfer

; ******************  Bit definition for DMA_CPAR register  *******************
DMA_CPAR_PA                 EQU (0xFFFFFFFF)        ; Peripheral Address

; ******************  Bit definition for DMA_CMAR register  *******************
DMA_CMAR_MA                 EQU (0xFFFFFFFF)        ; Memory Address


; *******************  Bit definition for DMA_CSELR register  ******************
DMA_CSELR_C1S                  EQU (0x0000000F)          ; Channel 1 Selection
DMA_CSELR_C2S                  EQU (0x000000F0)          ; Channel 2 Selection
DMA_CSELR_C3S                  EQU (0x00000F00)          ; Channel 3 Selection
DMA_CSELR_C4S                  EQU (0x0000F000)          ; Channel 4 Selection
DMA_CSELR_C5S                  EQU (0x000F0000)          ; Channel 5 Selection
DMA_CSELR_C6S                  EQU (0x00F00000)          ; Channel 6 Selection
DMA_CSELR_C7S                  EQU (0x0F000000)          ; Channel 7 Selection


; *****************************************************************************
;
;                    External Interrupt/Event Controller
;
; *****************************************************************************
; *******************  Bit definition for EXTI_IMR1 register  *****************
EXTI_IMR1_IM0               EQU (0x00000001)        ; Interrupt Mask on line 0
EXTI_IMR1_IM1               EQU (0x00000002)        ; Interrupt Mask on line 1
EXTI_IMR1_IM2               EQU (0x00000004)        ; Interrupt Mask on line 2
EXTI_IMR1_IM3               EQU (0x00000008)        ; Interrupt Mask on line 3
EXTI_IMR1_IM4               EQU (0x00000010)        ; Interrupt Mask on line 4
EXTI_IMR1_IM5               EQU (0x00000020)        ; Interrupt Mask on line 5
EXTI_IMR1_IM6               EQU (0x00000040)        ; Interrupt Mask on line 6
EXTI_IMR1_IM7               EQU (0x00000080)        ; Interrupt Mask on line 7
EXTI_IMR1_IM8               EQU (0x00000100)        ; Interrupt Mask on line 8
EXTI_IMR1_IM9               EQU (0x00000200)        ; Interrupt Mask on line 9
EXTI_IMR1_IM10              EQU (0x00000400)        ; Interrupt Mask on line 10
EXTI_IMR1_IM11              EQU (0x00000800)        ; Interrupt Mask on line 11
EXTI_IMR1_IM12              EQU (0x00001000)        ; Interrupt Mask on line 12
EXTI_IMR1_IM13              EQU (0x00002000)        ; Interrupt Mask on line 13
EXTI_IMR1_IM14              EQU (0x00004000)        ; Interrupt Mask on line 14
EXTI_IMR1_IM15              EQU (0x00008000)        ; Interrupt Mask on line 15
EXTI_IMR1_IM16              EQU (0x00010000)        ; Interrupt Mask on line 16
EXTI_IMR1_IM17              EQU (0x00020000)        ; Interrupt Mask on line 17
EXTI_IMR1_IM18              EQU (0x00040000)        ; Interrupt Mask on line 18
EXTI_IMR1_IM19              EQU (0x00080000)        ; Interrupt Mask on line 19
EXTI_IMR1_IM20              EQU (0x00100000)        ; Interrupt Mask on line 20
EXTI_IMR1_IM21              EQU (0x00200000)        ; Interrupt Mask on line 21
EXTI_IMR1_IM22              EQU (0x00400000)        ; Interrupt Mask on line 22
EXTI_IMR1_IM23              EQU (0x00800000)        ; Interrupt Mask on line 23
EXTI_IMR1_IM24              EQU (0x01000000)        ; Interrupt Mask on line 24
EXTI_IMR1_IM25              EQU (0x02000000)        ; Interrupt Mask on line 25
EXTI_IMR1_IM26              EQU (0x04000000)        ; Interrupt Mask on line 26
EXTI_IMR1_IM27              EQU (0x08000000)        ; Interrupt Mask on line 27
EXTI_IMR1_IM28              EQU (0x10000000)        ; Interrupt Mask on line 28
EXTI_IMR1_IM29              EQU (0x20000000)        ; Interrupt Mask on line 29
EXTI_IMR1_IM30              EQU (0x40000000)        ; Interrupt Mask on line 30
EXTI_IMR1_IM31              EQU (0x80000000)        ; Interrupt Mask on line 31

; *******************  Bit definition for EXTI_EMR1 register  *****************
EXTI_EMR1_EM0               EQU (0x00000001)        ; Event Mask on line 0
EXTI_EMR1_EM1               EQU (0x00000002)        ; Event Mask on line 1
EXTI_EMR1_EM2               EQU (0x00000004)        ; Event Mask on line 2
EXTI_EMR1_EM3               EQU (0x00000008)        ; Event Mask on line 3
EXTI_EMR1_EM4               EQU (0x00000010)        ; Event Mask on line 4
EXTI_EMR1_EM5               EQU (0x00000020)        ; Event Mask on line 5
EXTI_EMR1_EM6               EQU (0x00000040)        ; Event Mask on line 6
EXTI_EMR1_EM7               EQU (0x00000080)        ; Event Mask on line 7
EXTI_EMR1_EM8               EQU (0x00000100)        ; Event Mask on line 8
EXTI_EMR1_EM9               EQU (0x00000200)        ; Event Mask on line 9
EXTI_EMR1_EM10              EQU (0x00000400)        ; Event Mask on line 10
EXTI_EMR1_EM11              EQU (0x00000800)        ; Event Mask on line 11
EXTI_EMR1_EM12              EQU (0x00001000)        ; Event Mask on line 12
EXTI_EMR1_EM13              EQU (0x00002000)        ; Event Mask on line 13
EXTI_EMR1_EM14              EQU (0x00004000)        ; Event Mask on line 14
EXTI_EMR1_EM15              EQU (0x00008000)        ; Event Mask on line 15
EXTI_EMR1_EM16              EQU (0x00010000)        ; Event Mask on line 16
EXTI_EMR1_EM17              EQU (0x00020000)        ; Event Mask on line 17
EXTI_EMR1_EM18              EQU (0x00040000)        ; Event Mask on line 18
EXTI_EMR1_EM19              EQU (0x00080000)        ; Event Mask on line 19
EXTI_EMR1_EM20              EQU (0x00100000)        ; Event Mask on line 20
EXTI_EMR1_EM21              EQU (0x00200000)        ; Event Mask on line 21
EXTI_EMR1_EM22              EQU (0x00400000)        ; Event Mask on line 22
EXTI_EMR1_EM23              EQU (0x00800000)        ; Event Mask on line 23
EXTI_EMR1_EM24              EQU (0x01000000)        ; Event Mask on line 24
EXTI_EMR1_EM25              EQU (0x02000000)        ; Event Mask on line 25
EXTI_EMR1_EM26              EQU (0x04000000)        ; Event Mask on line 26
EXTI_EMR1_EM27              EQU (0x08000000)        ; Event Mask on line 27
EXTI_EMR1_EM28              EQU (0x10000000)        ; Event Mask on line 28
EXTI_EMR1_EM29              EQU (0x20000000)        ; Event Mask on line 29
EXTI_EMR1_EM30              EQU (0x40000000)        ; Event Mask on line 30
EXTI_EMR1_EM31              EQU (0x80000000)        ; Event Mask on line 31

; ******************  Bit definition for EXTI_RTSR1 register  *****************
EXTI_RTSR1_RT0              EQU (0x00000001)        ; Rising trigger event configuration bit of line 0
EXTI_RTSR1_RT1              EQU (0x00000002)        ; Rising trigger event configuration bit of line 1
EXTI_RTSR1_RT2              EQU (0x00000004)        ; Rising trigger event configuration bit of line 2
EXTI_RTSR1_RT3              EQU (0x00000008)        ; Rising trigger event configuration bit of line 3
EXTI_RTSR1_RT4              EQU (0x00000010)        ; Rising trigger event configuration bit of line 4
EXTI_RTSR1_RT5              EQU (0x00000020)        ; Rising trigger event configuration bit of line 5
EXTI_RTSR1_RT6              EQU (0x00000040)        ; Rising trigger event configuration bit of line 6
EXTI_RTSR1_RT7              EQU (0x00000080)        ; Rising trigger event configuration bit of line 7
EXTI_RTSR1_RT8              EQU (0x00000100)        ; Rising trigger event configuration bit of line 8
EXTI_RTSR1_RT9              EQU (0x00000200)        ; Rising trigger event configuration bit of line 9
EXTI_RTSR1_RT10             EQU (0x00000400)        ; Rising trigger event configuration bit of line 10
EXTI_RTSR1_RT11             EQU (0x00000800)        ; Rising trigger event configuration bit of line 11
EXTI_RTSR1_RT12             EQU (0x00001000)        ; Rising trigger event configuration bit of line 12
EXTI_RTSR1_RT13             EQU (0x00002000)        ; Rising trigger event configuration bit of line 13
EXTI_RTSR1_RT14             EQU (0x00004000)        ; Rising trigger event configuration bit of line 14
EXTI_RTSR1_RT15             EQU (0x00008000)        ; Rising trigger event configuration bit of line 15
EXTI_RTSR1_RT16             EQU (0x00010000)        ; Rising trigger event configuration bit of line 16
EXTI_RTSR1_RT18             EQU (0x00040000)        ; Rising trigger event configuration bit of line 18
EXTI_RTSR1_RT19             EQU (0x00080000)        ; Rising trigger event configuration bit of line 19
EXTI_RTSR1_RT20             EQU (0x00100000)        ; Rising trigger event configuration bit of line 20
EXTI_RTSR1_RT21             EQU (0x00200000)        ; Rising trigger event configuration bit of line 21
EXTI_RTSR1_RT22             EQU (0x00400000)        ; Rising trigger event configuration bit of line 22

