Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ******************  Bit definition for EXTI_FTSR1 register  *****************
EXTI_FTSR1_FT0              EQU (0x00000001)        ; Falling trigger event configuration bit of line 0
EXTI_FTSR1_FT1              EQU (0x00000002)        ; Falling trigger event configuration bit of line 1
EXTI_FTSR1_FT2              EQU (0x00000004)        ; Falling trigger event configuration bit of line 2
EXTI_FTSR1_FT3              EQU (0x00000008)        ; Falling trigger event configuration bit of line 3
EXTI_FTSR1_FT4              EQU (0x00000010)        ; Falling trigger event configuration bit of line 4
EXTI_FTSR1_FT5              EQU (0x00000020)        ; Falling trigger event configuration bit of line 5
EXTI_FTSR1_FT6              EQU (0x00000040)        ; Falling trigger event configuration bit of line 6
EXTI_FTSR1_FT7              EQU (0x00000080)        ; Falling trigger event configuration bit of line 7
EXTI_FTSR1_FT8              EQU (0x00000100)        ; Falling trigger event configuration bit of line 8
EXTI_FTSR1_FT9              EQU (0x00000200)        ; Falling trigger event configuration bit of line 9
EXTI_FTSR1_FT10             EQU (0x00000400)        ; Falling trigger event configuration bit of line 10
EXTI_FTSR1_FT11             EQU (0x00000800)        ; Falling trigger event configuration bit of line 11
EXTI_FTSR1_FT12             EQU (0x00001000)        ; Falling trigger event configuration bit of line 12
EXTI_FTSR1_FT13             EQU (0x00002000)        ; Falling trigger event configuration bit of line 13
EXTI_FTSR1_FT14             EQU (0x00004000)        ; Falling trigger event configuration bit of line 14
EXTI_FTSR1_FT15             EQU (0x00008000)        ; Falling trigger event configuration bit of line 15
EXTI_FTSR1_FT16             EQU (0x00010000)        ; Falling trigger event configuration bit of line 16
EXTI_FTSR1_FT18             EQU (0x00040000)        ; Falling trigger event configuration bit of line 18
EXTI_FTSR1_FT19             EQU (0x00080000)        ; Falling trigger event configuration bit of line 19
EXTI_FTSR1_FT20             EQU (0x00100000)        ; Falling trigger event configuration bit of line 20
EXTI_FTSR1_FT21             EQU (0x00200000)        ; Falling trigger event configuration bit of line 21
EXTI_FTSR1_FT22             EQU (0x00400000)        ; Falling trigger event configuration bit of line 22

; ******************  Bit definition for EXTI_SWIER1 register  ****************
EXTI_SWIER1_SWI0            EQU (0x00000001)        ; Software Interrupt on line 0
EXTI_SWIER1_SWI1            EQU (0x00000002)        ; Software Interrupt on line 1
EXTI_SWIER1_SWI2            EQU (0x00000004)        ; Software Interrupt on line 2
EXTI_SWIER1_SWI3            EQU (0x00000008)        ; Software Interrupt on line 3
EXTI_SWIER1_SWI4            EQU (0x00000010)        ; Software Interrupt on line 4
EXTI_SWIER1_SWI5            EQU (0x00000020)        ; Software Interrupt on line 5
EXTI_SWIER1_SWI6            EQU (0x00000040)        ; Software Interrupt on line 6
EXTI_SWIER1_SWI7            EQU (0x00000080)        ; Software Interrupt on line 7
EXTI_SWIER1_SWI8            EQU (0x00000100)        ; Software Interrupt on line 8
EXTI_SWIER1_SWI9            EQU (0x00000200)        ; Software Interrupt on line 9
EXTI_SWIER1_SWI10           EQU (0x00000400)        ; Software Interrupt on line 10
EXTI_SWIER1_SWI11           EQU (0x00000800)        ; Software Interrupt on line 11
EXTI_SWIER1_SWI12           EQU (0x00001000)        ; Software Interrupt on line 12
EXTI_SWIER1_SWI13           EQU (0x00002000)        ; Software Interrupt on line 13
EXTI_SWIER1_SWI14           EQU (0x00004000)        ; Software Interrupt on line 14
EXTI_SWIER1_SWI15           EQU (0x00008000)        ; Software Interrupt on line 15
EXTI_SWIER1_SWI16           EQU (0x00010000)        ; Software Interrupt on line 16
EXTI_SWIER1_SWI18           EQU (0x00040000)        ; Software Interrupt on line 18
EXTI_SWIER1_SWI19           EQU (0x00080000)        ; Software Interrupt on line 19
EXTI_SWIER1_SWI20           EQU (0x00100000)        ; Software Interrupt on line 20
EXTI_SWIER1_SWI21           EQU (0x00200000)        ; Software Interrupt on line 21
EXTI_SWIER1_SWI22           EQU (0x00400000)        ; Software Interrupt on line 22

; *******************  Bit definition for EXTI_PR1 register  ******************
EXTI_PR1_PIF0               EQU (0x00000001)        ; Pending bit for line 0
EXTI_PR1_PIF1               EQU (0x00000002)        ; Pending bit for line 1
EXTI_PR1_PIF2               EQU (0x00000004)        ; Pending bit for line 2
EXTI_PR1_PIF3               EQU (0x00000008)        ; Pending bit for line 3
EXTI_PR1_PIF4               EQU (0x00000010)        ; Pending bit for line 4
EXTI_PR1_PIF5               EQU (0x00000020)        ; Pending bit for line 5
EXTI_PR1_PIF6               EQU (0x00000040)        ; Pending bit for line 6
EXTI_PR1_PIF7               EQU (0x00000080)        ; Pending bit for line 7
EXTI_PR1_PIF8               EQU (0x00000100)        ; Pending bit for line 8
EXTI_PR1_PIF9               EQU (0x00000200)        ; Pending bit for line 9
EXTI_PR1_PIF10              EQU (0x00000400)        ; Pending bit for line 10
EXTI_PR1_PIF11              EQU (0x00000800)        ; Pending bit for line 11
EXTI_PR1_PIF12              EQU (0x00001000)        ; Pending bit for line 12
EXTI_PR1_PIF13              EQU (0x00002000)        ; Pending bit for line 13
EXTI_PR1_PIF14              EQU (0x00004000)        ; Pending bit for line 14
EXTI_PR1_PIF15              EQU (0x00008000)        ; Pending bit for line 15
EXTI_PR1_PIF16              EQU (0x00010000)        ; Pending bit for line 16
EXTI_PR1_PIF18              EQU (0x00040000)        ; Pending bit for line 18
EXTI_PR1_PIF19              EQU (0x00080000)        ; Pending bit for line 19
EXTI_PR1_PIF20              EQU (0x00100000)        ; Pending bit for line 20
EXTI_PR1_PIF21              EQU (0x00200000)        ; Pending bit for line 21
EXTI_PR1_PIF22              EQU (0x00400000)        ; Pending bit for line 22

