Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *******************  Bit definition for EXTI_IMR2 register  *****************
EXTI_IMR2_IM32              EQU (0x00000001)        ; Interrupt Mask on line 32
EXTI_IMR2_IM33              EQU (0x00000002)        ; Interrupt Mask on line 33
EXTI_IMR2_IM34              EQU (0x00000004)        ; Interrupt Mask on line 34
EXTI_IMR2_IM35              EQU (0x00000008)        ; Interrupt Mask on line 35
EXTI_IMR2_IM36              EQU (0x00000010)        ; Interrupt Mask on line 36
EXTI_IMR2_IM37              EQU (0x00000020)        ; Interrupt Mask on line 37
EXTI_IMR2_IM38              EQU (0x00000040)        ; Interrupt Mask on line 38
EXTI_IMR2_IM39              EQU (0x00000080)        ; Interrupt Mask on line 39

; *******************  Bit definition for EXTI_EMR2 register  *****************
EXTI_EMR2_EM32              EQU (0x00000001)        ; Event Mask on line 32
EXTI_EMR2_EM33              EQU (0x00000002)        ; Event Mask on line 33
EXTI_EMR2_EM34              EQU (0x00000004)        ; Event Mask on line 34
EXTI_EMR2_EM35              EQU (0x00000008)        ; Event Mask on line 35
EXTI_EMR2_EM36              EQU (0x00000010)        ; Event Mask on line 36
EXTI_EMR2_EM37              EQU (0x00000020)        ; Event Mask on line 37
EXTI_EMR2_EM38              EQU (0x00000040)        ; Event Mask on line 38
EXTI_EMR2_EM39              EQU (0x00000080)        ; Event Mask on line 39

; ******************  Bit definition for EXTI_RTSR2 register  *****************
EXTI_RTSR2_RT35             EQU (0x00000008)        ; Rising trigger event configuration bit of line 35
EXTI_RTSR2_RT36             EQU (0x00000010)        ; Rising trigger event configuration bit of line 36
EXTI_RTSR2_RT37             EQU (0x00000020)        ; Rising trigger event configuration bit of line 37
EXTI_RTSR2_RT38             EQU (0x00000040)        ; Rising trigger event configuration bit of line 38

; ******************  Bit definition for EXTI_FTSR2 register  *****************
EXTI_FTSR2_FT35             EQU (0x00000008)        ; Falling trigger event configuration bit of line 35
EXTI_FTSR2_FT36             EQU (0x00000010)        ; Falling trigger event configuration bit of line 36
EXTI_FTSR2_FT37             EQU (0x00000020)        ; Falling trigger event configuration bit of line 37
EXTI_FTSR2_FT38             EQU (0x00000040)        ; Falling trigger event configuration bit of line 38

; ******************  Bit definition for EXTI_SWIER2 register  ****************
EXTI_SWIER2_SWI35           EQU (0x00000008)        ; Software Interrupt on line 35
EXTI_SWIER2_SWI36           EQU (0x00000010)        ; Software Interrupt on line 36
EXTI_SWIER2_SWI37           EQU (0x00000020)        ; Software Interrupt on line 37
EXTI_SWIER2_SWI38           EQU (0x00000040)        ; Software Interrupt on line 38

; *******************  Bit definition for EXTI_PR2 register  ******************
EXTI_PR2_PIF35               EQU (0x00000008)        ; Pending bit for line 35
EXTI_PR2_PIF36               EQU (0x00000010)        ; Pending bit for line 36
EXTI_PR2_PIF37               EQU (0x00000020)        ; Pending bit for line 37
EXTI_PR2_PIF38               EQU (0x00000040)        ; Pending bit for line 38


; *****************************************************************************
;
;                                    FLASH
;
; *****************************************************************************
; *******************  Bits definition for FLASH_ACR register  ****************
FLASH_ACR_LATENCY            EQU (0x00000007)
FLASH_ACR_LATENCY_0WS        EQU (0x00000000)
FLASH_ACR_LATENCY_1WS        EQU (0x00000001)
FLASH_ACR_LATENCY_2WS        EQU (0x00000002)
FLASH_ACR_LATENCY_3WS        EQU (0x00000003)
FLASH_ACR_LATENCY_4WS        EQU (0x00000004)
FLASH_ACR_PRFTEN             EQU (0x00000100)
FLASH_ACR_ICEN               EQU (0x00000200)
FLASH_ACR_DCEN               EQU (0x00000400)
FLASH_ACR_ICRST              EQU (0x00000800)
FLASH_ACR_DCRST              EQU (0x00001000)
FLASH_ACR_RUN_PD             EQU (0x00002000)   ; Flash power down mode during run
FLASH_ACR_SLEEP_PD           EQU (0x00004000)   ; Flash power down mode during sleep

; *******************  Bits definition for FLASH_SR register  *****************
FLASH_SR_EOP                 EQU (0x00000001)
FLASH_SR_OPERR               EQU (0x00000002)
FLASH_SR_PROGERR             EQU (0x00000008)
FLASH_SR_WRPERR              EQU (0x00000010)
FLASH_SR_PGAERR              EQU (0x00000020)
FLASH_SR_SIZERR              EQU (0x00000040)
FLASH_SR_PGSERR              EQU (0x00000080)
FLASH_SR_MISERR              EQU (0x00000100)
FLASH_SR_FASTERR             EQU (0x00000200)
FLASH_SR_RDERR               EQU (0x00004000)
FLASH_SR_OPTVERR             EQU (0x00008000)
FLASH_SR_BSY                 EQU (0x00010000)

; *******************  Bits definition for FLASH_CR register  *****************
FLASH_CR_PG                  EQU (0x00000001)
FLASH_CR_PER                 EQU (0x00000002)
FLASH_CR_MER1                EQU (0x00000004)
FLASH_CR_PNB                 EQU (0x000007F8)
FLASH_CR_BKER                EQU (0x00000800)
FLASH_CR_MER2                EQU (0x00008000)
FLASH_CR_STRT                EQU (0x00010000)
FLASH_CR_OPTSTRT             EQU (0x00020000)
FLASH_CR_FSTPG               EQU (0x00040000)
FLASH_CR_EOPIE               EQU (0x01000000)
FLASH_CR_ERRIE               EQU (0x02000000)
FLASH_CR_RDERRIE             EQU (0x04000000)
FLASH_CR_OBL_LAUNCH          EQU (0x08000000)
FLASH_CR_OPTLOCK             EQU (0x40000000)
FLASH_CR_LOCK                EQU (0x80000000)

; *******************  Bits definition for FLASH_ECCR register  **************
FLASH_ECCR_ADDR_ECC         EQU (0x0007FFFF)
FLASH_ECCR_BK_ECC           EQU (0x00080000)
FLASH_ECCR_SYSF_ECC         EQU (0x00100000)
FLASH_ECCR_ECCIE            EQU (0x01000000)
FLASH_ECCR_ECCC             EQU (0x40000000)
FLASH_ECCR_ECCD             EQU (0x80000000)

