Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *******************  Bits definition for FLASH_OPTR register  **************
FLASH_OPTR_RDP              EQU (0x000000FF)
FLASH_OPTR_BOR_LEV          EQU (0x00000700)
FLASH_OPTR_BOR_LEV_0        EQU (0x00000000)
FLASH_OPTR_BOR_LEV_1        EQU (0x00000100)
FLASH_OPTR_BOR_LEV_2        EQU (0x00000200)
FLASH_OPTR_BOR_LEV_3        EQU (0x00000300)
FLASH_OPTR_BOR_LEV_4        EQU (0x00000400)
FLASH_OPTR_nRST_STOP        EQU (0x00001000)
FLASH_OPTR_nRST_STDBY       EQU (0x00002000)
FLASH_OPTR_nRST_SHDW        EQU (0x00004000)
FLASH_OPTR_IWDG_SW          EQU (0x00010000)
FLASH_OPTR_IWDG_STOP        EQU (0x00020000)
FLASH_OPTR_IWDG_STDBY       EQU (0x00040000)
FLASH_OPTR_WWDG_SW          EQU (0x00080000)
FLASH_OPTR_BFB2             EQU (0x00100000)
FLASH_OPTR_DUALBANK         EQU (0x00200000)
FLASH_OPTR_nBOOT1           EQU (0x00800000)
FLASH_OPTR_SRAM2_PE         EQU (0x01000000)
FLASH_OPTR_SRAM2_RST        EQU (0x02000000)

; ******************  Bits definition for FLASH_PCROP1SR register  *********
FLASH_PCROP1SR_PCROP1_STRT  EQU (0x0000FFFF)

; ******************  Bits definition for FLASH_PCROP1ER register  **********
FLASH_PCROP1ER_PCROP1_END   EQU (0x0000FFFF)
FLASH_PCROP1ER_PCROP_RDP    EQU (0x80000000)

; ******************  Bits definition for FLASH_WRP1AR register  **************
FLASH_WRP1AR_WRP1A_STRT     EQU (0x000000FF)
FLASH_WRP1AR_WRP1A_END      EQU (0x00FF0000)

; ******************  Bits definition for FLASH_WRPB1R register  **************
FLASH_WRP1BR_WRP1B_STRT     EQU (0x000000FF)
FLASH_WRP1BR_WRP1B_END      EQU (0x00FF0000)

; ******************  Bits definition for FLASH_PCROP2SR register  *********
FLASH_PCROP2SR_PCROP2_STRT  EQU (0x0000FFFF)

; ******************  Bits definition for FLASH_PCROP2ER register  **********
FLASH_PCROP2ER_PCROP2_END  EQU (0x0000FFFF)

; ******************  Bits definition for FLASH_WRP2AR register  **************
FLASH_WRP2AR_WRP2A_STRT     EQU (0x000000FF)
FLASH_WRP2AR_WRP2A_END      EQU (0x00FF0000)

; ******************  Bits definition for FLASH_WRP2BR register  **************
FLASH_WRP2BR_WRP2B_STRT     EQU (0x000000FF)
FLASH_WRP2BR_WRP2B_END      EQU (0x00FF0000)


; *****************************************************************************
;
;                          Flexible Memory Controller
;
; *****************************************************************************
; ******************  Bit definition for FMC_BCR1 register  ******************
FMC_BCR1_CCLKEN            EQU (0x00100000)        ;Continous clock enable
FMC_BCR1_WFDIS             EQU (0x00200000)        ;Write FIFO Disable

; ******************  Bit definition for FMC_BCRx registers (xEQU 1..4)  ********
FMC_BCRx_MBKEN             EQU (0x00000001)        ;Memory bank enable bit
FMC_BCRx_MUXEN             EQU (0x00000002)        ;Address/data multiplexing enable bit

FMC_BCRx_MTYP              EQU (0x0000000C)        ;MTYP[1:0] bits (Memory type)
FMC_BCRx_MTYP_0            EQU (0x00000004)        ;Bit 0
FMC_BCRx_MTYP_1            EQU (0x00000008)        ;Bit 1

FMC_BCRx_MWID              EQU (0x00000030)        ;MWID[1:0] bits (Memory data bus width)
FMC_BCRx_MWID_0            EQU (0x00000010)        ;Bit 0
FMC_BCRx_MWID_1            EQU (0x00000020)        ;Bit 1

FMC_BCRx_FACCEN            EQU (0x00000040)        ;Flash access enable
FMC_BCRx_BURSTEN           EQU (0x00000100)        ;Burst enable bit
FMC_BCRx_WAITPOL           EQU (0x00000200)        ;Wait signal polarity bit
FMC_BCRx_WAITCFG           EQU (0x00000800)        ;Wait timing configuration
FMC_BCRx_WREN              EQU (0x00001000)        ;Write enable bit
FMC_BCRx_WAITEN            EQU (0x00002000)        ;Wait enable bit
FMC_BCRx_EXTMOD            EQU (0x00004000)        ;Extended mode enable
FMC_BCRx_ASYNCWAIT         EQU (0x00008000)        ;Asynchronous wait

FMC_BCRx_CPSIZE            EQU (0x00070000)        ;CRAM page size
FMC_BCRx_CPSIZE_0          EQU (0x00010000)        ;Bit 0
FMC_BCRx_CPSIZE_1          EQU (0x00020000)        ;Bit 1
FMC_BCRx_CPSIZE_2          EQU (0x00040000)        ;Bit 1

FMC_BCRx_CBURSTRW          EQU (0x00080000)        ;Write burst enable

; ******************  Bit definition for FMC_BTRx registers (xEQU 1..4)  ********
FMC_BTRx_ADDSET            EQU (0x0000000F)        ;ADDSET[3:0] bits (Address setup phase duration)
FMC_BTRx_ADDSET_0          EQU (0x00000001)        ;Bit 0
FMC_BTRx_ADDSET_1          EQU (0x00000002)        ;Bit 1
FMC_BTRx_ADDSET_2          EQU (0x00000004)        ;Bit 2
FMC_BTRx_ADDSET_3          EQU (0x00000008)        ;Bit 3

FMC_BTRx_ADDHLD            EQU (0x000000F0)        ;ADDHLD[3:0] bits (Address-hold phase duration)
FMC_BTRx_ADDHLD_0          EQU (0x00000010)        ;Bit 0
FMC_BTRx_ADDHLD_1          EQU (0x00000020)        ;Bit 1
FMC_BTRx_ADDHLD_2          EQU (0x00000040)        ;Bit 2
FMC_BTRx_ADDHLD_3          EQU (0x00000080)        ;Bit 3

FMC_BTRx_DATAST            EQU (0x0000FF00)        ;DATAST [3:0] bits (Data-phase duration)
FMC_BTRx_DATAST_0          EQU (0x00000100)        ;Bit 0
FMC_BTRx_DATAST_1          EQU (0x00000200)        ;Bit 1
FMC_BTRx_DATAST_2          EQU (0x00000400)        ;Bit 2
FMC_BTRx_DATAST_3          EQU (0x00000800)        ;Bit 3
FMC_BTRx_DATAST_4          EQU (0x00001000)        ;Bit 4
FMC_BTRx_DATAST_5          EQU (0x00002000)        ;Bit 5
FMC_BTRx_DATAST_6          EQU (0x00004000)        ;Bit 6
FMC_BTRx_DATAST_7          EQU (0x00008000)        ;Bit 7

FMC_BTRx_BUSTURN           EQU (0x000F0000)        ;BUSTURN[3:0] bits (Bus turnaround phase duration)
FMC_BTRx_BUSTURN_0         EQU (0x00010000)        ;Bit 0
FMC_BTRx_BUSTURN_1         EQU (0x00020000)        ;Bit 1
FMC_BTRx_BUSTURN_2         EQU (0x00040000)        ;Bit 2
FMC_BTRx_BUSTURN_3         EQU (0x00080000)        ;Bit 3

FMC_BTRx_CLKDIV            EQU (0x00F00000)        ;CLKDIV[3:0] bits (Clock divide ratio)
FMC_BTRx_CLKDIV_0          EQU (0x00100000)        ;Bit 0
FMC_BTRx_CLKDIV_1          EQU (0x00200000)        ;Bit 1
FMC_BTRx_CLKDIV_2          EQU (0x00400000)        ;Bit 2
FMC_BTRx_CLKDIV_3          EQU (0x00800000)        ;Bit 3

