Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
FMC_BTRx_DATLAT            EQU (0x0F000000)        ;DATLA[3:0] bits (Data latency)
FMC_BTRx_DATLAT_0          EQU (0x01000000)        ;Bit 0
FMC_BTRx_DATLAT_1          EQU (0x02000000)        ;Bit 1
FMC_BTRx_DATLAT_2          EQU (0x04000000)        ;Bit 2
FMC_BTRx_DATLAT_3          EQU (0x08000000)        ;Bit 3

FMC_BTRx_ACCMOD            EQU (0x30000000)        ;ACCMOD[1:0] bits (Access mode)
FMC_BTRx_ACCMOD_0          EQU (0x10000000)        ;Bit 0
FMC_BTRx_ACCMOD_1          EQU (0x20000000)        ;Bit 1

; ******************  Bit definition for FMC_BWTRx registers (xEQU 1..4)  ********
FMC_BWTRx_ADDSET           EQU (0x0000000F)        ;ADDSET[3:0] bits (Address setup phase duration)
FMC_BWTRx_ADDSET_0         EQU (0x00000001)        ;Bit 0
FMC_BWTRx_ADDSET_1         EQU (0x00000002)        ;Bit 1
FMC_BWTRx_ADDSET_2         EQU (0x00000004)        ;Bit 2
FMC_BWTRx_ADDSET_3         EQU (0x00000008)        ;Bit 3

FMC_BWTRx_ADDHLD           EQU (0x000000F0)        ;ADDHLD[3:0] bits (Address-hold phase duration)
FMC_BWTRx_ADDHLD_0         EQU (0x00000010)        ;Bit 0
FMC_BWTRx_ADDHLD_1         EQU (0x00000020)        ;Bit 1
FMC_BWTRx_ADDHLD_2         EQU (0x00000040)        ;Bit 2
FMC_BWTRx_ADDHLD_3         EQU (0x00000080)        ;Bit 3

FMC_BWTRx_DATAST           EQU (0x0000FF00)        ;DATAST [3:0] bits (Data-phase duration)
FMC_BWTRx_DATAST_0         EQU (0x00000100)        ;Bit 0
FMC_BWTRx_DATAST_1         EQU (0x00000200)        ;Bit 1
FMC_BWTRx_DATAST_2         EQU (0x00000400)        ;Bit 2
FMC_BWTRx_DATAST_3         EQU (0x00000800)        ;Bit 3
FMC_BWTRx_DATAST_4         EQU (0x00001000)        ;Bit 4
FMC_BWTRx_DATAST_5         EQU (0x00002000)        ;Bit 5
FMC_BWTRx_DATAST_6         EQU (0x00004000)        ;Bit 6
FMC_BWTRx_DATAST_7         EQU (0x00008000)        ;Bit 7

FMC_BWTRx_ACCMOD           EQU (0x30000000)        ;ACCMOD[1:0] bits (Access mode)
FMC_BWTRx_ACCMOD_0         EQU (0x10000000)        ;Bit 0
FMC_BWTRx_ACCMOD_1         EQU (0x20000000)        ;Bit 1

; ******************  Bit definition for FMC_PCR register  *******************
FMC_PCR_PWAITEN            EQU (0x00000002)        ;Wait feature enable bit
FMC_PCR_PBKEN              EQU (0x00000004)        ;NAND Flash memory bank enable bit
FMC_PCR_PTYP               EQU (0x00000008)        ;Memory type

FMC_PCR_PWID               EQU (0x00000030)        ;PWID[1:0] bits (NAND Flash databus width)
FMC_PCR_PWID_0             EQU (0x00000010)        ;Bit 0
FMC_PCR_PWID_1             EQU (0x00000020)        ;Bit 1

FMC_PCR_ECCEN              EQU (0x00000040)        ;ECC computation logic enable bit

FMC_PCR_TCLR               EQU (0x00001E00)        ;TCLR[3:0] bits (CLE to RE delay)
FMC_PCR_TCLR_0             EQU (0x00000200)        ;Bit 0
FMC_PCR_TCLR_1             EQU (0x00000400)        ;Bit 1
FMC_PCR_TCLR_2             EQU (0x00000800)        ;Bit 2
FMC_PCR_TCLR_3             EQU (0x00001000)        ;Bit 3

FMC_PCR_TAR                EQU (0x0001E000)        ;TAR[3:0] bits (ALE to RE delay)
FMC_PCR_TAR_0              EQU (0x00002000)        ;Bit 0
FMC_PCR_TAR_1              EQU (0x00004000)        ;Bit 1
FMC_PCR_TAR_2              EQU (0x00008000)        ;Bit 2
FMC_PCR_TAR_3              EQU (0x00010000)        ;Bit 3

FMC_PCR_ECCPS              EQU (0x000E0000)        ;ECCPS[1:0] bits (ECC page size)
FMC_PCR_ECCPS_0            EQU (0x00020000)        ;Bit 0
FMC_PCR_ECCPS_1            EQU (0x00040000)        ;Bit 1
FMC_PCR_ECCPS_2            EQU (0x00080000)        ;Bit 2

; *******************  Bit definition for FMC_SR register  *******************
FMC_SR_IRS                 EQU (0x00000001)        ;Interrupt Rising Edge status
FMC_SR_ILS                 EQU (0x00000002)        ;Interrupt Level status
FMC_SR_IFS                 EQU (0x00000004)        ;Interrupt Falling Edge status
FMC_SR_IREN                EQU (0x00000008)        ;Interrupt Rising Edge detection Enable bit
FMC_SR_ILEN                EQU (0x00000010)        ;Interrupt Level detection Enable bit
FMC_SR_IFEN                EQU (0x00000020)        ;Interrupt Falling Edge detection Enable bit
FMC_SR_FEMPT               EQU (0x00000040)        ;FIFO empty

; ******************  Bit definition for FMC_PMEM register  *****************
FMC_PMEM_MEMSET            EQU (0x000000FF)        ;MEMSET[7:0] bits (Common memory setup time)
FMC_PMEM_MEMSET_0          EQU (0x00000001)        ;Bit 0
FMC_PMEM_MEMSET_1          EQU (0x00000002)        ;Bit 1
FMC_PMEM_MEMSET_2          EQU (0x00000004)        ;Bit 2
FMC_PMEM_MEMSET_3          EQU (0x00000008)        ;Bit 3
FMC_PMEM_MEMSET_4          EQU (0x00000010)        ;Bit 4
FMC_PMEM_MEMSET_5          EQU (0x00000020)        ;Bit 5
FMC_PMEM_MEMSET_6          EQU (0x00000040)        ;Bit 6
FMC_PMEM_MEMSET_7          EQU (0x00000080)        ;Bit 7

FMC_PMEM_MEMWAIT           EQU (0x0000FF00)        ;MEMWAIT[7:0] bits (Common memory wait time)
FMC_PMEM_MEMWAIT_0         EQU (0x00000100)        ;Bit 0
FMC_PMEM_MEMWAIT_1         EQU (0x00000200)        ;Bit 1
FMC_PMEM_MEMWAIT_2         EQU (0x00000400)        ;Bit 2
FMC_PMEM_MEMWAIT_3         EQU (0x00000800)        ;Bit 3
FMC_PMEM_MEMWAIT_4         EQU (0x00001000)        ;Bit 4
FMC_PMEM_MEMWAIT_5         EQU (0x00002000)        ;Bit 5
FMC_PMEM_MEMWAIT_6         EQU (0x00004000)        ;Bit 6
FMC_PMEM_MEMWAIT_7         EQU (0x00008000)        ;Bit 7

FMC_PMEM_MEMHOLD           EQU (0x00FF0000)        ;MEMHOLD[7:0] bits (Common memory hold time)
FMC_PMEM_MEMHOLD_0         EQU (0x00010000)        ;Bit 0
FMC_PMEM_MEMHOLD_1         EQU (0x00020000)        ;Bit 1
FMC_PMEM_MEMHOLD_2         EQU (0x00040000)        ;Bit 2
FMC_PMEM_MEMHOLD_3         EQU (0x00080000)        ;Bit 3
FMC_PMEM_MEMHOLD_4         EQU (0x00100000)        ;Bit 4
FMC_PMEM_MEMHOLD_5         EQU (0x00200000)        ;Bit 5
FMC_PMEM_MEMHOLD_6         EQU (0x00400000)        ;Bit 6
FMC_PMEM_MEMHOLD_7         EQU (0x00800000)        ;Bit 7

