Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
FMC_PMEM_MEMHIZ            EQU (0xFF000000)        ;MEMHIZ[7:0] bits (Common memory databus HiZ time)
FMC_PMEM_MEMHIZ_0          EQU (0x01000000)        ;Bit 0
FMC_PMEM_MEMHIZ_1          EQU (0x02000000)        ;Bit 1
FMC_PMEM_MEMHIZ_2          EQU (0x04000000)        ;Bit 2
FMC_PMEM_MEMHIZ_3          EQU (0x08000000)        ;Bit 3
FMC_PMEM_MEMHIZ_4          EQU (0x10000000)        ;Bit 4
FMC_PMEM_MEMHIZ_5          EQU (0x20000000)        ;Bit 5
FMC_PMEM_MEMHIZ_6          EQU (0x40000000)        ;Bit 6
FMC_PMEM_MEMHIZ_7          EQU (0x80000000)        ;Bit 7

; ******************  Bit definition for FMC_PATT register  ******************
FMC_PATT_ATTSET            EQU (0x000000FF)        ;ATTSET[7:0] bits (Attribute memory setup time)
FMC_PATT_ATTSET_0          EQU (0x00000001)        ;Bit 0
FMC_PATT_ATTSET_1          EQU (0x00000002)        ;Bit 1
FMC_PATT_ATTSET_2          EQU (0x00000004)        ;Bit 2
FMC_PATT_ATTSET_3          EQU (0x00000008)        ;Bit 3
FMC_PATT_ATTSET_4          EQU (0x00000010)        ;Bit 4
FMC_PATT_ATTSET_5          EQU (0x00000020)        ;Bit 5
FMC_PATT_ATTSET_6          EQU (0x00000040)        ;Bit 6
FMC_PATT_ATTSET_7          EQU (0x00000080)        ;Bit 7

FMC_PATT_ATTWAIT           EQU (0x0000FF00)        ;ATTWAIT[7:0] bits (Attribute memory wait time)
FMC_PATT_ATTWAIT_0         EQU (0x00000100)        ;Bit 0
FMC_PATT_ATTWAIT_1         EQU (0x00000200)        ;Bit 1
FMC_PATT_ATTWAIT_2         EQU (0x00000400)        ;Bit 2
FMC_PATT_ATTWAIT_3         EQU (0x00000800)        ;Bit 3
FMC_PATT_ATTWAIT_4         EQU (0x00001000)        ;Bit 4
FMC_PATT_ATTWAIT_5         EQU (0x00002000)        ;Bit 5
FMC_PATT_ATTWAIT_6         EQU (0x00004000)        ;Bit 6
FMC_PATT_ATTWAIT_7         EQU (0x00008000)        ;Bit 7

FMC_PATT_ATTHOLD           EQU (0x00FF0000)        ;ATTHOLD[7:0] bits (Attribute memory hold time)
FMC_PATT_ATTHOLD_0         EQU (0x00010000)        ;Bit 0
FMC_PATT_ATTHOLD_1         EQU (0x00020000)        ;Bit 1
FMC_PATT_ATTHOLD_2         EQU (0x00040000)        ;Bit 2
FMC_PATT_ATTHOLD_3         EQU (0x00080000)        ;Bit 3
FMC_PATT_ATTHOLD_4         EQU (0x00100000)        ;Bit 4
FMC_PATT_ATTHOLD_5         EQU (0x00200000)        ;Bit 5
FMC_PATT_ATTHOLD_6         EQU (0x00400000)        ;Bit 6
FMC_PATT_ATTHOLD_7         EQU (0x00800000)        ;Bit 7

FMC_PATT_ATTHIZ            EQU (0xFF000000)        ;ATTHIZ[7:0] bits (Attribute memory databus HiZ time)
FMC_PATT_ATTHIZ_0          EQU (0x01000000)        ;Bit 0
FMC_PATT_ATTHIZ_1          EQU (0x02000000)        ;Bit 1
FMC_PATT_ATTHIZ_2          EQU (0x04000000)        ;Bit 2
FMC_PATT_ATTHIZ_3          EQU (0x08000000)        ;Bit 3
FMC_PATT_ATTHIZ_4          EQU (0x10000000)        ;Bit 4
FMC_PATT_ATTHIZ_5          EQU (0x20000000)        ;Bit 5
FMC_PATT_ATTHIZ_6          EQU (0x40000000)        ;Bit 6
FMC_PATT_ATTHIZ_7            EQU (0x80000000)        ;Bit 7

; ******************  Bit definition for FMC_ECCR register  ******************
FMC_ECCR_ECC               EQU (0xFFFFFFFF)        ;ECC result

; *****************************************************************************
;
;                            General Purpose I/O
;
; *****************************************************************************
; ******************  Bits definition for GPIO_MODER register  ****************
GPIO_MODER_MODER0           EQU (0x00000003)
GPIO_MODER_MODER0_0         EQU (0x00000001)
GPIO_MODER_MODER0_1         EQU (0x00000002)
GPIO_MODER_MODER1           EQU (0x0000000C)
GPIO_MODER_MODER1_0         EQU (0x00000004)
GPIO_MODER_MODER1_1         EQU (0x00000008)
GPIO_MODER_MODER2           EQU (0x00000030)
GPIO_MODER_MODER2_0         EQU (0x00000010)
GPIO_MODER_MODER2_1         EQU (0x00000020)
GPIO_MODER_MODER3           EQU (0x000000C0)
GPIO_MODER_MODER3_0         EQU (0x00000040)
GPIO_MODER_MODER3_1         EQU (0x00000080)
GPIO_MODER_MODER4           EQU (0x00000300)
GPIO_MODER_MODER4_0         EQU (0x00000100)
GPIO_MODER_MODER4_1         EQU (0x00000200)
GPIO_MODER_MODER5           EQU (0x00000C00)
GPIO_MODER_MODER5_0         EQU (0x00000400)
GPIO_MODER_MODER5_1         EQU (0x00000800)
GPIO_MODER_MODER6           EQU (0x00003000)
GPIO_MODER_MODER6_0         EQU (0x00001000)
GPIO_MODER_MODER6_1         EQU (0x00002000)
GPIO_MODER_MODER7           EQU (0x0000C000)
GPIO_MODER_MODER7_0         EQU (0x00004000)
GPIO_MODER_MODER7_1         EQU (0x00008000)
GPIO_MODER_MODER8           EQU (0x00030000)
GPIO_MODER_MODER8_0         EQU (0x00010000)
GPIO_MODER_MODER8_1         EQU (0x00020000)
GPIO_MODER_MODER9           EQU (0x000C0000)
GPIO_MODER_MODER9_0         EQU (0x00040000)
GPIO_MODER_MODER9_1         EQU (0x00080000)
GPIO_MODER_MODER10          EQU (0x00300000)
GPIO_MODER_MODER10_0        EQU (0x00100000)
GPIO_MODER_MODER10_1        EQU (0x00200000)
GPIO_MODER_MODER11          EQU (0x00C00000)
GPIO_MODER_MODER11_0        EQU (0x00400000)
GPIO_MODER_MODER11_1        EQU (0x00800000)
GPIO_MODER_MODER12          EQU (0x03000000)
GPIO_MODER_MODER12_0        EQU (0x01000000)
GPIO_MODER_MODER12_1        EQU (0x02000000)
GPIO_MODER_MODER13          EQU (0x0C000000)
GPIO_MODER_MODER13_0        EQU (0x04000000)
GPIO_MODER_MODER13_1        EQU (0x08000000)
GPIO_MODER_MODER14          EQU (0x30000000)
GPIO_MODER_MODER14_0        EQU (0x10000000)
GPIO_MODER_MODER14_1        EQU (0x20000000)
GPIO_MODER_MODER15          EQU (0xC0000000)
GPIO_MODER_MODER15_0        EQU (0x40000000)
GPIO_MODER_MODER15_1        EQU (0x80000000)

; ******************  Bits definition for GPIO_OTYPER register  ***************
GPIO_OTYPER_OT_0            EQU (0x00000001)
GPIO_OTYPER_OT_1            EQU (0x00000002)
GPIO_OTYPER_OT_2            EQU (0x00000004)
GPIO_OTYPER_OT_3            EQU (0x00000008)
GPIO_OTYPER_OT_4            EQU (0x00000010)
GPIO_OTYPER_OT_5            EQU (0x00000020)
GPIO_OTYPER_OT_6            EQU (0x00000040)
GPIO_OTYPER_OT_7            EQU (0x00000080)
GPIO_OTYPER_OT_8            EQU (0x00000100)
GPIO_OTYPER_OT_9            EQU (0x00000200)
GPIO_OTYPER_OT_10           EQU (0x00000400)
GPIO_OTYPER_OT_11           EQU (0x00000800)
GPIO_OTYPER_OT_12           EQU (0x00001000)
GPIO_OTYPER_OT_13           EQU (0x00002000)
GPIO_OTYPER_OT_14           EQU (0x00004000)
GPIO_OTYPER_OT_15           EQU (0x00008000)

; ******************  Bits definition for GPIO_OSPEEDR register  **************
GPIO_OSPEEDER_OSPEEDR0      EQU (0x00000003)
GPIO_OSPEEDER_OSPEEDR0_0    EQU (0x00000001)
GPIO_OSPEEDER_OSPEEDR0_1    EQU (0x00000002)
GPIO_OSPEEDER_OSPEEDR1      EQU (0x0000000C)
GPIO_OSPEEDER_OSPEEDR1_0    EQU (0x00000004)
GPIO_OSPEEDER_OSPEEDR1_1    EQU (0x00000008)
GPIO_OSPEEDER_OSPEEDR2      EQU (0x00000030)
GPIO_OSPEEDER_OSPEEDR2_0    EQU (0x00000010)
GPIO_OSPEEDER_OSPEEDR2_1    EQU (0x00000020)
GPIO_OSPEEDER_OSPEEDR3      EQU (0x000000C0)
GPIO_OSPEEDER_OSPEEDR3_0    EQU (0x00000040)
GPIO_OSPEEDER_OSPEEDR3_1    EQU (0x00000080)
GPIO_OSPEEDER_OSPEEDR4      EQU (0x00000300)
GPIO_OSPEEDER_OSPEEDR4_0    EQU (0x00000100)
GPIO_OSPEEDER_OSPEEDR4_1    EQU (0x00000200)
GPIO_OSPEEDER_OSPEEDR5      EQU (0x00000C00)
GPIO_OSPEEDER_OSPEEDR5_0    EQU (0x00000400)
GPIO_OSPEEDER_OSPEEDR5_1    EQU (0x00000800)
GPIO_OSPEEDER_OSPEEDR6      EQU (0x00003000)
GPIO_OSPEEDER_OSPEEDR6_0    EQU (0x00001000)
GPIO_OSPEEDER_OSPEEDR6_1    EQU (0x00002000)
GPIO_OSPEEDER_OSPEEDR7      EQU (0x0000C000)
GPIO_OSPEEDER_OSPEEDR7_0    EQU (0x00004000)
GPIO_OSPEEDER_OSPEEDR7_1    EQU (0x00008000)
GPIO_OSPEEDER_OSPEEDR8      EQU (0x00030000)
GPIO_OSPEEDER_OSPEEDR8_0    EQU (0x00010000)
GPIO_OSPEEDER_OSPEEDR8_1    EQU (0x00020000)
GPIO_OSPEEDER_OSPEEDR9      EQU (0x000C0000)
GPIO_OSPEEDER_OSPEEDR9_0    EQU (0x00040000)
GPIO_OSPEEDER_OSPEEDR9_1    EQU (0x00080000)
GPIO_OSPEEDER_OSPEEDR10     EQU (0x00300000)
GPIO_OSPEEDER_OSPEEDR10_0   EQU (0x00100000)
GPIO_OSPEEDER_OSPEEDR10_1   EQU (0x00200000)
GPIO_OSPEEDER_OSPEEDR11     EQU (0x00C00000)
GPIO_OSPEEDER_OSPEEDR11_0   EQU (0x00400000)
GPIO_OSPEEDER_OSPEEDR11_1   EQU (0x00800000)
GPIO_OSPEEDER_OSPEEDR12     EQU (0x03000000)
GPIO_OSPEEDER_OSPEEDR12_0   EQU (0x01000000)
GPIO_OSPEEDER_OSPEEDR12_1   EQU (0x02000000)
GPIO_OSPEEDER_OSPEEDR13     EQU (0x0C000000)
GPIO_OSPEEDER_OSPEEDR13_0   EQU (0x04000000)
GPIO_OSPEEDER_OSPEEDR13_1   EQU (0x08000000)
GPIO_OSPEEDER_OSPEEDR14     EQU (0x30000000)
GPIO_OSPEEDER_OSPEEDR14_0   EQU (0x10000000)
GPIO_OSPEEDER_OSPEEDR14_1   EQU (0x20000000)
GPIO_OSPEEDER_OSPEEDR15     EQU (0xC0000000)
GPIO_OSPEEDER_OSPEEDR15_0   EQU (0x40000000)
GPIO_OSPEEDER_OSPEEDR15_1   EQU (0x80000000)

; ******************  Bits definition for GPIO_PUPDR register  ****************
GPIO_PUPDR_PUPDR0           EQU (0x00000003)
GPIO_PUPDR_PUPDR0_0         EQU (0x00000001)
GPIO_PUPDR_PUPDR0_1         EQU (0x00000002)
GPIO_PUPDR_PUPDR1           EQU (0x0000000C)
GPIO_PUPDR_PUPDR1_0         EQU (0x00000004)
GPIO_PUPDR_PUPDR1_1         EQU (0x00000008)
GPIO_PUPDR_PUPDR2           EQU (0x00000030)
GPIO_PUPDR_PUPDR2_0         EQU (0x00000010)
GPIO_PUPDR_PUPDR2_1         EQU (0x00000020)
GPIO_PUPDR_PUPDR3           EQU (0x000000C0)
GPIO_PUPDR_PUPDR3_0         EQU (0x00000040)
GPIO_PUPDR_PUPDR3_1         EQU (0x00000080)
GPIO_PUPDR_PUPDR4           EQU (0x00000300)
GPIO_PUPDR_PUPDR4_0         EQU (0x00000100)
GPIO_PUPDR_PUPDR4_1         EQU (0x00000200)
GPIO_PUPDR_PUPDR5           EQU (0x00000C00)
GPIO_PUPDR_PUPDR5_0         EQU (0x00000400)
GPIO_PUPDR_PUPDR5_1         EQU (0x00000800)
GPIO_PUPDR_PUPDR6           EQU (0x00003000)
GPIO_PUPDR_PUPDR6_0         EQU (0x00001000)
GPIO_PUPDR_PUPDR6_1         EQU (0x00002000)
GPIO_PUPDR_PUPDR7           EQU (0x0000C000)
GPIO_PUPDR_PUPDR7_0         EQU (0x00004000)
GPIO_PUPDR_PUPDR7_1         EQU (0x00008000)
GPIO_PUPDR_PUPDR8           EQU (0x00030000)
GPIO_PUPDR_PUPDR8_0         EQU (0x00010000)
GPIO_PUPDR_PUPDR8_1         EQU (0x00020000)
GPIO_PUPDR_PUPDR9           EQU (0x000C0000)
GPIO_PUPDR_PUPDR9_0         EQU (0x00040000)
GPIO_PUPDR_PUPDR9_1         EQU (0x00080000)
GPIO_PUPDR_PUPDR10          EQU (0x00300000)
GPIO_PUPDR_PUPDR10_0        EQU (0x00100000)
GPIO_PUPDR_PUPDR10_1        EQU (0x00200000)
GPIO_PUPDR_PUPDR11          EQU (0x00C00000)
GPIO_PUPDR_PUPDR11_0        EQU (0x00400000)
GPIO_PUPDR_PUPDR11_1        EQU (0x00800000)
GPIO_PUPDR_PUPDR12          EQU (0x03000000)
GPIO_PUPDR_PUPDR12_0        EQU (0x01000000)
GPIO_PUPDR_PUPDR12_1        EQU (0x02000000)
GPIO_PUPDR_PUPDR13          EQU (0x0C000000)
GPIO_PUPDR_PUPDR13_0        EQU (0x04000000)
GPIO_PUPDR_PUPDR13_1        EQU (0x08000000)
GPIO_PUPDR_PUPDR14          EQU (0x30000000)
GPIO_PUPDR_PUPDR14_0        EQU (0x10000000)
GPIO_PUPDR_PUPDR14_1        EQU (0x20000000)
GPIO_PUPDR_PUPDR15          EQU (0xC0000000)
GPIO_PUPDR_PUPDR15_0        EQU (0x40000000)
GPIO_PUPDR_PUPDR15_1        EQU (0x80000000)

; ******************  Bits definition for GPIO_IDR register  ******************
GPIO_IDR_IDR_0              EQU (0x00000001)
GPIO_IDR_IDR_1              EQU (0x00000002)
GPIO_IDR_IDR_2              EQU (0x00000004)
GPIO_IDR_IDR_3              EQU (0x00000008)
GPIO_IDR_IDR_4              EQU (0x00000010)
GPIO_IDR_IDR_5              EQU (0x00000020)
GPIO_IDR_IDR_6              EQU (0x00000040)
GPIO_IDR_IDR_7              EQU (0x00000080)
GPIO_IDR_IDR_8              EQU (0x00000100)
GPIO_IDR_IDR_9              EQU (0x00000200)
GPIO_IDR_IDR_10             EQU (0x00000400)
GPIO_IDR_IDR_11             EQU (0x00000800)
GPIO_IDR_IDR_12             EQU (0x00001000)
GPIO_IDR_IDR_13             EQU (0x00002000)
GPIO_IDR_IDR_14             EQU (0x00004000)
GPIO_IDR_IDR_15             EQU (0x00008000)

