Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; Old GPIO_IDR register bits definition, maintained for legacy purpose
GPIO_OTYPER_IDR_0           EQU GPIO_IDR_IDR_0
GPIO_OTYPER_IDR_1           EQU GPIO_IDR_IDR_1
GPIO_OTYPER_IDR_2           EQU GPIO_IDR_IDR_2
GPIO_OTYPER_IDR_3           EQU GPIO_IDR_IDR_3
GPIO_OTYPER_IDR_4           EQU GPIO_IDR_IDR_4
GPIO_OTYPER_IDR_5           EQU GPIO_IDR_IDR_5
GPIO_OTYPER_IDR_6           EQU GPIO_IDR_IDR_6
GPIO_OTYPER_IDR_7           EQU GPIO_IDR_IDR_7
GPIO_OTYPER_IDR_8           EQU GPIO_IDR_IDR_8
GPIO_OTYPER_IDR_9           EQU GPIO_IDR_IDR_9
GPIO_OTYPER_IDR_10          EQU GPIO_IDR_IDR_10
GPIO_OTYPER_IDR_11          EQU GPIO_IDR_IDR_11
GPIO_OTYPER_IDR_12          EQU GPIO_IDR_IDR_12
GPIO_OTYPER_IDR_13          EQU GPIO_IDR_IDR_13
GPIO_OTYPER_IDR_14          EQU GPIO_IDR_IDR_14
GPIO_OTYPER_IDR_15          EQU GPIO_IDR_IDR_15

; ******************  Bits definition for GPIO_ODR register  ******************
GPIO_ODR_ODR_0              EQU (0x00000001)
GPIO_ODR_ODR_1              EQU (0x00000002)
GPIO_ODR_ODR_2              EQU (0x00000004)
GPIO_ODR_ODR_3              EQU (0x00000008)
GPIO_ODR_ODR_4              EQU (0x00000010)
GPIO_ODR_ODR_5              EQU (0x00000020)
GPIO_ODR_ODR_6              EQU (0x00000040)
GPIO_ODR_ODR_7              EQU (0x00000080)
GPIO_ODR_ODR_8              EQU (0x00000100)
GPIO_ODR_ODR_9              EQU (0x00000200)
GPIO_ODR_ODR_10             EQU (0x00000400)
GPIO_ODR_ODR_11             EQU (0x00000800)
GPIO_ODR_ODR_12             EQU (0x00001000)
GPIO_ODR_ODR_13             EQU (0x00002000)
GPIO_ODR_ODR_14             EQU (0x00004000)
GPIO_ODR_ODR_15             EQU (0x00008000)

; Old GPIO_ODR register bits definition, maintained for legacy purpose
GPIO_OTYPER_ODR_0           EQU GPIO_ODR_ODR_0
GPIO_OTYPER_ODR_1           EQU GPIO_ODR_ODR_1
GPIO_OTYPER_ODR_2           EQU GPIO_ODR_ODR_2
GPIO_OTYPER_ODR_3           EQU GPIO_ODR_ODR_3
GPIO_OTYPER_ODR_4           EQU GPIO_ODR_ODR_4
GPIO_OTYPER_ODR_5           EQU GPIO_ODR_ODR_5
GPIO_OTYPER_ODR_6           EQU GPIO_ODR_ODR_6
GPIO_OTYPER_ODR_7           EQU GPIO_ODR_ODR_7
GPIO_OTYPER_ODR_8           EQU GPIO_ODR_ODR_8
GPIO_OTYPER_ODR_9           EQU GPIO_ODR_ODR_9
GPIO_OTYPER_ODR_10          EQU GPIO_ODR_ODR_10
GPIO_OTYPER_ODR_11          EQU GPIO_ODR_ODR_11
GPIO_OTYPER_ODR_12          EQU GPIO_ODR_ODR_12
GPIO_OTYPER_ODR_13          EQU GPIO_ODR_ODR_13
GPIO_OTYPER_ODR_14          EQU GPIO_ODR_ODR_14
GPIO_OTYPER_ODR_15          EQU GPIO_ODR_ODR_15

; ******************  Bits definition for GPIO_BSRR register  *****************
GPIO_BSRR_BS_0              EQU (0x00000001)
GPIO_BSRR_BS_1              EQU (0x00000002)
GPIO_BSRR_BS_2              EQU (0x00000004)
GPIO_BSRR_BS_3              EQU (0x00000008)
GPIO_BSRR_BS_4              EQU (0x00000010)
GPIO_BSRR_BS_5              EQU (0x00000020)
GPIO_BSRR_BS_6              EQU (0x00000040)
GPIO_BSRR_BS_7              EQU (0x00000080)
GPIO_BSRR_BS_8              EQU (0x00000100)
GPIO_BSRR_BS_9              EQU (0x00000200)
GPIO_BSRR_BS_10             EQU (0x00000400)
GPIO_BSRR_BS_11             EQU (0x00000800)
GPIO_BSRR_BS_12             EQU (0x00001000)
GPIO_BSRR_BS_13             EQU (0x00002000)
GPIO_BSRR_BS_14             EQU (0x00004000)
GPIO_BSRR_BS_15             EQU (0x00008000)
GPIO_BSRR_BR_0              EQU (0x00010000)
GPIO_BSRR_BR_1              EQU (0x00020000)
GPIO_BSRR_BR_2              EQU (0x00040000)
GPIO_BSRR_BR_3              EQU (0x00080000)
GPIO_BSRR_BR_4              EQU (0x00100000)
GPIO_BSRR_BR_5              EQU (0x00200000)
GPIO_BSRR_BR_6              EQU (0x00400000)
GPIO_BSRR_BR_7              EQU (0x00800000)
GPIO_BSRR_BR_8              EQU (0x01000000)
GPIO_BSRR_BR_9              EQU (0x02000000)
GPIO_BSRR_BR_10             EQU (0x04000000)
GPIO_BSRR_BR_11             EQU (0x08000000)
GPIO_BSRR_BR_12             EQU (0x10000000)
GPIO_BSRR_BR_13             EQU (0x20000000)
GPIO_BSRR_BR_14             EQU (0x40000000)
GPIO_BSRR_BR_15             EQU (0x80000000)

; ******************  Bits definition for GPIO_BRR register  *****************
GPIO_BRR_BR_0               EQU (0x00000001)
GPIO_BRR_BR_1               EQU (0x00000002)
GPIO_BRR_BR_2               EQU (0x00000004)
GPIO_BRR_BR_3               EQU (0x00000008)
GPIO_BRR_BR_4               EQU (0x00000010)
GPIO_BRR_BR_5               EQU (0x00000020)
GPIO_BRR_BR_6               EQU (0x00000040)
GPIO_BRR_BR_7               EQU (0x00000080)
GPIO_BRR_BR_8               EQU (0x00000100)
GPIO_BRR_BR_9               EQU (0x00000200)
GPIO_BRR_BR_10              EQU (0x00000400)
GPIO_BRR_BR_11              EQU (0x00000800)
GPIO_BRR_BR_12              EQU (0x00001000)
GPIO_BRR_BR_13              EQU (0x00002000)
GPIO_BRR_BR_14              EQU (0x00004000)
GPIO_BRR_BR_15              EQU (0x00008000)

; ****************** Bit definition for GPIO_LCKR register ********************
GPIO_LCKR_LCK0              EQU (0x00000001)
GPIO_LCKR_LCK1              EQU (0x00000002)
GPIO_LCKR_LCK2              EQU (0x00000004)
GPIO_LCKR_LCK3              EQU (0x00000008)
GPIO_LCKR_LCK4              EQU (0x00000010)
GPIO_LCKR_LCK5              EQU (0x00000020)
GPIO_LCKR_LCK6              EQU (0x00000040)
GPIO_LCKR_LCK7              EQU (0x00000080)
GPIO_LCKR_LCK8              EQU (0x00000100)
GPIO_LCKR_LCK9              EQU (0x00000200)
GPIO_LCKR_LCK10             EQU (0x00000400)
GPIO_LCKR_LCK11             EQU (0x00000800)
GPIO_LCKR_LCK12             EQU (0x00001000)
GPIO_LCKR_LCK13             EQU (0x00002000)
GPIO_LCKR_LCK14             EQU (0x00004000)
GPIO_LCKR_LCK15             EQU (0x00008000)
GPIO_LCKR_LCKK              EQU (0x00010000)

; ****************** Bit definition for GPIO_AFRL register  *******************
GPIO_AFRL_AFRL0              EQU (0x0000000F)
GPIO_AFRL_AFRL1              EQU (0x000000F0)
GPIO_AFRL_AFRL2              EQU (0x00000F00)
GPIO_AFRL_AFRL3              EQU (0x0000F000)
GPIO_AFRL_AFRL4              EQU (0x000F0000)
GPIO_AFRL_AFRL5              EQU (0x00F00000)
GPIO_AFRL_AFRL6              EQU (0x0F000000)
GPIO_AFRL_AFRL7              EQU (0xF0000000)

; ****************** Bit definition for GPIO_AFRH register  *******************
GPIO_AFRH_AFRH0              EQU (0x0000000F)
GPIO_AFRH_AFRH1              EQU (0x000000F0)
GPIO_AFRH_AFRH2              EQU (0x00000F00)
GPIO_AFRH_AFRH3              EQU (0x0000F000)
GPIO_AFRH_AFRH4              EQU (0x000F0000)
GPIO_AFRH_AFRH5              EQU (0x00F00000)
GPIO_AFRH_AFRH6              EQU (0x0F000000)
GPIO_AFRH_AFRH7              EQU (0xF0000000)

