Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ******************  Bits definition for GPIO_ASCR register  ******************
GPIO_ASCR_EN_0               EQU (0x00000001)
GPIO_ASCR_EN_1               EQU (0x00000002)
GPIO_ASCR_EN_2               EQU (0x00000004)
GPIO_ASCR_EN_3               EQU (0x00000008)
GPIO_ASCR_EN_4               EQU (0x00000010)
GPIO_ASCR_EN_5               EQU (0x00000020)
GPIO_ASCR_EN_6               EQU (0x00000040)
GPIO_ASCR_EN_7               EQU (0x00000080)
GPIO_ASCR_EN_8               EQU (0x00000100)
GPIO_ASCR_EN_9               EQU (0x00000200)
GPIO_ASCR_EN_10              EQU (0x00000400)
GPIO_ASCR_EN_11              EQU (0x00000800)
GPIO_ASCR_EN_12              EQU (0x00001000)
GPIO_ASCR_EN_13              EQU (0x00002000)
GPIO_ASCR_EN_14              EQU (0x00004000)
GPIO_ASCR_EN_15              EQU (0x00008000)

; *****************************************************************************
;
;                      Inter-integrated Circuit Interface (I2C)
;
; *****************************************************************************
; *******************  Bit definition for I2C_CR1 register  ******************
I2C_CR1_PE                  EQU (0x00000001)        ; Peripheral enable
I2C_CR1_TXIE                EQU (0x00000002)        ; TX interrupt enable
I2C_CR1_RXIE                EQU (0x00000004)        ; RX interrupt enable
I2C_CR1_ADDRIE              EQU (0x00000008)        ; Address match interrupt enable
I2C_CR1_NACKIE              EQU (0x00000010)        ; NACK received interrupt enable
I2C_CR1_STOPIE              EQU (0x00000020)        ; STOP detection interrupt enable
I2C_CR1_TCIE                EQU (0x00000040)        ; Transfer complete interrupt enable
I2C_CR1_ERRIE               EQU (0x00000080)        ; Errors interrupt enable
I2C_CR1_DNF                 EQU (0x00000F00)        ; Digital noise filter
I2C_CR1_ANFOFF              EQU (0x00001000)        ; Analog noise filter OFF
I2C_CR1_SWRST               EQU (0x00002000)        ; Software reset
I2C_CR1_TXDMAEN             EQU (0x00004000)        ; DMA transmission requests enable
I2C_CR1_RXDMAEN             EQU (0x00008000)        ; DMA reception requests enable
I2C_CR1_SBC                 EQU (0x00010000)        ; Slave byte control
I2C_CR1_NOSTRETCH           EQU (0x00020000)        ; Clock stretching disable
I2C_CR1_WUPEN               EQU (0x00040000)        ; Wakeup from STOP enable
I2C_CR1_GCEN                EQU (0x00080000)        ; General call enable
I2C_CR1_SMBHEN              EQU (0x00100000)        ; SMBus host address enable
I2C_CR1_SMBDEN              EQU (0x00200000)        ; SMBus device default address enable
I2C_CR1_ALERTEN             EQU (0x00400000)        ; SMBus alert enable
I2C_CR1_PECEN               EQU (0x00800000)        ; PEC enable

; ******************  Bit definition for I2C_CR2 register  *******************
I2C_CR2_SADD                EQU (0x000003FF)        ; Slave address (master mode)
I2C_CR2_RD_WRN              EQU (0x00000400)        ; Transfer direction (master mode)
I2C_CR2_ADD10               EQU (0x00000800)        ; 10-bit addressing mode (master mode)
I2C_CR2_HEAD10R             EQU (0x00001000)        ; 10-bit address header only read direction (master mode)
I2C_CR2_START               EQU (0x00002000)        ; START generation
I2C_CR2_STOP                EQU (0x00004000)        ; STOP generation (master mode)
I2C_CR2_NACK                EQU (0x00008000)        ; NACK generation (slave mode)
I2C_CR2_NBYTES              EQU (0x00FF0000)        ; Number of bytes
I2C_CR2_RELOAD              EQU (0x01000000)        ; NBYTES reload mode
I2C_CR2_AUTOEND             EQU (0x02000000)        ; Automatic end mode (master mode)
I2C_CR2_PECBYTE             EQU (0x04000000)        ; Packet error checking byte

; *******************  Bit definition for I2C_OAR1 register  *****************
I2C_OAR1_OA1                EQU (0x000003FF)        ; Interface own address 1
I2C_OAR1_OA1MODE            EQU (0x00000400)        ; Own address 1 10-bit mode
I2C_OAR1_OA1EN              EQU (0x00008000)        ; Own address 1 enable

; *******************  Bit definition for I2C_OAR2 register  *****************
I2C_OAR2_OA2                EQU (0x000000FE)        ; Interface own address 2
I2C_OAR2_OA2MSK             EQU (0x00000700)        ; Own address 2 masks
I2C_OAR2_OA2NOMASK          EQU (0x00000000)        ; No mask
I2C_OAR2_OA2MASK01          EQU (0x00000100)        ; OA2[1] is masked, Only OA2[7:2] are compared
I2C_OAR2_OA2MASK02          EQU (0x00000200)        ; OA2[2:1] is masked, Only OA2[7:3] are compared
I2C_OAR2_OA2MASK03          EQU (0x00000300)        ; OA2[3:1] is masked, Only OA2[7:4] are compared
I2C_OAR2_OA2MASK04          EQU (0x00000400)        ; OA2[4:1] is masked, Only OA2[7:5] are compared
I2C_OAR2_OA2MASK05          EQU (0x00000500)        ; OA2[5:1] is masked, Only OA2[7:6] are compared
I2C_OAR2_OA2MASK06          EQU (0x00000600)        ; OA2[6:1] is masked, Only OA2[7] are compared
I2C_OAR2_OA2MASK07          EQU (0x00000700)        ; OA2[7:1] is masked, No comparison is done
I2C_OAR2_OA2EN              EQU (0x00008000)        ; Own address 2 enable

; *******************  Bit definition for I2C_TIMINGR register ******************
I2C_TIMINGR_SCLL            EQU (0x000000FF)        ; SCL low period (master mode)
I2C_TIMINGR_SCLH            EQU (0x0000FF00)        ; SCL high period (master mode)
I2C_TIMINGR_SDADEL          EQU (0x000F0000)        ; Data hold time
I2C_TIMINGR_SCLDEL          EQU (0x00F00000)        ; Data setup time
I2C_TIMINGR_PRESC           EQU (0xF0000000)        ; Timings prescaler

; ******************* Bit definition for I2C_TIMEOUTR register ******************
I2C_TIMEOUTR_TIMEOUTA       EQU (0x00000FFF)        ; Bus timeout A
I2C_TIMEOUTR_TIDLE          EQU (0x00001000)        ; Idle clock timeout detection
I2C_TIMEOUTR_TIMOUTEN       EQU (0x00008000)        ; Clock timeout enable
I2C_TIMEOUTR_TIMEOUTB       EQU (0x0FFF0000)        ; Bus timeout B
I2C_TIMEOUTR_TEXTEN         EQU (0x80000000)        ; Extended clock timeout enable

; ******************  Bit definition for I2C_ISR register  ********************
I2C_ISR_TXE                 EQU (0x00000001)        ; Transmit data register empty
I2C_ISR_TXIS                EQU (0x00000002)        ; Transmit interrupt status
I2C_ISR_RXNE                EQU (0x00000004)        ; Receive data register not empty
I2C_ISR_ADDR                EQU (0x00000008)        ; Address matched (slave mode)
I2C_ISR_NACKF               EQU (0x00000010)        ; NACK received flag
I2C_ISR_STOPF               EQU (0x00000020)        ; STOP detection flag
I2C_ISR_TC                  EQU (0x00000040)        ; Transfer complete (master mode)
I2C_ISR_TCR                 EQU (0x00000080)        ; Transfer complete reload
I2C_ISR_BERR                EQU (0x00000100)        ; Bus error
I2C_ISR_ARLO                EQU (0x00000200)        ; Arbitration lost
I2C_ISR_OVR                 EQU (0x00000400)        ; Overrun/Underrun
I2C_ISR_PECERR              EQU (0x00000800)        ; PEC error in reception
I2C_ISR_TIMEOUT             EQU (0x00001000)        ; Timeout or Tlow detection flag
I2C_ISR_ALERT               EQU (0x00002000)        ; SMBus alert
I2C_ISR_BUSY                EQU (0x00008000)        ; Bus busy
I2C_ISR_DIR                 EQU (0x00010000)        ; Transfer direction (slave mode)
I2C_ISR_ADDCODE             EQU (0x00FE0000)        ; Address match code (slave mode)

