Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ******************  Bit definition for I2C_ICR register  ********************
I2C_ICR_ADDRCF              EQU (0x00000008)        ; Address matched clear flag
I2C_ICR_NACKCF              EQU (0x00000010)        ; NACK clear flag
I2C_ICR_STOPCF              EQU (0x00000020)        ; STOP detection clear flag
I2C_ICR_BERRCF              EQU (0x00000100)        ; Bus error clear flag
I2C_ICR_ARLOCF              EQU (0x00000200)        ; Arbitration lost clear flag
I2C_ICR_OVRCF               EQU (0x00000400)        ; Overrun/Underrun clear flag
I2C_ICR_PECCF               EQU (0x00000800)        ; PAC error clear flag
I2C_ICR_TIMOUTCF            EQU (0x00001000)        ; Timeout clear flag
I2C_ICR_ALERTCF             EQU (0x00002000)        ; Alert clear flag

; ******************  Bit definition for I2C_PECR register  ********************
I2C_PECR_PEC                EQU (0x000000FF)        ; PEC register

; ******************  Bit definition for I2C_RXDR register  ********************
I2C_RXDR_RXDATA             EQU (0x000000FF)        ; 8-bit receive data

; ******************  Bit definition for I2C_TXDR register  ********************
I2C_TXDR_TXDATA             EQU (0x000000FF)        ; 8-bit transmit data

; *****************************************************************************
;
;                           Independent WATCHDOG
;
; *****************************************************************************
; *******************  Bit definition for IWDG_KR register  *******************
IWDG_KR_KEY                 EQU (0x0000FFFF)        ;Key value (write only, read 0000h)

; *******************  Bit definition for IWDG_PR register  *******************
IWDG_PR_PR                  EQU (0x00000007)        ;PR[2:0] (Prescaler divider)
IWDG_PR_PR_0                EQU (0x00000001)        ;Bit 0
IWDG_PR_PR_1                EQU (0x00000002)        ;Bit 1
IWDG_PR_PR_2                EQU (0x00000004)        ;Bit 2

; *******************  Bit definition for IWDG_RLR register  ******************
IWDG_RLR_RL                 EQU (0x00000FFF)        ;Watchdog counter reload value

; *******************  Bit definition for IWDG_SR register  *******************
IWDG_SR_PVU                 EQU (0x00000001)        ; Watchdog prescaler value update
IWDG_SR_RVU                 EQU (0x00000002)        ; Watchdog counter reload value update
IWDG_SR_WVU                 EQU (0x00000004)        ; Watchdog counter window value update

; *******************  Bit definition for IWDG_KR register  *******************
IWDG_WINR_WIN               EQU (0x00000FFF)        ; Watchdog counter window value

; *****************************************************************************
;
;                                     Firewall
;
; *****************************************************************************

; *******Bit definition for CSSA;CSL;NVDSSA;NVDSL;VDSSA;VDSL;LSSA;LSL register
FW_CSSA_ADD           EQU (0x00FFFF00)        ; Code Segment Start Address
FW_CSL_LENG           EQU (0x003FFF00)        ; Code Segment Length
FW_NVDSSA_ADD         EQU (0x00FFFF00)        ; Non Volatile Dat Segment Start Address
FW_NVDSL_LENG         EQU (0x003FFF00)        ; Non Volatile Data Segment Length
FW_VDSSA_ADD          EQU (0x0001FFC0)        ; Volatile Data Segment Start Address
FW_VDSL_LENG          EQU (0x0001FFC0)        ; Volatile Data Segment Length
FW_LSSA_ADD           EQU (0x0007FF80)        ; Library Segment Start Address
FW_LSL_LENG           EQU (0x0007FF80)        ; Library Segment Length

; **************************Bit definition for CR register ********************
FW_CR_FPA             EQU (0x00000001)         ; Firewall Pre Arm
FW_CR_VDS             EQU (0x00000002)         ; Volatile Data Sharing
FW_CR_VDE             EQU (0x00000004)         ; Volatile Data Execution

; *****************************************************************************
;
;                             Power Control
;
; *****************************************************************************

; ********************  Bit definition for PWR_CR1 register  *******************

PWR_CR1_LPR                 EQU (0x00004000)     ; Regulator low-power mode
PWR_CR1_VOS                 EQU (0x00000600)     ; VOS[1:0] bits (Regulator voltage scaling output selection)
PWR_CR1_VOS_0               EQU (0x00000200)     ; Bit 0
PWR_CR1_VOS_1               EQU (0x00000400)     ; Bit 1
PWR_CR1_DBP                 EQU (0x00000100)     ; Disable Back-up domain Protection
PWR_CR1_LPMS                EQU (0x00000007)     ; Low-power mode selection field
PWR_CR1_LPMS_STOP1MR        EQU (0x00000000)     ; Stop 1 mode with Main Regulator
PWR_CR1_LPMS_STOP1LPR       EQU (0x00000001)     ; Stop 1 mode with Low-Power Regulator
PWR_CR1_LPMS_STOP2          EQU (0x00000002)     ; Stop 2 mode
PWR_CR1_LPMS_STANDBY        EQU (0x00000003)     ; Stand-by mode
PWR_CR1_LPMS_SHUTDOWN       EQU (0x00000004)     ; Shut-down mode


; ********************  Bit definition for PWR_CR2 register  *******************
PWR_CR2_USV                 EQU (0x00000400)     ; VDD USB Supply Valid
PWR_CR2_IOSV                EQU (0x00000200)     ; VDD IO2 independent I/Os Supply Valid
; PVME  Peripheral Voltage Monitor Enable
PWR_CR2_PVME                EQU (0x000000F0)     ; PVM bits field
PWR_CR2_PVME4               EQU (0x00000080)     ; PVM 4 Enable
PWR_CR2_PVME3               EQU (0x00000040)     ; PVM 3 Enable
PWR_CR2_PVME2               EQU (0x00000020)     ; PVM 2 Enable
PWR_CR2_PVME1               EQU (0x00000010)     ; PVM 1 Enable
; PVD level configuration
PWR_CR2_PLS                 EQU (0x0000000E)     ; PVD level selection
PWR_CR2_PLS_LEV0            EQU (0x00000000)     ; PVD level 0
PWR_CR2_PLS_LEV1            EQU (0x00000002)     ; PVD level 1
PWR_CR2_PLS_LEV2            EQU (0x00000004)     ; PVD level 2
PWR_CR2_PLS_LEV3            EQU (0x00000006)     ; PVD level 3
PWR_CR2_PLS_LEV4            EQU (0x00000008)     ; PVD level 4
PWR_CR2_PLS_LEV5            EQU (0x0000000A)     ; PVD level 5
PWR_CR2_PLS_LEV6            EQU (0x0000000C)     ; PVD level 6
PWR_CR2_PLS_LEV7            EQU (0x0000000E)     ; PVD level 7
PWR_CR2_PVDE                EQU (0x00000001)     ; Power Voltage Detector Enable

