Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bit definition for PWR_CR3 register  *******************
PWR_CR3_EIWF                EQU (0x00008000)      ; Enable Internal Wake-up line
PWR_CR3_APC                 EQU (0x00000400)      ; Apply pull-up and pull-down configuration
PWR_CR3_RRS                 EQU (0x00000100)      ; SRAM2 Retention in Stand-by mode
PWR_CR3_EWUP5               EQU (0x00000010)      ; Enable Wake-Up Pin 5
PWR_CR3_EWUP4               EQU (0x00000008)      ; Enable Wake-Up Pin 4
PWR_CR3_EWUP3               EQU (0x00000004)      ; Enable Wake-Up Pin 3
PWR_CR3_EWUP2               EQU (0x00000002)      ; Enable Wake-Up Pin 2
PWR_CR3_EWUP1               EQU (0x00000001)      ; Enable Wake-Up Pin 1
PWR_CR3_EWUP                EQU (0x0000001F)      ; Enable Wake-Up Pins

; ********************  Bit definition for PWR_CR4 register  *******************
PWR_CR4_VBRS                EQU (0x00000200)      ; VBAT Battery charging Resistor Selection
PWR_CR4_VBE                 EQU (0x00000100)      ; VBAT Battery charging Enable
PWR_CR4_WP5                 EQU (0x00000010)      ; Wake-Up Pin 5 polarity
PWR_CR4_WP4                 EQU (0x00000008)      ; Wake-Up Pin 4 polarity
PWR_CR4_WP3                 EQU (0x00000004)      ; Wake-Up Pin 3 polarity
PWR_CR4_WP2                 EQU (0x00000002)      ; Wake-Up Pin 2 polarity
PWR_CR4_WP1                 EQU (0x00000001)      ; Wake-Up Pin 1 polarity

; ********************  Bit definition for PWR_SR1 register  *******************
PWR_SR1_WUFI               EQU (0x00008000)     ; Wake-Up Flag Internal
PWR_SR1_SBF                EQU (0x00000100)     ; Stand-By Flag
PWR_SR1_WUF                EQU (0x0000001F)     ; Wake-up Flags
PWR_SR1_WUF5               EQU (0x00000010)     ; Wake-up Flag 5
PWR_SR1_WUF4               EQU (0x00000008)     ; Wake-up Flag 4
PWR_SR1_WUF3               EQU (0x00000004)     ; Wake-up Flag 3
PWR_SR1_WUF2               EQU (0x00000002)     ; Wake-up Flag 2
PWR_SR1_WUF1               EQU (0x00000001)     ; Wake-up Flag 1

; ********************  Bit definition for PWR_SR2 register  *******************
PWR_SR2_PVMO4              EQU (0x00008000)     ; Peripheral Voltage Monitoring Output 4
PWR_SR2_PVMO3              EQU (0x00004000)     ; Peripheral Voltage Monitoring Output 3
PWR_SR2_PVMO2              EQU (0x00002000)     ; Peripheral Voltage Monitoring Output 2
PWR_SR2_PVMO1              EQU (0x00001000)     ; Peripheral Voltage Monitoring Output 1
PWR_SR2_PVDO               EQU (0x00000800)     ; Power Voltage Detector Output
PWR_SR2_VOSF               EQU (0x00000400)     ; Voltage Scaling Flag
PWR_SR2_REGLPF             EQU (0x00000200)     ; Low-power Regulator Flag
PWR_SR2_REGLPS             EQU (0x00000100)     ; Low-power Regulator Started

; ********************  Bit definition for PWR_SCR register  *******************
PWR_SCR_CSBF               EQU (0x00000100)      ; Clear Stand-By Flag
PWR_SCR_CWUF               EQU (0x0000001F)      ; Clear Wake-up Flags
PWR_SCR_CWUF5              EQU (0x00000010)      ; Clear Wake-up Flag 5
PWR_SCR_CWUF4              EQU (0x00000008)      ; Clear Wake-up Flag 4
PWR_SCR_CWUF3              EQU (0x00000004)      ; Clear Wake-up Flag 3
PWR_SCR_CWUF2              EQU (0x00000002)      ; Clear Wake-up Flag 2
PWR_SCR_CWUF1              EQU (0x00000001)      ; Clear Wake-up Flag 1

; ********************  Bit definition for PWR_PUCRA register  *******************
PWR_PUCRA_PA15             EQU (0x00008000)      ; Port PA15 Pull-Up set
PWR_PUCRA_PA13             EQU (0x00002000)      ; Port PA13 Pull-Up set
PWR_PUCRA_PA12             EQU (0x00001000)      ; Port PA12 Pull-Up set
PWR_PUCRA_PA11             EQU (0x00000800)      ; Port PA11 Pull-Up set
PWR_PUCRA_PA10             EQU (0x00000400)      ; Port PA10 Pull-Up set
PWR_PUCRA_PA9              EQU (0x00000200)      ; Port PA9 Pull-Up set
PWR_PUCRA_PA8              EQU (0x00000100)      ; Port PA8 Pull-Up set
PWR_PUCRA_PA7              EQU (0x00000080)      ; Port PA7 Pull-Up set
PWR_PUCRA_PA6              EQU (0x00000040)      ; Port PA6 Pull-Up set
PWR_PUCRA_PA5              EQU (0x00000020)      ; Port PA5 Pull-Up set
PWR_PUCRA_PA4              EQU (0x00000010)      ; Port PA4 Pull-Up set
PWR_PUCRA_PA3              EQU (0x00000008)      ; Port PA3 Pull-Up set
PWR_PUCRA_PA2              EQU (0x00000004)      ; Port PA2 Pull-Up set
PWR_PUCRA_PA1              EQU (0x00000002)      ; Port PA1 Pull-Up set
PWR_PUCRA_PA0              EQU (0x00000001)      ; Port PA0 Pull-Up set

; ********************  Bit definition for PWR_PDCRA register  *******************
PWR_PDCRA_PA14             EQU (0x00004000)      ; Port PA14 Pull-Down set
PWR_PDCRA_PA12             EQU (0x00001000)      ; Port PA12 Pull-Down set
PWR_PDCRA_PA11             EQU (0x00000800)      ; Port PA11 Pull-Down set
PWR_PDCRA_PA10             EQU (0x00000400)      ; Port PA10 Pull-Down set
PWR_PDCRA_PA9              EQU (0x00000200)      ; Port PA9 Pull-Down set
PWR_PDCRA_PA8              EQU (0x00000100)      ; Port PA8 Pull-Down set
PWR_PDCRA_PA7              EQU (0x00000080)      ; Port PA7 Pull-Down set
PWR_PDCRA_PA6              EQU (0x00000040)      ; Port PA6 Pull-Down set
PWR_PDCRA_PA5              EQU (0x00000020)      ; Port PA5 Pull-Down set
PWR_PDCRA_PA4              EQU (0x00000010)      ; Port PA4 Pull-Down set
PWR_PDCRA_PA3              EQU (0x00000008)      ; Port PA3 Pull-Down set
PWR_PDCRA_PA2              EQU (0x00000004)      ; Port PA2 Pull-Down set
PWR_PDCRA_PA1              EQU (0x00000002)      ; Port PA1 Pull-Down set
PWR_PDCRA_PA0              EQU (0x00000001)      ; Port PA0 Pull-Down set

; ********************  Bit definition for PWR_PUCRB register  *******************
PWR_PUCRB_PB15             EQU (0x00008000)      ; Port PB15 Pull-Up set
PWR_PUCRB_PB14             EQU (0x00004000)      ; Port PB14 Pull-Up set
PWR_PUCRB_PB13             EQU (0x00002000)      ; Port PB13 Pull-Up set
PWR_PUCRB_PB12             EQU (0x00001000)      ; Port PB12 Pull-Up set
PWR_PUCRB_PB11             EQU (0x00000800)      ; Port PB11 Pull-Up set
PWR_PUCRB_PB10             EQU (0x00000400)      ; Port PB10 Pull-Up set
PWR_PUCRB_PB9              EQU (0x00000200)      ; Port PB9 Pull-Up set
PWR_PUCRB_PB8              EQU (0x00000100)      ; Port PB8 Pull-Up set
PWR_PUCRB_PB7              EQU (0x00000080)      ; Port PB7 Pull-Up set
PWR_PUCRB_PB6              EQU (0x00000040)      ; Port PB6 Pull-Up set
PWR_PUCRB_PB5              EQU (0x00000020)      ; Port PB5 Pull-Up set
PWR_PUCRB_PB4              EQU (0x00000010)      ; Port PB4 Pull-Up set
PWR_PUCRB_PB3              EQU (0x00000008)      ; Port PB3 Pull-Up set
PWR_PUCRB_PB2              EQU (0x00000004)      ; Port PB2 Pull-Up set
PWR_PUCRB_PB1              EQU (0x00000002)      ; Port PB1 Pull-Up set
PWR_PUCRB_PB0              EQU (0x00000001)      ; Port PB0 Pull-Up set

