Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bit definition for PWR_PDCRB register  *******************
PWR_PDCRB_PB15             EQU (0x00008000)      ; Port PB15 Pull-Down set
PWR_PDCRB_PB14             EQU (0x00004000)      ; Port PB14 Pull-Down set
PWR_PDCRB_PB13             EQU (0x00002000)      ; Port PB13 Pull-Down set
PWR_PDCRB_PB12             EQU (0x00001000)      ; Port PB12 Pull-Down set
PWR_PDCRB_PB11             EQU (0x00000800)      ; Port PB11 Pull-Down set
PWR_PDCRB_PB10             EQU (0x00000400)      ; Port PB10 Pull-Down set
PWR_PDCRB_PB9              EQU (0x00000200)      ; Port PB9 Pull-Down set
PWR_PDCRB_PB8              EQU (0x00000100)      ; Port PB8 Pull-Down set
PWR_PDCRB_PB7              EQU (0x00000080)      ; Port PB7 Pull-Down set
PWR_PDCRB_PB6              EQU (0x00000040)      ; Port PB6 Pull-Down set
PWR_PDCRB_PB5              EQU (0x00000020)      ; Port PB5 Pull-Down set
PWR_PDCRB_PB3              EQU (0x00000008)      ; Port PB3 Pull-Down set
PWR_PDCRB_PB2              EQU (0x00000004)      ; Port PB2 Pull-Down set
PWR_PDCRB_PB1              EQU (0x00000002)      ; Port PB1 Pull-Down set
PWR_PDCRB_PB0              EQU (0x00000001)      ; Port PB0 Pull-Down set

; ********************  Bit definition for PWR_PUCRC register  *******************
PWR_PUCRC_PC15             EQU (0x00008000)      ; Port PC15 Pull-Up set
PWR_PUCRC_PC14             EQU (0x00004000)      ; Port PC14 Pull-Up set
PWR_PUCRC_PC13             EQU (0x00002000)      ; Port PC13 Pull-Up set
PWR_PUCRC_PC12             EQU (0x00001000)      ; Port PC12 Pull-Up set
PWR_PUCRC_PC11             EQU (0x00000800)      ; Port PC11 Pull-Up set
PWR_PUCRC_PC10             EQU (0x00000400)      ; Port PC10 Pull-Up set
PWR_PUCRC_PC9              EQU (0x00000200)      ; Port PC9 Pull-Up set
PWR_PUCRC_PC8              EQU (0x00000100)      ; Port PC8 Pull-Up set
PWR_PUCRC_PC7              EQU (0x00000080)      ; Port PC7 Pull-Up set
PWR_PUCRC_PC6              EQU (0x00000040)      ; Port PC6 Pull-Up set
PWR_PUCRC_PC5              EQU (0x00000020)      ; Port PC5 Pull-Up set
PWR_PUCRC_PC4              EQU (0x00000010)      ; Port PC4 Pull-Up set
PWR_PUCRC_PC3              EQU (0x00000008)      ; Port PC3 Pull-Up set
PWR_PUCRC_PC2              EQU (0x00000004)      ; Port PC2 Pull-Up set
PWR_PUCRC_PC1              EQU (0x00000002)      ; Port PC1 Pull-Up set
PWR_PUCRC_PC0              EQU (0x00000001)      ; Port PC0 Pull-Up set

; ********************  Bit definition for PWR_PDCRC register  *******************
PWR_PDCRC_PC15             EQU (0x00008000)      ; Port PC15 Pull-Down set
PWR_PDCRC_PC14             EQU (0x00004000)      ; Port PC14 Pull-Down set
PWR_PDCRC_PC13             EQU (0x00002000)      ; Port PC13 Pull-Down set
PWR_PDCRC_PC12             EQU (0x00001000)      ; Port PC12 Pull-Down set
PWR_PDCRC_PC11             EQU (0x00000800)      ; Port PC11 Pull-Down set
PWR_PDCRC_PC10             EQU (0x00000400)      ; Port PC10 Pull-Down set
PWR_PDCRC_PC9              EQU (0x00000200)      ; Port PC9 Pull-Down set
PWR_PDCRC_PC8              EQU (0x00000100)      ; Port PC8 Pull-Down set
PWR_PDCRC_PC7              EQU (0x00000080)      ; Port PC7 Pull-Down set
PWR_PDCRC_PC6              EQU (0x00000040)      ; Port PC6 Pull-Down set
PWR_PDCRC_PC5              EQU (0x00000020)      ; Port PC5 Pull-Down set
PWR_PDCRC_PC4              EQU (0x00000010)      ; Port PC4 Pull-Down set
PWR_PDCRC_PC3              EQU (0x00000008)      ; Port PC3 Pull-Down set
PWR_PDCRC_PC2              EQU (0x00000004)      ; Port PC2 Pull-Down set
PWR_PDCRC_PC1              EQU (0x00000002)      ; Port PC1 Pull-Down set
PWR_PDCRC_PC0              EQU (0x00000001)      ; Port PC0 Pull-Down set

; ********************  Bit definition for PWR_PUCRD register  *******************
PWR_PUCRD_PD15             EQU (0x00008000)      ; Port PD15 Pull-Up set
PWR_PUCRD_PD14             EQU (0x00004000)      ; Port PD14 Pull-Up set
PWR_PUCRD_PD13             EQU (0x00002000)      ; Port PD13 Pull-Up set
PWR_PUCRD_PD12             EQU (0x00001000)      ; Port PD12 Pull-Up set
PWR_PUCRD_PD11             EQU (0x00000800)      ; Port PD11 Pull-Up set
PWR_PUCRD_PD10             EQU (0x00000400)      ; Port PD10 Pull-Up set
PWR_PUCRD_PD9              EQU (0x00000200)      ; Port PD9 Pull-Up set
PWR_PUCRD_PD8              EQU (0x00000100)      ; Port PD8 Pull-Up set
PWR_PUCRD_PD7              EQU (0x00000080)      ; Port PD7 Pull-Up set
PWR_PUCRD_PD6              EQU (0x00000040)      ; Port PD6 Pull-Up set
PWR_PUCRD_PD5              EQU (0x00000020)      ; Port PD5 Pull-Up set
PWR_PUCRD_PD4              EQU (0x00000010)      ; Port PD4 Pull-Up set
PWR_PUCRD_PD3              EQU (0x00000008)      ; Port PD3 Pull-Up set
PWR_PUCRD_PD2              EQU (0x00000004)      ; Port PD2 Pull-Up set
PWR_PUCRD_PD1              EQU (0x00000002)      ; Port PD1 Pull-Up set
PWR_PUCRD_PD0              EQU (0x00000001)      ; Port PD0 Pull-Up set

; ********************  Bit definition for PWR_PDCRD register  *******************
PWR_PDCRD_PD15             EQU (0x00008000)      ; Port PD15 Pull-Down set
PWR_PDCRD_PD14             EQU (0x00004000)      ; Port PD14 Pull-Down set
PWR_PDCRD_PD13             EQU (0x00002000)      ; Port PD13 Pull-Down set
PWR_PDCRD_PD12             EQU (0x00001000)      ; Port PD12 Pull-Down set
PWR_PDCRD_PD11             EQU (0x00000800)      ; Port PD11 Pull-Down set
PWR_PDCRD_PD10             EQU (0x00000400)      ; Port PD10 Pull-Down set
PWR_PDCRD_PD9              EQU (0x00000200)      ; Port PD9 Pull-Down set
PWR_PDCRD_PD8              EQU (0x00000100)      ; Port PD8 Pull-Down set
PWR_PDCRD_PD7              EQU (0x00000080)      ; Port PD7 Pull-Down set
PWR_PDCRD_PD6              EQU (0x00000040)      ; Port PD6 Pull-Down set
PWR_PDCRD_PD5              EQU (0x00000020)      ; Port PD5 Pull-Down set
PWR_PDCRD_PD4              EQU (0x00000010)      ; Port PD4 Pull-Down set
PWR_PDCRD_PD3              EQU (0x00000008)      ; Port PD3 Pull-Down set
PWR_PDCRD_PD2              EQU (0x00000004)      ; Port PD2 Pull-Down set
PWR_PDCRD_PD1              EQU (0x00000002)      ; Port PD1 Pull-Down set
PWR_PDCRD_PD0              EQU (0x00000001)      ; Port PD0 Pull-Down set

; ********************  Bit definition for PWR_PUCRE register  *******************
PWR_PUCRE_PE15             EQU (0x00008000)      ; Port PE15 Pull-Up set
PWR_PUCRE_PE14             EQU (0x00004000)      ; Port PE14 Pull-Up set
PWR_PUCRE_PE13             EQU (0x00002000)      ; Port PE13 Pull-Up set
PWR_PUCRE_PE12             EQU (0x00001000)      ; Port PE12 Pull-Up set
PWR_PUCRE_PE11             EQU (0x00000800)      ; Port PE11 Pull-Up set
PWR_PUCRE_PE10             EQU (0x00000400)      ; Port PE10 Pull-Up set
PWR_PUCRE_PE9              EQU (0x00000200)      ; Port PE9 Pull-Up set
PWR_PUCRE_PE8              EQU (0x00000100)      ; Port PE8 Pull-Up set
PWR_PUCRE_PE7              EQU (0x00000080)      ; Port PE7 Pull-Up set
PWR_PUCRE_PE6              EQU (0x00000040)      ; Port PE6 Pull-Up set
PWR_PUCRE_PE5              EQU (0x00000020)      ; Port PE5 Pull-Up set
PWR_PUCRE_PE4              EQU (0x00000010)      ; Port PE4 Pull-Up set
PWR_PUCRE_PE3              EQU (0x00000008)      ; Port PE3 Pull-Up set
PWR_PUCRE_PE2              EQU (0x00000004)      ; Port PE2 Pull-Up set
PWR_PUCRE_PE1              EQU (0x00000002)      ; Port PE1 Pull-Up set
PWR_PUCRE_PE0              EQU (0x00000001)      ; Port PE0 Pull-Up set

; ********************  Bit definition for PWR_PDCRE register  *******************
PWR_PDCRE_PE15             EQU (0x00008000)      ; Port PE15 Pull-Down set
PWR_PDCRE_PE14             EQU (0x00004000)      ; Port PE14 Pull-Down set
PWR_PDCRE_PE13             EQU (0x00002000)      ; Port PE13 Pull-Down set
PWR_PDCRE_PE12             EQU (0x00001000)      ; Port PE12 Pull-Down set
PWR_PDCRE_PE11             EQU (0x00000800)      ; Port PE11 Pull-Down set
PWR_PDCRE_PE10             EQU (0x00000400)      ; Port PE10 Pull-Down set
PWR_PDCRE_PE9              EQU (0x00000200)      ; Port PE9 Pull-Down set
PWR_PDCRE_PE8              EQU (0x00000100)      ; Port PE8 Pull-Down set
PWR_PDCRE_PE7              EQU (0x00000080)      ; Port PE7 Pull-Down set
PWR_PDCRE_PE6              EQU (0x00000040)      ; Port PE6 Pull-Down set
PWR_PDCRE_PE5              EQU (0x00000020)      ; Port PE5 Pull-Down set
PWR_PDCRE_PE4              EQU (0x00000010)      ; Port PE4 Pull-Down set
PWR_PDCRE_PE3              EQU (0x00000008)      ; Port PE3 Pull-Down set
PWR_PDCRE_PE2              EQU (0x00000004)      ; Port PE2 Pull-Down set
PWR_PDCRE_PE1              EQU (0x00000002)      ; Port PE1 Pull-Down set
PWR_PDCRE_PE0              EQU (0x00000001)      ; Port PE0 Pull-Down set

; ********************  Bit definition for PWR_PUCRF register  *******************
PWR_PUCRF_PF15             EQU (0x00008000)      ; Port PF15 Pull-Up set
PWR_PUCRF_PF14             EQU (0x00004000)      ; Port PF14 Pull-Up set
PWR_PUCRF_PF13             EQU (0x00002000)      ; Port PF13 Pull-Up set
PWR_PUCRF_PF12             EQU (0x00001000)      ; Port PF12 Pull-Up set
PWR_PUCRF_PF11             EQU (0x00000800)      ; Port PF11 Pull-Up set
PWR_PUCRF_PF10             EQU (0x00000400)      ; Port PF10 Pull-Up set
PWR_PUCRF_PF9              EQU (0x00000200)      ; Port PF9 Pull-Up set
PWR_PUCRF_PF8              EQU (0x00000100)      ; Port PF8 Pull-Up set
PWR_PUCRF_PF7              EQU (0x00000080)      ; Port PF7 Pull-Up set
PWR_PUCRF_PF6              EQU (0x00000040)      ; Port PF6 Pull-Up set
PWR_PUCRF_PF5              EQU (0x00000020)      ; Port PF5 Pull-Up set
PWR_PUCRF_PF4              EQU (0x00000010)      ; Port PF4 Pull-Up set
PWR_PUCRF_PF3              EQU (0x00000008)      ; Port PF3 Pull-Up set
PWR_PUCRF_PF2              EQU (0x00000004)      ; Port PF2 Pull-Up set
PWR_PUCRF_PF1              EQU (0x00000002)      ; Port PF1 Pull-Up set
PWR_PUCRF_PF0              EQU (0x00000001)      ; Port PF0 Pull-Up set

