Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bit definition for PWR_PDCRF register  *******************
PWR_PDCRF_PF15             EQU (0x00008000)      ; Port PF15 Pull-Down set
PWR_PDCRF_PF14             EQU (0x00004000)      ; Port PF14 Pull-Down set
PWR_PDCRF_PF13             EQU (0x00002000)      ; Port PF13 Pull-Down set
PWR_PDCRF_PF12             EQU (0x00001000)      ; Port PF12 Pull-Down set
PWR_PDCRF_PF11             EQU (0x00000800)      ; Port PF11 Pull-Down set
PWR_PDCRF_PF10             EQU (0x00000400)      ; Port PF10 Pull-Down set
PWR_PDCRF_PF9              EQU (0x00000200)      ; Port PF9 Pull-Down set
PWR_PDCRF_PF8              EQU (0x00000100)      ; Port PF8 Pull-Down set
PWR_PDCRF_PF7              EQU (0x00000080)      ; Port PF7 Pull-Down set
PWR_PDCRF_PF6              EQU (0x00000040)      ; Port PF6 Pull-Down set
PWR_PDCRF_PF5              EQU (0x00000020)      ; Port PF5 Pull-Down set
PWR_PDCRF_PF4              EQU (0x00000010)      ; Port PF4 Pull-Down set
PWR_PDCRF_PF3              EQU (0x00000008)      ; Port PF3 Pull-Down set
PWR_PDCRF_PF2              EQU (0x00000004)      ; Port PF2 Pull-Down set
PWR_PDCRF_PF1              EQU (0x00000002)      ; Port PF1 Pull-Down set
PWR_PDCRF_PF0              EQU (0x00000001)      ; Port PF0 Pull-Down set

; ********************  Bit definition for PWR_PUCRG register  *******************
PWR_PUCRG_PG15             EQU (0x00008000)      ; Port PG15 Pull-Up set
PWR_PUCRG_PG14             EQU (0x00004000)      ; Port PG14 Pull-Up set
PWR_PUCRG_PG13             EQU (0x00002000)      ; Port PG13 Pull-Up set
PWR_PUCRG_PG12             EQU (0x00001000)      ; Port PG12 Pull-Up set
PWR_PUCRG_PG11             EQU (0x00000800)      ; Port PG11 Pull-Up set
PWR_PUCRG_PG10             EQU (0x00000400)      ; Port PG10 Pull-Up set
PWR_PUCRG_PG9              EQU (0x00000200)      ; Port PG9 Pull-Up set
PWR_PUCRG_PG8              EQU (0x00000100)      ; Port PG8 Pull-Up set
PWR_PUCRG_PG7              EQU (0x00000080)      ; Port PG7 Pull-Up set
PWR_PUCRG_PG6              EQU (0x00000040)      ; Port PG6 Pull-Up set
PWR_PUCRG_PG5              EQU (0x00000020)      ; Port PG5 Pull-Up set
PWR_PUCRG_PG4              EQU (0x00000010)      ; Port PG4 Pull-Up set
PWR_PUCRG_PG3              EQU (0x00000008)      ; Port PG3 Pull-Up set
PWR_PUCRG_PG2              EQU (0x00000004)      ; Port PG2 Pull-Up set
PWR_PUCRG_PG1              EQU (0x00000002)      ; Port PG1 Pull-Up set
PWR_PUCRG_PG0              EQU (0x00000001)      ; Port PG0 Pull-Up set

; ********************  Bit definition for PWR_PDCRG register  *******************
PWR_PDCRG_PG15             EQU (0x00008000)      ; Port PG15 Pull-Down set
PWR_PDCRG_PG14             EQU (0x00004000)      ; Port PG14 Pull-Down set
PWR_PDCRG_PG13             EQU (0x00002000)      ; Port PG13 Pull-Down set
PWR_PDCRG_PG12             EQU (0x00001000)      ; Port PG12 Pull-Down set
PWR_PDCRG_PG11             EQU (0x00000800)      ; Port PG11 Pull-Down set
PWR_PDCRG_PG10             EQU (0x00000400)      ; Port PG10 Pull-Down set
PWR_PDCRG_PG9              EQU (0x00000200)      ; Port PG9 Pull-Down set
PWR_PDCRG_PG8              EQU (0x00000100)      ; Port PG8 Pull-Down set
PWR_PDCRG_PG7              EQU (0x00000080)      ; Port PG7 Pull-Down set
PWR_PDCRG_PG6              EQU (0x00000040)      ; Port PG6 Pull-Down set
PWR_PDCRG_PG5              EQU (0x00000020)      ; Port PG5 Pull-Down set
PWR_PDCRG_PG4              EQU (0x00000010)      ; Port PG4 Pull-Down set
PWR_PDCRG_PG3              EQU (0x00000008)      ; Port PG3 Pull-Down set
PWR_PDCRG_PG2              EQU (0x00000004)      ; Port PG2 Pull-Down set
PWR_PDCRG_PG1              EQU (0x00000002)      ; Port PG1 Pull-Down set
PWR_PDCRG_PG0              EQU (0x00000001)      ; Port PG0 Pull-Down set

; ********************  Bit definition for PWR_PUCRH register  *******************
PWR_PUCRH_PH1              EQU (0x00000002)      ; Port PH1 Pull-Up set
PWR_PUCRH_PH0              EQU (0x00000001)      ; Port PH0 Pull-Up set

; ********************  Bit definition for PWR_PDCRH register  *******************
PWR_PDCRH_PH1              EQU (0x00000002)      ; Port PH1 Pull-Down set
PWR_PDCRH_PH0              EQU (0x00000001)      ; Port PH0 Pull-Down set


; *****************************************************************************
;
;                         Reset and Clock Control
;
; *****************************************************************************
; ********************  Bit definition for RCC_CR register  *******************
RCC_CR_MSION                EQU (0x00000001)      ; Internal Multi Speed oscillator (MSI) clock enable
RCC_CR_MSIRDY               EQU (0x00000002)      ; Internal Multi Speed oscillator (MSI) clock ready flag
RCC_CR_MSIPLLEN             EQU (0x00000004)      ; Internal Multi Speed oscillator (MSI) PLL enable
RCC_CR_MSIRGSEL             EQU (0x00000008)      ; Internal Multi Speed oscillator (MSI) range selection

; MSIRANGE configuration : 12 frequency ranges available
RCC_CR_MSIRANGE             EQU (0x000000F0)       ; Internal Multi Speed oscillator (MSI) clock Range
RCC_CR_MSIRANGE_0           EQU (0x00000000)       ; Internal Multi Speed oscillator (MSI) clock Range 100 KHz
RCC_CR_MSIRANGE_1           EQU (0x00000010)       ; Internal Multi Speed oscillator (MSI) clock Range 200 KHz
RCC_CR_MSIRANGE_2           EQU (0x00000020)       ; Internal Multi Speed oscillator (MSI) clock Range 400 KHz
RCC_CR_MSIRANGE_3           EQU (0x00000030)       ; Internal Multi Speed oscillator (MSI) clock Range 800 KHz
RCC_CR_MSIRANGE_4           EQU (0x00000040)       ; Internal Multi Speed oscillator (MSI) clock Range 1 MHz
RCC_CR_MSIRANGE_5           EQU (0x00000050)       ; Internal Multi Speed oscillator (MSI) clock Range 2 MHz
RCC_CR_MSIRANGE_6           EQU (0x00000060)       ; Internal Multi Speed oscillator (MSI) clock Range 4  MHz
RCC_CR_MSIRANGE_7           EQU (0x00000070)       ; Internal Multi Speed oscillator (MSI) clock Range 8 KHz
RCC_CR_MSIRANGE_8           EQU (0x00000080)       ; Internal Multi Speed oscillator (MSI) clock Range 16 MHz
RCC_CR_MSIRANGE_9           EQU (0x00000090)       ; Internal Multi Speed oscillator (MSI) clock Range 24 MHz
RCC_CR_MSIRANGE_10          EQU (0x000000A0)       ; Internal Multi Speed oscillator (MSI) clock Range 32 MHz
RCC_CR_MSIRANGE_11          EQU (0x000000B0)       ; Internal Multi Speed oscillator (MSI) clock Range 48  MHz

RCC_CR_HSION                EQU (0x00000100)       ; Internal High Speed oscillator (HSI16) clock enable
RCC_CR_HSIKERON             EQU (0x00000200)       ; Internal High Speed oscillator (HSI16) clock enable for some IPs Kernel
RCC_CR_HSIRDY               EQU (0x00000400)       ; Internal High Speed oscillator (HSI16) clock ready flag
RCC_CR_HSIASFS              EQU (0x00000800)       ; HSI16 Automatic Start from Stop

RCC_CR_HSEON                EQU (0x00010000)       ; External High Speed oscillator (HSE) clock enable
RCC_CR_HSERDY               EQU (0x00020000)       ; External High Speed oscillator (HSE) clock ready
RCC_CR_HSEBYP               EQU (0x00040000)       ; External High Speed oscillator (HSE) clock bypass
RCC_CR_CSSON                EQU (0x00080000)       ; HSE Clock Security System enable

RCC_CR_PLLON                EQU (0x01000000)       ; System PLL clock enable
RCC_CR_PLLRDY               EQU (0x02000000)       ; System PLL clock ready
RCC_CR_PLLSAI1ON            EQU (0x04000000)       ; SAI1 PLL enable
RCC_CR_PLLSAI1RDY           EQU (0x08000000)       ; SAI1 PLL ready
RCC_CR_PLLSAI2ON            EQU (0x10000000)       ; SAI2 PLL enable
RCC_CR_PLLSAI2RDY           EQU (0x20000000)       ; SAI2 PLL ready

