Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bit definition for RCC_ICSCR register  **************
; MSICAL configuration
RCC_ICSCR_MSICAL            EQU (0x000000FF)       ; MSICAL[7:0] bits
RCC_ICSCR_MSICAL_0          EQU (0x00000001)       ;Bit 0
RCC_ICSCR_MSICAL_1          EQU (0x00000002)       ;Bit 1
RCC_ICSCR_MSICAL_2          EQU (0x00000004)       ;Bit 2
RCC_ICSCR_MSICAL_3          EQU (0x00000008)       ;Bit 3
RCC_ICSCR_MSICAL_4          EQU (0x00000010)       ;Bit 4
RCC_ICSCR_MSICAL_5          EQU (0x00000020)       ;Bit 5
RCC_ICSCR_MSICAL_6          EQU (0x00000040)       ;Bit 6
RCC_ICSCR_MSICAL_7          EQU (0x00000080)       ;Bit 7

; MSITRIM configuration
RCC_ICSCR_MSITRIM           EQU (0x0000FF00)       ; MSITRIM[7:0] bits
RCC_ICSCR_MSITRIM_0         EQU (0x00000100)       ;Bit 0
RCC_ICSCR_MSITRIM_1         EQU (0x00000200)       ;Bit 1
RCC_ICSCR_MSITRIM_2         EQU (0x00000400)       ;Bit 2
RCC_ICSCR_MSITRIM_3         EQU (0x00000800)       ;Bit 3
RCC_ICSCR_MSITRIM_4         EQU (0x00001000)       ;Bit 4
RCC_ICSCR_MSITRIM_5         EQU (0x00002000)       ;Bit 5
RCC_ICSCR_MSITRIM_6         EQU (0x00004000)       ;Bit 6
RCC_ICSCR_MSITRIM_7         EQU (0x00008000)       ;Bit 7

; HSICAL configuration
RCC_ICSCR_HSICAL            EQU (0x00FF0000)       ; HSICAL[7:0] bits
RCC_ICSCR_HSICAL_0          EQU (0x00010000)        ;Bit 0
RCC_ICSCR_HSICAL_1          EQU (0x00020000)        ;Bit 1
RCC_ICSCR_HSICAL_2          EQU (0x00040000)        ;Bit 2
RCC_ICSCR_HSICAL_3          EQU (0x00080000)        ;Bit 3
RCC_ICSCR_HSICAL_4          EQU (0x00100000)        ;Bit 4
RCC_ICSCR_HSICAL_5          EQU (0x00200000)        ;Bit 5
RCC_ICSCR_HSICAL_6          EQU (0x00400000)        ;Bit 6
RCC_ICSCR_HSICAL_7          EQU (0x00800000)        ;Bit 7

; HSITRIM configuration
RCC_ICSCR_HSITRIM           EQU (0x1F000000)       ; HSITRIM[4:0] bits
RCC_ICSCR_HSITRIM_0         EQU (0x01000000)        ;Bit 0
RCC_ICSCR_HSITRIM_1         EQU (0x02000000)        ;Bit 1
RCC_ICSCR_HSITRIM_2         EQU (0x04000000)        ;Bit 2
RCC_ICSCR_HSITRIM_3         EQU (0x08000000)        ;Bit 3
RCC_ICSCR_HSITRIM_4         EQU (0x10000000)        ;Bit 4

; ********************  Bit definition for RCC_CFGR register  *****************
; SW configuration
RCC_CFGR_SW                 EQU (0x00000003)      ; SW[1:0] bits (System clock Switch)
RCC_CFGR_SW_0               EQU (0x00000001)      ;Bit 0
RCC_CFGR_SW_1               EQU (0x00000002)      ;Bit 1

RCC_CFGR_SW_MSI             EQU (0x00000000)      ; MSI oscillator selection as system clock
RCC_CFGR_SW_HSI             EQU (0x00000001)      ; HSI16 oscillator selection as system clock
RCC_CFGR_SW_HSE             EQU (0x00000002)      ; HSE oscillator selection as system clock
RCC_CFGR_SW_PLL             EQU (0x00000003)      ; PLL selection as system clock

; SWS configuration
RCC_CFGR_SWS                EQU (0x0000000C)      ; SWS[1:0] bits (System Clock Switch Status)
RCC_CFGR_SWS_0              EQU (0x00000004)      ;Bit 0
RCC_CFGR_SWS_1              EQU (0x00000008)      ;Bit 1

RCC_CFGR_SWS_MSI            EQU (0x00000000)      ; MSI oscillator used as system clock
RCC_CFGR_SWS_HSI            EQU (0x00000004)      ; HSI16 oscillator used as system clock
RCC_CFGR_SWS_HSE            EQU (0x00000008)      ; HSE oscillator used as system clock
RCC_CFGR_SWS_PLL            EQU (0x0000000C)      ; PLL used as system clock

; HPRE configuration
RCC_CFGR_HPRE               EQU (0x000000F0)      ; HPRE[3:0] bits (AHB prescaler)
RCC_CFGR_HPRE_0             EQU (0x00000010)      ;Bit 0
RCC_CFGR_HPRE_1             EQU (0x00000020)      ;Bit 1
RCC_CFGR_HPRE_2             EQU (0x00000040)      ;Bit 2
RCC_CFGR_HPRE_3             EQU (0x00000080)      ;Bit 3

RCC_CFGR_HPRE_DIV1          EQU (0x00000000)      ; SYSCLK not divided
RCC_CFGR_HPRE_DIV2          EQU (0x00000080)      ; SYSCLK divided by 2
RCC_CFGR_HPRE_DIV4          EQU (0x00000090)      ; SYSCLK divided by 4
RCC_CFGR_HPRE_DIV8          EQU (0x000000A0)      ; SYSCLK divided by 8
RCC_CFGR_HPRE_DIV16         EQU (0x000000B0)      ; SYSCLK divided by 16
RCC_CFGR_HPRE_DIV64         EQU (0x000000C0)      ; SYSCLK divided by 64
RCC_CFGR_HPRE_DIV128        EQU (0x000000D0)      ; SYSCLK divided by 128
RCC_CFGR_HPRE_DIV256        EQU (0x000000E0)      ; SYSCLK divided by 256
RCC_CFGR_HPRE_DIV512        EQU (0x000000F0)      ; SYSCLK divided by 512

; PPRE1 configuration
RCC_CFGR_PPRE1              EQU (0x00000700)      ; PRE1[2:0] bits (APB2 prescaler)
RCC_CFGR_PPRE1_0            EQU (0x00000100)      ;Bit 0
RCC_CFGR_PPRE1_1            EQU (0x00000200)      ;Bit 1
RCC_CFGR_PPRE1_2            EQU (0x00000400)      ;Bit 2

RCC_CFGR_PPRE1_DIV1         EQU (0x00000000)      ; HCLK not divided
RCC_CFGR_PPRE1_DIV2         EQU (0x00000400)      ; HCLK divided by 2
RCC_CFGR_PPRE1_DIV4         EQU (0x00000500)      ; HCLK divided by 4
RCC_CFGR_PPRE1_DIV8         EQU (0x00000600)      ; HCLK divided by 8
RCC_CFGR_PPRE1_DIV16        EQU (0x00000700)      ; HCLK divided by 16

; PPRE2 configuration
RCC_CFGR_PPRE2              EQU (0x00003800)      ; PRE2[2:0] bits (APB2 prescaler)
RCC_CFGR_PPRE2_0            EQU (0x00000800)      ;Bit 0
RCC_CFGR_PPRE2_1            EQU (0x00001000)      ;Bit 1
RCC_CFGR_PPRE2_2            EQU (0x00002000)      ;Bit 2

RCC_CFGR_PPRE2_DIV1         EQU (0x00000000)      ; HCLK not divided
RCC_CFGR_PPRE2_DIV2         EQU (0x00002000)      ; HCLK divided by 2
RCC_CFGR_PPRE2_DIV4         EQU (0x00002800)      ; HCLK divided by 4
RCC_CFGR_PPRE2_DIV8         EQU (0x00003000)      ; HCLK divided by 8
RCC_CFGR_PPRE2_DIV16        EQU (0x00003800)      ; HCLK divided by 16

RCC_CFGR_STOPWUCK           EQU (0x00008000)      ; Wake Up from stop and CSS backup clock selection

; MCOSEL configuration
RCC_CFGR_MCOSEL             EQU (0x07000000)      ; MCOSEL [2:0] bits (Clock output selection)
RCC_CFGR_MCOSEL_0           EQU (0x01000000)      ;Bit 0
RCC_CFGR_MCOSEL_1           EQU (0x02000000)      ;Bit 1
RCC_CFGR_MCOSEL_2           EQU (0x04000000)      ;Bit 2

RCC_CFGR_MCO_PRE            EQU (0x70000000)      ; MCO prescaler
RCC_CFGR_MCO_PRE_1          EQU (0x00000000)      ; MCO is divided by 1
RCC_CFGR_MCO_PRE_2          EQU (0x10000000)      ; MCO is divided by 2
RCC_CFGR_MCO_PRE_4          EQU (0x20000000)      ; MCO is divided by 4
RCC_CFGR_MCO_PRE_8          EQU (0x30000000)      ; MCO is divided by 8
RCC_CFGR_MCO_PRE_16         EQU (0x40000000)      ; MCO is divided by 16

; ********************  Bit definition for RCC_PLLCFGR register  **************
RCC_PLLCFGR_PLLSRC          EQU (0x00000003)

RCC_PLLCFGR_PLLSRC_MSI      EQU (0x00000001)      ; MSI oscillator source clock selected
RCC_PLLCFGR_PLLSRC_HSI      EQU (0x00000002)      ; HSI16 oscillator source clock selected
RCC_PLLCFGR_PLLSRC_HSE      EQU (0x00000003)      ; HSE oscillator source clock selected

RCC_PLLCFGR_PLLM            EQU (0x00000070)
RCC_PLLCFGR_PLLM_0          EQU (0x00000010)
RCC_PLLCFGR_PLLM_1          EQU (0x00000020)
RCC_PLLCFGR_PLLM_2          EQU (0x00000040)

RCC_PLLCFGR_PLLN            EQU (0x00007F00)
RCC_PLLCFGR_PLLN_0          EQU (0x00000100)
RCC_PLLCFGR_PLLN_1          EQU (0x00000200)
RCC_PLLCFGR_PLLN_2          EQU (0x00000400)
RCC_PLLCFGR_PLLN_3          EQU (0x00000800)
RCC_PLLCFGR_PLLN_4          EQU (0x00001000)
RCC_PLLCFGR_PLLN_5          EQU (0x00002000)
RCC_PLLCFGR_PLLN_6          EQU (0x00004000)

RCC_PLLCFGR_PLLPEN          EQU (0x00010000)
RCC_PLLCFGR_PLLP            EQU (0x00020000)
RCC_PLLCFGR_PLLQEN          EQU (0x00100000)

RCC_PLLCFGR_PLLQ            EQU (0x00600000)
RCC_PLLCFGR_PLLQ_0          EQU (0x00200000)
RCC_PLLCFGR_PLLQ_1          EQU (0x00400000)

RCC_PLLCFGR_PLLREN          EQU (0x01000000)
RCC_PLLCFGR_PLLR            EQU (0x06000000)
RCC_PLLCFGR_PLLR_0          EQU (0x02000000)
RCC_PLLCFGR_PLLR_1          EQU (0x04000000)

; ********************  Bit definition for RCC_PLLSAI1CFGR register  ***********
RCC_PLLSAI1CFGR_PLLSAI1N    EQU (0x00007F00)
RCC_PLLSAI1CFGR_PLLSAI1N_0  EQU (0x00000100)
RCC_PLLSAI1CFGR_PLLSAI1N_1  EQU (0x00000200)
RCC_PLLSAI1CFGR_PLLSAI1N_2  EQU (0x00000400)
RCC_PLLSAI1CFGR_PLLSAI1N_3  EQU (0x00000800)
RCC_PLLSAI1CFGR_PLLSAI1N_4  EQU (0x00001000)
RCC_PLLSAI1CFGR_PLLSAI1N_5  EQU (0x00002000)
RCC_PLLSAI1CFGR_PLLSAI1N_6  EQU (0x00004000)

RCC_PLLSAI1CFGR_PLLSAI1PEN  EQU (0x00010000)
RCC_PLLSAI1CFGR_PLLSAI1P    EQU (0x00020000)

