Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
RCC_PLLSAI1CFGR_PLLSAI1QEN  EQU (0x00100000)
RCC_PLLSAI1CFGR_PLLSAI1Q    EQU (0x00600000)
RCC_PLLSAI1CFGR_PLLSAI1Q_0  EQU (0x00200000)
RCC_PLLSAI1CFGR_PLLSAI1Q_1  EQU (0x00400000)

RCC_PLLSAI1CFGR_PLLSAI1REN  EQU (0x01000000)
RCC_PLLSAI1CFGR_PLLSAI1R    EQU (0x06000000)
RCC_PLLSAI1CFGR_PLLSAI1R_0  EQU (0x02000000)
RCC_PLLSAI1CFGR_PLLSAI1R_1  EQU (0x04000000)

; ********************  Bit definition for RCC_PLLSAI2CFGR register  ***********
RCC_PLLSAI2CFGR_PLLSAI2N    EQU (0x00007F00)
RCC_PLLSAI2CFGR_PLLSAI2N_0  EQU (0x00000100)
RCC_PLLSAI2CFGR_PLLSAI2N_1  EQU (0x00000200)
RCC_PLLSAI2CFGR_PLLSAI2N_2  EQU (0x00000400)
RCC_PLLSAI2CFGR_PLLSAI2N_3  EQU (0x00000800)
RCC_PLLSAI2CFGR_PLLSAI2N_4  EQU (0x00001000)
RCC_PLLSAI2CFGR_PLLSAI2N_5  EQU (0x00002000)
RCC_PLLSAI2CFGR_PLLSAI2N_6  EQU (0x00004000)

RCC_PLLSAI2CFGR_PLLSAI2PEN  EQU (0x00010000)
RCC_PLLSAI2CFGR_PLLSAI2P    EQU (0x00020000)

RCC_PLLSAI2CFGR_PLLSAI2REN  EQU (0x01000000)
RCC_PLLSAI2CFGR_PLLSAI2R    EQU (0x06000000)
RCC_PLLSAI2CFGR_PLLSAI2R_0  EQU (0x02000000)
RCC_PLLSAI2CFGR_PLLSAI2R_1  EQU (0x04000000)

; ********************  Bit definition for RCC_CIER register  *****************
RCC_CIER_LSIRDYIE           EQU (0x00000001)
RCC_CIER_LSERDYIE           EQU (0x00000002)
RCC_CIER_MSIRDYIE           EQU (0x00000004)
RCC_CIER_HSIRDYIE           EQU (0x00000008)
RCC_CIER_HSERDYIE           EQU (0x00000010)
RCC_CIER_PLLRDYIE           EQU (0x00000020)
RCC_CIER_PLLSAI1RDYIE       EQU (0x00000040)
RCC_CIER_PLLSAI2RDYIE       EQU (0x00000080)
RCC_CIER_LSECSSIE           EQU (0x00000200)

; ********************  Bit definition for RCC_CIFR register  *****************
RCC_CIFR_LSIRDYF            EQU (0x00000001)
RCC_CIFR_LSERDYF            EQU (0x00000002)
RCC_CIFR_MSIRDYF            EQU (0x00000004)
RCC_CIFR_HSIRDYF            EQU (0x00000008)
RCC_CIFR_HSERDYF            EQU (0x00000010)
RCC_CIFR_PLLRDYF            EQU (0x00000020)
RCC_CIFR_PLLSAI1RDYF        EQU (0x00000040)
RCC_CIFR_PLLSAI2RDYF        EQU (0x00000080)
RCC_CIFR_CSSF               EQU (0x00000100)
RCC_CIFR_LSECSSF            EQU (0x00000200)

; ********************  Bit definition for RCC_CICR register  *****************
RCC_CICR_LSIRDYC            EQU (0x00000001)
RCC_CICR_LSERDYC            EQU (0x00000002)
RCC_CICR_MSIRDYC            EQU (0x00000004)
RCC_CICR_HSIRDYC            EQU (0x00000008)
RCC_CICR_HSERDYC            EQU (0x00000010)
RCC_CICR_PLLRDYC            EQU (0x00000020)
RCC_CICR_PLLSAI1RDYC        EQU (0x00000040)
RCC_CICR_PLLSAI2RDYC        EQU (0x00000080)
RCC_CICR_CSSC               EQU (0x00000100)
RCC_CICR_LSECSSC            EQU (0x00000200)

; ********************  Bit definition for RCC_AHB1RSTR register  *************
RCC_AHB1RSTR_DMA1RST        EQU (0x00000001)
RCC_AHB1RSTR_DMA2RST        EQU (0x00000002)
RCC_AHB1RSTR_FLASHRST       EQU (0x00000100)
RCC_AHB1RSTR_CRCRST         EQU (0x00001000)
RCC_AHB1RSTR_TSCRST         EQU (0x00010000)

; ********************  Bit definition for RCC_AHB2RSTR register  *************
RCC_AHB2RSTR_GPIOARST       EQU (0x00000001)
RCC_AHB2RSTR_GPIOBRST       EQU (0x00000002)
RCC_AHB2RSTR_GPIOCRST       EQU (0x00000004)
RCC_AHB2RSTR_GPIODRST       EQU (0x00000008)
RCC_AHB2RSTR_GPIOERST       EQU (0x00000010)
RCC_AHB2RSTR_GPIOFRST       EQU (0x00000020)
RCC_AHB2RSTR_GPIOGRST       EQU (0x00000040)
RCC_AHB2RSTR_GPIOHRST       EQU (0x00000080)
RCC_AHB2RSTR_OTGFSRST       EQU (0x00001000)
RCC_AHB2RSTR_ADCRST         EQU (0x00002000)
RCC_AHB2RSTR_RNGRST         EQU (0x00040000)

; ********************  Bit definition for RCC_AHB3RSTR register  *************
RCC_AHB3RSTR_FMCRST         EQU (0x00000001)
RCC_AHB3RSTR_QSPIRST        EQU (0x00000100)

; ********************  Bit definition for RCC_APB1RSTR1 register  *************
RCC_APB1RSTR1_TIM2RST       EQU (0x00000001)
RCC_APB1RSTR1_TIM3RST       EQU (0x00000002)
RCC_APB1RSTR1_TIM4RST       EQU (0x00000004)
RCC_APB1RSTR1_TIM5RST       EQU (0x00000008)
RCC_APB1RSTR1_TIM6RST       EQU (0x00000010)
RCC_APB1RSTR1_TIM7RST       EQU (0x00000020)
RCC_APB1RSTR1_LCDRST        EQU (0x00000200)
RCC_APB1RSTR1_SPI2RST       EQU (0x00004000)
RCC_APB1RSTR1_SPI3RST       EQU (0x00008000)
RCC_APB1RSTR1_USART2RST     EQU (0x00020000)
RCC_APB1RSTR1_USART3RST     EQU (0x00040000)
RCC_APB1RSTR1_UART4RST      EQU (0x00080000)
RCC_APB1RSTR1_UART5RST      EQU (0x00100000)
RCC_APB1RSTR1_I2C1RST       EQU (0x00200000)
RCC_APB1RSTR1_I2C2RST       EQU (0x00400000)
RCC_APB1RSTR1_I2C3RST       EQU (0x00800000)
RCC_APB1RSTR1_CAN1RST       EQU (0x02000000)
RCC_APB1RSTR1_PWRRST        EQU (0x10000000)
RCC_APB1RSTR1_DAC1RST       EQU (0x20000000)
RCC_APB1RSTR1_OPAMPRST      EQU (0x40000000)
RCC_APB1RSTR1_LPTIM1RST     EQU (0x80000000)

; ********************  Bit definition for RCC_APB1RSTR2 register  *************
RCC_APB1RSTR2_LPUART1RST    EQU (0x00000001)
RCC_APB1RSTR2_SWPMI1RST     EQU (0x00000004)
RCC_APB1RSTR2_LPTIM2RST     EQU (0x00000020)

; ********************  Bit definition for RCC_APB2RSTR register  *************
RCC_APB2RSTR_SYSCFGRST      EQU (0x00000001)
RCC_APB2RSTR_SDMMC1RST      EQU (0x00000400)
RCC_APB2RSTR_TIM1RST        EQU (0x00000800)
RCC_APB2RSTR_SPI1RST        EQU (0x00001000)
RCC_APB2RSTR_TIM8RST        EQU (0x00002000)
RCC_APB2RSTR_USART1RST      EQU (0x00004000)
RCC_APB2RSTR_TIM15RST       EQU (0x00010000)
RCC_APB2RSTR_TIM16RST       EQU (0x00020000)
RCC_APB2RSTR_TIM17RST       EQU (0x00040000)
RCC_APB2RSTR_SAI1RST        EQU (0x00200000)
RCC_APB2RSTR_SAI2RST        EQU (0x00400000)
RCC_APB2RSTR_DFSDMRST       EQU (0x01000000)

; ********************  Bit definition for RCC_AHB1ENR register  **************
RCC_AHB1ENR_DMA1EN          EQU (0x00000001)
RCC_AHB1ENR_DMA2EN          EQU (0x00000002)
RCC_AHB1ENR_FLASHEN         EQU (0x00000100)
RCC_AHB1ENR_CRCEN           EQU (0x00001000)
RCC_AHB1ENR_TSCEN           EQU (0x00010000)

; ********************  Bit definition for RCC_AHB2ENR register  **************
RCC_AHB2ENR_GPIOAEN         EQU (0x00000001)
RCC_AHB2ENR_GPIOBEN         EQU (0x00000002)
RCC_AHB2ENR_GPIOCEN         EQU (0x00000004)
RCC_AHB2ENR_GPIODEN         EQU (0x00000008)
RCC_AHB2ENR_GPIOEEN         EQU (0x00000010)
RCC_AHB2ENR_GPIOFEN         EQU (0x00000020)
RCC_AHB2ENR_GPIOGEN         EQU (0x00000040)
RCC_AHB2ENR_GPIOHEN         EQU (0x00000080)
RCC_AHB2ENR_OTGFSEN         EQU (0x00001000)
RCC_AHB2ENR_ADCEN           EQU (0x00002000)
RCC_AHB2ENR_RNGEN           EQU (0x00040000)

; ********************  Bit definition for RCC_AHB3ENR register  **************
RCC_AHB3ENR_FMCEN           EQU (0x00000001)
RCC_AHB3ENR_QSPIEN          EQU (0x00000100)

