Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bit definition for RCC_APB1ENR1 register  **************
RCC_APB1ENR1_TIM2EN         EQU (0x00000001)
RCC_APB1ENR1_TIM3EN         EQU (0x00000002)
RCC_APB1ENR1_TIM4EN         EQU (0x00000004)
RCC_APB1ENR1_TIM5EN         EQU (0x00000008)
RCC_APB1ENR1_TIM6EN         EQU (0x00000010)
RCC_APB1ENR1_TIM7EN         EQU (0x00000020)
RCC_APB1ENR1_LCDEN          EQU (0x00000200)
RCC_APB1ENR1_WWDGEN         EQU (0x00000800)
RCC_APB1ENR1_SPI2EN         EQU (0x00004000)
RCC_APB1ENR1_SPI3EN         EQU (0x00008000)
RCC_APB1ENR1_USART2EN       EQU (0x00020000)
RCC_APB1ENR1_USART3EN       EQU (0x00040000)
RCC_APB1ENR1_UART4EN        EQU (0x00080000)
RCC_APB1ENR1_UART5EN        EQU (0x00100000)
RCC_APB1ENR1_I2C1EN         EQU (0x00200000)
RCC_APB1ENR1_I2C2EN         EQU (0x00400000)
RCC_APB1ENR1_I2C3EN         EQU (0x00800000)
RCC_APB1ENR1_CAN1EN         EQU (0x02000000)
RCC_APB1ENR1_PWREN          EQU (0x10000000)
RCC_APB1ENR1_DAC1EN         EQU (0x20000000)
RCC_APB1ENR1_OPAMPEN        EQU (0x40000000)
RCC_APB1ENR1_LPTIM1EN       EQU (0x80000000)

; ********************  Bit definition for RCC_APB1RSTR2 register  *************
RCC_APB1ENR2_LPUART1EN      EQU (0x00000001)
RCC_APB1ENR2_SWPMI1EN       EQU (0x00000004)
RCC_APB1ENR2_LPTIM2EN       EQU (0x00000020)

; ********************  Bit definition for RCC_APB2ENR register  **************
RCC_APB2ENR_SYSCFGEN        EQU (0x00000001)
RCC_APB2ENR_FWEN            EQU (0x00000080)
RCC_APB2ENR_SDMMC1EN        EQU (0x00000400)
RCC_APB2ENR_TIM1EN          EQU (0x00000800)
RCC_APB2ENR_SPI1EN          EQU (0x00001000)
RCC_APB2ENR_TIM8EN          EQU (0x00002000)
RCC_APB2ENR_USART1EN        EQU (0x00004000)
RCC_APB2ENR_TIM15EN         EQU (0x00010000)
RCC_APB2ENR_TIM16EN         EQU (0x00020000)
RCC_APB2ENR_TIM17EN         EQU (0x00040000)
RCC_APB2ENR_SAI1EN          EQU (0x00200000)
RCC_APB2ENR_SAI2EN          EQU (0x00400000)
RCC_APB2ENR_DFSDMEN         EQU (0x01000000)

; ********************  Bit definition for RCC_AHB1SMENR register  **************
RCC_AHB1SMENR_DMA1SMEN      EQU (0x00000001)
RCC_AHB1SMENR_DMA2SMEN      EQU (0x00000002)
RCC_AHB1SMENR_FLASHSMEN     EQU (0x00000100)
RCC_AHB1SMENR_SRAM1SMEN     EQU (0x00000200)
RCC_AHB1SMENR_CRCSMEN       EQU (0x00001000)
RCC_AHB1SMENR_TSCSMEN       EQU (0x00010000)

; ********************  Bit definition for RCC_AHB2SMENR register  ************
RCC_AHB2SMENR_GPIOASMEN     EQU (0x00000001)
RCC_AHB2SMENR_GPIOBSMEN     EQU (0x00000002)
RCC_AHB2SMENR_GPIOCSMEN     EQU (0x00000004)
RCC_AHB2SMENR_GPIODSMEN     EQU (0x00000008)
RCC_AHB2SMENR_GPIOESMEN     EQU (0x00000010)
RCC_AHB2SMENR_GPIOFSMEN     EQU (0x00000020)
RCC_AHB2SMENR_GPIOGSMEN     EQU (0x00000040)
RCC_AHB2SMENR_GPIOHSMEN     EQU (0x00000080)
RCC_AHB2SMENR_SRAM2SMEN     EQU (0x00000200)
RCC_AHB2SMENR_OTGFSSMEN     EQU (0x00001000)
RCC_AHB2SMENR_ADCSMEN       EQU (0x00002000)
RCC_AHB2SMENR_RNGSMEN       EQU (0x00040000)

; ********************  Bit definition for RCC_AHB3SMENR register  ************
RCC_AHB3SMENR_FMCSMEN       EQU (0x00000001)
RCC_AHB3SMENR_QSPISMEN      EQU (0x00000100)

; ********************  Bit definition for RCC_APB1SMENR1 register  ************
RCC_APB1SMENR1_TIM2SMEN     EQU (0x00000001)
RCC_APB1SMENR1_TIM3SMEN     EQU (0x00000002)
RCC_APB1SMENR1_TIM4SMEN     EQU (0x00000004)
RCC_APB1SMENR1_TIM5SMEN     EQU (0x00000008)
RCC_APB1SMENR1_TIM6SMEN     EQU (0x00000010)
RCC_APB1SMENR1_TIM7SMEN     EQU (0x00000020)
RCC_APB1SMENR1_LCDSMEN      EQU (0x00000200)
RCC_APB1SMENR1_WWDGSMEN     EQU (0x00000800)
RCC_APB1SMENR1_SPI2SMEN     EQU (0x00004000)
RCC_APB1SMENR1_SPI3SMEN     EQU (0x00008000)
RCC_APB1SMENR1_USART2SMEN   EQU (0x00020000)
RCC_APB1SMENR1_USART3SMEN   EQU (0x00040000)
RCC_APB1SMENR1_UART4SMEN    EQU (0x00080000)
RCC_APB1SMENR1_UART5SMEN    EQU (0x00100000)
RCC_APB1SMENR1_I2C1SMEN     EQU (0x00200000)
RCC_APB1SMENR1_I2C2SMEN     EQU (0x00400000)
RCC_APB1SMENR1_I2C3SMEN     EQU (0x00800000)
RCC_APB1SMENR1_CAN1SMEN     EQU (0x02000000)
RCC_APB1SMENR1_PWRSMEN      EQU (0x10000000)
RCC_APB1SMENR1_DAC1SMEN     EQU (0x20000000)
RCC_APB1SMENR1_OPAMPSMEN    EQU (0x40000000)
RCC_APB1SMENR1_LPTIM1SMEN   EQU (0x80000000)

; ********************  Bit definition for RCC_APB1SMENR2 register  ************
RCC_APB1SMENR2_LPUART1SMEN  EQU (0x00000001)
RCC_APB1SMENR2_SWPMI1SMEN   EQU (0x00000004)
RCC_APB1SMENR2_LPTIM2SMEN   EQU (0x00000020)

; ********************  Bit definition for RCC_APB2SMENR register  ************
RCC_APB2SMENR_SYSCFGSMEN    EQU (0x00000001)
RCC_APB2SMENR_SDMMC1SMEN    EQU (0x00000400)
RCC_APB2SMENR_TIM1SMEN      EQU (0x00000800)
RCC_APB2SMENR_SPI1SMEN      EQU (0x00001000)
RCC_APB2SMENR_TIM8SMEN      EQU (0x00002000)
RCC_APB2SMENR_USART1SMEN    EQU (0x00004000)
RCC_APB2SMENR_TIM15SMEN     EQU (0x00010000)
RCC_APB2SMENR_TIM16SMEN     EQU (0x00020000)
RCC_APB2SMENR_TIM17SMEN     EQU (0x00040000)
RCC_APB2SMENR_SAI1SMEN      EQU (0x00200000)
RCC_APB2SMENR_SAI2SMEN      EQU (0x00400000)
RCC_APB2SMENR_DFSDMSMEN     EQU (0x01000000)

; ********************  Bit definition for RCC_CCIPR register  *****************
RCC_CCIPR_USART1SEL         EQU (0x00000003)
RCC_CCIPR_USART1SEL_0       EQU (0x00000001)
RCC_CCIPR_USART1SEL_1       EQU (0x00000002)

RCC_CCIPR_USART2SEL         EQU (0x0000000C)
RCC_CCIPR_USART2SEL_0       EQU (0x00000004)
RCC_CCIPR_USART2SEL_1       EQU (0x00000008)

RCC_CCIPR_USART3SEL         EQU (0x00000030)
RCC_CCIPR_USART3SEL_0       EQU (0x00000010)
RCC_CCIPR_USART3SEL_1       EQU (0x00000020)

RCC_CCIPR_UART4SEL          EQU (0x000000C0)
RCC_CCIPR_UART4SEL_0        EQU (0x00000040)
RCC_CCIPR_UART4SEL_1        EQU (0x00000080)

RCC_CCIPR_UART5SEL          EQU (0x00000300)
RCC_CCIPR_UART5SEL_0        EQU (0x00000100)
RCC_CCIPR_UART5SEL_1        EQU (0x00000200)

RCC_CCIPR_LPUART1SEL        EQU (0x00000C00)
RCC_CCIPR_LPUART1SEL_0      EQU (0x00000400)
RCC_CCIPR_LPUART1SEL_1      EQU (0x00000800)

