Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
RCC_CCIPR_I2C1SEL           EQU (0x00003000)
RCC_CCIPR_I2C1SEL_0         EQU (0x00001000)
RCC_CCIPR_I2C1SEL_1         EQU (0x00002000)

RCC_CCIPR_I2C2SEL           EQU (0x0000C000)
RCC_CCIPR_I2C2SEL_0         EQU (0x00004000)
RCC_CCIPR_I2C2SEL_1         EQU (0x00008000)

RCC_CCIPR_I2C3SEL           EQU (0x00030000)
RCC_CCIPR_I2C3SEL_0         EQU (0x00010000)
RCC_CCIPR_I2C3SEL_1         EQU (0x00020000)

RCC_CCIPR_LPTIM1SEL         EQU (0x000C0000)
RCC_CCIPR_LPTIM1SEL_0       EQU (0x00040000)
RCC_CCIPR_LPTIM1SEL_1       EQU (0x00080000)

RCC_CCIPR_LPTIM2SEL         EQU (0x00300000)
RCC_CCIPR_LPTIM2SEL_0       EQU (0x00100000)
RCC_CCIPR_LPTIM2SEL_1       EQU (0x00200000)

RCC_CCIPR_SAI1SEL           EQU (0x00C00000)
RCC_CCIPR_SAI1SEL_0         EQU (0x00400000)
RCC_CCIPR_SAI1SEL_1         EQU (0x00800000)

RCC_CCIPR_SAI2SEL           EQU (0x03000000)
RCC_CCIPR_SAI2SEL_0         EQU (0x01000000)
RCC_CCIPR_SAI2SEL_1         EQU (0x02000000)

RCC_CCIPR_CLK48SEL          EQU (0x0C000000)
RCC_CCIPR_CLK48SEL_0        EQU (0x04000000)
RCC_CCIPR_CLK48SEL_1        EQU (0x08000000)

RCC_CCIPR_ADCSEL            EQU (0x30000000)
RCC_CCIPR_ADCSEL_0          EQU (0x10000000)
RCC_CCIPR_ADCSEL_1          EQU (0x20000000)

RCC_CCIPR_SWPMI1SEL         EQU (0x40000000)
RCC_CCIPR_DFSDMSEL          EQU (0x80000000)

; ********************  Bit definition for RCC_BDCR register  *****************
RCC_BDCR_LSEON              EQU (0x00000001)
RCC_BDCR_LSERDY             EQU (0x00000002)
RCC_BDCR_LSEBYP             EQU (0x00000004)

RCC_BDCR_LSEDRV             EQU (0x00000018)
RCC_BDCR_LSEDRV_0           EQU (0x00000008)
RCC_BDCR_LSEDRV_1           EQU (0x00000010)

RCC_BDCR_LSECSSON           EQU (0x00000020)
RCC_BDCR_LSECSSD            EQU (0x00000040)

RCC_BDCR_RTCSEL             EQU (0x00000300)
RCC_BDCR_RTCSEL_0           EQU (0x00000100)
RCC_BDCR_RTCSEL_1           EQU (0x00000200)

RCC_BDCR_RTCEN              EQU (0x00008000)
RCC_BDCR_BDRST              EQU (0x00010000)
RCC_BDCR_LSCOEN             EQU (0x01000000)
RCC_BDCR_LSCOSEL            EQU (0x02000000)

; ********************  Bit definition for RCC_CSR register  ******************
RCC_CSR_LSION               EQU (0x00000001)
RCC_CSR_LSIRDY              EQU (0x00000002)

RCC_CSR_MSISRANGE           EQU (0x00000F00)
RCC_CSR_MSISRANGE_1         EQU (0x00000400)      ; MSI frequency 1MHZ
RCC_CSR_MSISRANGE_2         EQU (0x00000500)      ; MSI frequency 2MHZ
RCC_CSR_MSISRANGE_4         EQU (0x00000600)      ; The default frequency 4MHZ
RCC_CSR_MSISRANGE_8         EQU (0x00000700)      ; MSI frequency 8MHZ

RCC_CSR_RMVF                EQU (0x00800000)
RCC_CSR_FWRSTF              EQU (0x01000000)
RCC_CSR_OBLRSTF             EQU (0x02000000)
RCC_CSR_PINRSTF             EQU (0x04000000)
RCC_CSR_BORRSTF             EQU (0x08000000)
RCC_CSR_SFTRSTF             EQU (0x10000000)
RCC_CSR_IWDGRSTF            EQU (0x20000000)
RCC_CSR_WWDGRSTF            EQU (0x40000000)
RCC_CSR_LPWRRSTF            EQU (0x80000000)



; *****************************************************************************
;
;                                    RNG
;
; *****************************************************************************
; ********************  Bits definition for RNG_CR register  ******************
RNG_CR_RNGEN                 EQU (0x00000004)
RNG_CR_IE     EQU (0x00000008)

; ********************  Bits definition for RNG_SR register  ******************
RNG_SR_DRDY                  EQU (0x00000001)
RNG_SR_CECS                  EQU (0x00000002)
RNG_SR_SECS                  EQU (0x00000004)
RNG_SR_CEIS                  EQU (0x00000020)
RNG_SR_SEIS                  EQU (0x00000040)

; *****************************************************************************
;
;                           Real-Time Clock (RTC)
;
; *****************************************************************************
; ********************  Bits definition for RTC_TR register  ******************
RTC_TR_PM     EQU (0x00400000)
RTC_TR_HT     EQU (0x00300000)
RTC_TR_HT_0                  EQU (0x00100000)
RTC_TR_HT_1                  EQU (0x00200000)
RTC_TR_HU     EQU (0x000F0000)
RTC_TR_HU_0                  EQU (0x00010000)
RTC_TR_HU_1                  EQU (0x00020000)
RTC_TR_HU_2                  EQU (0x00040000)
RTC_TR_HU_3                  EQU (0x00080000)
RTC_TR_MNT                   EQU (0x00007000)
RTC_TR_MNT_0                 EQU (0x00001000)
RTC_TR_MNT_1                 EQU (0x00002000)
RTC_TR_MNT_2                 EQU (0x00004000)
RTC_TR_MNU                   EQU (0x00000F00)
RTC_TR_MNU_0                 EQU (0x00000100)
RTC_TR_MNU_1                 EQU (0x00000200)
RTC_TR_MNU_2                 EQU (0x00000400)
RTC_TR_MNU_3                 EQU (0x00000800)
RTC_TR_ST     EQU (0x00000070)
RTC_TR_ST_0                  EQU (0x00000010)
RTC_TR_ST_1                  EQU (0x00000020)
RTC_TR_ST_2                  EQU (0x00000040)
RTC_TR_SU     EQU (0x0000000F)
RTC_TR_SU_0                  EQU (0x00000001)
RTC_TR_SU_1                  EQU (0x00000002)
RTC_TR_SU_2                  EQU (0x00000004)
RTC_TR_SU_3                  EQU (0x00000008)

; ********************  Bits definition for RTC_DR register  ******************
RTC_DR_YT     EQU (0x00F00000)
RTC_DR_YT_0                  EQU (0x00100000)
RTC_DR_YT_1                  EQU (0x00200000)
RTC_DR_YT_2                  EQU (0x00400000)
RTC_DR_YT_3                  EQU (0x00800000)
RTC_DR_YU     EQU (0x000F0000)
RTC_DR_YU_0                  EQU (0x00010000)
RTC_DR_YU_1                  EQU (0x00020000)
RTC_DR_YU_2                  EQU (0x00040000)
RTC_DR_YU_3                  EQU (0x00080000)
RTC_DR_WDU                   EQU (0x0000E000)
RTC_DR_WDU_0                 EQU (0x00002000)
RTC_DR_WDU_1                 EQU (0x00004000)
RTC_DR_WDU_2                 EQU (0x00008000)
RTC_DR_MT     EQU (0x00001000)
RTC_DR_MU     EQU (0x00000F00)
RTC_DR_MU_0                  EQU (0x00000100)
RTC_DR_MU_1                  EQU (0x00000200)
RTC_DR_MU_2                  EQU (0x00000400)
RTC_DR_MU_3                  EQU (0x00000800)
RTC_DR_DT     EQU (0x00000030)
RTC_DR_DT_0                  EQU (0x00000010)
RTC_DR_DT_1                  EQU (0x00000020)
RTC_DR_DU     EQU (0x0000000F)
RTC_DR_DU_0                  EQU (0x00000001)
RTC_DR_DU_1                  EQU (0x00000002)
RTC_DR_DU_2                  EQU (0x00000004)
RTC_DR_DU_3                  EQU (0x00000008)

