Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bits definition for RTC_CR register  ******************
RTC_CR_ITSE                  EQU (0x01000000)
RTC_CR_COE                   EQU (0x00800000)
RTC_CR_OSEL                  EQU (0x00600000)
RTC_CR_OSEL_0                EQU (0x00200000)
RTC_CR_OSEL_1                EQU (0x00400000)
RTC_CR_POL                   EQU (0x00100000)
RTC_CR_COSEL                 EQU (0x00080000)
RTC_CR_BCK                   EQU (0x00040000)
RTC_CR_SUB1H                 EQU (0x00020000)
RTC_CR_ADD1H                 EQU (0x00010000)
RTC_CR_TSIE                  EQU (0x00008000)
RTC_CR_WUTIE                 EQU (0x00004000)
RTC_CR_ALRBIE                EQU (0x00002000)
RTC_CR_ALRAIE                EQU (0x00001000)
RTC_CR_TSE                   EQU (0x00000800)
RTC_CR_WUTE                  EQU (0x00000400)
RTC_CR_ALRBE                 EQU (0x00000200)
RTC_CR_ALRAE                 EQU (0x00000100)
RTC_CR_FMT                   EQU (0x00000040)
RTC_CR_BYPSHAD               EQU (0x00000020)
RTC_CR_REFCKON               EQU (0x00000010)
RTC_CR_TSEDGE                EQU (0x00000008)
RTC_CR_WUCKSEL               EQU (0x00000007)
RTC_CR_WUCKSEL_0             EQU (0x00000001)
RTC_CR_WUCKSEL_1             EQU (0x00000002)
RTC_CR_WUCKSEL_2             EQU (0x00000004)

; ********************  Bits definition for RTC_ISR register  *****************
RTC_ISR_ITSF                 EQU (0x00020000)
RTC_ISR_RECALPF              EQU (0x00010000)
RTC_ISR_TAMP3F               EQU (0x00008000)
RTC_ISR_TAMP2F               EQU (0x00004000)
RTC_ISR_TAMP1F               EQU (0x00002000)
RTC_ISR_TSOVF                EQU (0x00001000)
RTC_ISR_TSF                  EQU (0x00000800)
RTC_ISR_WUTF                 EQU (0x00000400)
RTC_ISR_ALRBF                EQU (0x00000200)
RTC_ISR_ALRAF                EQU (0x00000100)
RTC_ISR_INIT                 EQU (0x00000080)
RTC_ISR_INITF                EQU (0x00000040)
RTC_ISR_RSF                  EQU (0x00000020)
RTC_ISR_INITS                EQU (0x00000010)
RTC_ISR_SHPF                 EQU (0x00000008)
RTC_ISR_WUTWF                EQU (0x00000004)
RTC_ISR_ALRBWF               EQU (0x00000002)
RTC_ISR_ALRAWF               EQU (0x00000001)

; ********************  Bits definition for RTC_PRER register  ****************
RTC_PRER_PREDIV_A            EQU (0x007F0000)
RTC_PRER_PREDIV_S            EQU (0x00007FFF)

; ********************  Bits definition for RTC_WUTR register  ****************
RTC_WUTR_WUT                 EQU (0x0000FFFF)

; ********************  Bits definition for RTC_ALRMAR register  **************
RTC_ALRMAR_MSK4              EQU (0x80000000)
RTC_ALRMAR_WDSEL             EQU (0x40000000)
RTC_ALRMAR_DT                EQU (0x30000000)
RTC_ALRMAR_DT_0              EQU (0x10000000)
RTC_ALRMAR_DT_1              EQU (0x20000000)
RTC_ALRMAR_DU                EQU (0x0F000000)
RTC_ALRMAR_DU_0              EQU (0x01000000)
RTC_ALRMAR_DU_1              EQU (0x02000000)
RTC_ALRMAR_DU_2              EQU (0x04000000)
RTC_ALRMAR_DU_3              EQU (0x08000000)
RTC_ALRMAR_MSK3              EQU (0x00800000)
RTC_ALRMAR_PM                EQU (0x00400000)
RTC_ALRMAR_HT                EQU (0x00300000)
RTC_ALRMAR_HT_0              EQU (0x00100000)
RTC_ALRMAR_HT_1              EQU (0x00200000)
RTC_ALRMAR_HU                EQU (0x000F0000)
RTC_ALRMAR_HU_0              EQU (0x00010000)
RTC_ALRMAR_HU_1              EQU (0x00020000)
RTC_ALRMAR_HU_2              EQU (0x00040000)
RTC_ALRMAR_HU_3              EQU (0x00080000)
RTC_ALRMAR_MSK2              EQU (0x00008000)
RTC_ALRMAR_MNT               EQU (0x00007000)
RTC_ALRMAR_MNT_0             EQU (0x00001000)
RTC_ALRMAR_MNT_1             EQU (0x00002000)
RTC_ALRMAR_MNT_2             EQU (0x00004000)
RTC_ALRMAR_MNU               EQU (0x00000F00)
RTC_ALRMAR_MNU_0             EQU (0x00000100)
RTC_ALRMAR_MNU_1             EQU (0x00000200)
RTC_ALRMAR_MNU_2             EQU (0x00000400)
RTC_ALRMAR_MNU_3             EQU (0x00000800)
RTC_ALRMAR_MSK1              EQU (0x00000080)
RTC_ALRMAR_ST                EQU (0x00000070)
RTC_ALRMAR_ST_0              EQU (0x00000010)
RTC_ALRMAR_ST_1              EQU (0x00000020)
RTC_ALRMAR_ST_2              EQU (0x00000040)
RTC_ALRMAR_SU                EQU (0x0000000F)
RTC_ALRMAR_SU_0              EQU (0x00000001)
RTC_ALRMAR_SU_1              EQU (0x00000002)
RTC_ALRMAR_SU_2              EQU (0x00000004)
RTC_ALRMAR_SU_3              EQU (0x00000008)

; ********************  Bits definition for RTC_ALRMBR register  **************
RTC_ALRMBR_MSK4              EQU (0x80000000)
RTC_ALRMBR_WDSEL             EQU (0x40000000)
RTC_ALRMBR_DT                EQU (0x30000000)
RTC_ALRMBR_DT_0              EQU (0x10000000)
RTC_ALRMBR_DT_1              EQU (0x20000000)
RTC_ALRMBR_DU                EQU (0x0F000000)
RTC_ALRMBR_DU_0              EQU (0x01000000)
RTC_ALRMBR_DU_1              EQU (0x02000000)
RTC_ALRMBR_DU_2              EQU (0x04000000)
RTC_ALRMBR_DU_3              EQU (0x08000000)
RTC_ALRMBR_MSK3              EQU (0x00800000)
RTC_ALRMBR_PM                EQU (0x00400000)
RTC_ALRMBR_HT                EQU (0x00300000)
RTC_ALRMBR_HT_0              EQU (0x00100000)
RTC_ALRMBR_HT_1              EQU (0x00200000)
RTC_ALRMBR_HU                EQU (0x000F0000)
RTC_ALRMBR_HU_0              EQU (0x00010000)
RTC_ALRMBR_HU_1              EQU (0x00020000)
RTC_ALRMBR_HU_2              EQU (0x00040000)
RTC_ALRMBR_HU_3              EQU (0x00080000)
RTC_ALRMBR_MSK2              EQU (0x00008000)
RTC_ALRMBR_MNT               EQU (0x00007000)
RTC_ALRMBR_MNT_0             EQU (0x00001000)
RTC_ALRMBR_MNT_1             EQU (0x00002000)
RTC_ALRMBR_MNT_2             EQU (0x00004000)
RTC_ALRMBR_MNU               EQU (0x00000F00)
RTC_ALRMBR_MNU_0             EQU (0x00000100)
RTC_ALRMBR_MNU_1             EQU (0x00000200)
RTC_ALRMBR_MNU_2             EQU (0x00000400)
RTC_ALRMBR_MNU_3             EQU (0x00000800)
RTC_ALRMBR_MSK1              EQU (0x00000080)
RTC_ALRMBR_ST                EQU (0x00000070)
RTC_ALRMBR_ST_0              EQU (0x00000010)
RTC_ALRMBR_ST_1              EQU (0x00000020)
RTC_ALRMBR_ST_2              EQU (0x00000040)
RTC_ALRMBR_SU                EQU (0x0000000F)
RTC_ALRMBR_SU_0              EQU (0x00000001)
RTC_ALRMBR_SU_1              EQU (0x00000002)
RTC_ALRMBR_SU_2              EQU (0x00000004)
RTC_ALRMBR_SU_3              EQU (0x00000008)

; ********************  Bits definition for RTC_WPR register  *****************
RTC_WPR_KEY                  EQU (0x000000FF)

; ********************  Bits definition for RTC_SSR register  *****************
RTC_SSR_SS                   EQU (0x0000FFFF)

; ********************  Bits definition for RTC_SHIFTR register  **************
RTC_SHIFTR_SUBFS             EQU (0x00007FFF)
RTC_SHIFTR_ADD1S             EQU (0x80000000)

; ********************  Bits definition for RTC_TSTR register  ****************
RTC_TSTR_PM                  EQU (0x00400000)
RTC_TSTR_HT                  EQU (0x00300000)
RTC_TSTR_HT_0                EQU (0x00100000)
RTC_TSTR_HT_1                EQU (0x00200000)
RTC_TSTR_HU                  EQU (0x000F0000)
RTC_TSTR_HU_0                EQU (0x00010000)
RTC_TSTR_HU_1                EQU (0x00020000)
RTC_TSTR_HU_2                EQU (0x00040000)
RTC_TSTR_HU_3                EQU (0x00080000)
RTC_TSTR_MNT                 EQU (0x00007000)
RTC_TSTR_MNT_0               EQU (0x00001000)
RTC_TSTR_MNT_1               EQU (0x00002000)
RTC_TSTR_MNT_2               EQU (0x00004000)
RTC_TSTR_MNU                 EQU (0x00000F00)
RTC_TSTR_MNU_0               EQU (0x00000100)
RTC_TSTR_MNU_1               EQU (0x00000200)
RTC_TSTR_MNU_2               EQU (0x00000400)
RTC_TSTR_MNU_3               EQU (0x00000800)
RTC_TSTR_ST                  EQU (0x00000070)
RTC_TSTR_ST_0                EQU (0x00000010)
RTC_TSTR_ST_1                EQU (0x00000020)
RTC_TSTR_ST_2                EQU (0x00000040)
RTC_TSTR_SU                  EQU (0x0000000F)
RTC_TSTR_SU_0                EQU (0x00000001)
RTC_TSTR_SU_1                EQU (0x00000002)
RTC_TSTR_SU_2                EQU (0x00000004)
RTC_TSTR_SU_3                EQU (0x00000008)

; ********************  Bits definition for RTC_TSDR register  ****************
RTC_TSDR_WDU                 EQU (0x0000E000)
RTC_TSDR_WDU_0               EQU (0x00002000)
RTC_TSDR_WDU_1               EQU (0x00004000)
RTC_TSDR_WDU_2               EQU (0x00008000)
RTC_TSDR_MT                  EQU (0x00001000)
RTC_TSDR_MU                  EQU (0x00000F00)
RTC_TSDR_MU_0                EQU (0x00000100)
RTC_TSDR_MU_1                EQU (0x00000200)
RTC_TSDR_MU_2                EQU (0x00000400)
RTC_TSDR_MU_3                EQU (0x00000800)
RTC_TSDR_DT                  EQU (0x00000030)
RTC_TSDR_DT_0                EQU (0x00000010)
RTC_TSDR_DT_1                EQU (0x00000020)
RTC_TSDR_DU                  EQU (0x0000000F)
RTC_TSDR_DU_0                EQU (0x00000001)
RTC_TSDR_DU_1                EQU (0x00000002)
RTC_TSDR_DU_2                EQU (0x00000004)
RTC_TSDR_DU_3                EQU (0x00000008)

; ********************  Bits definition for RTC_TSSSR register  ***************
RTC_TSSSR_SS                 EQU (0x0000FFFF)

; ********************  Bits definition for RTC_CAL register  ****************
RTC_CALR_CALP                EQU (0x00008000)
RTC_CALR_CALW8               EQU (0x00004000)
RTC_CALR_CALW16              EQU (0x00002000)
RTC_CALR_CALM                EQU (0x000001FF)
RTC_CALR_CALM_0              EQU (0x00000001)
RTC_CALR_CALM_1              EQU (0x00000002)
RTC_CALR_CALM_2              EQU (0x00000004)
RTC_CALR_CALM_3              EQU (0x00000008)
RTC_CALR_CALM_4              EQU (0x00000010)
RTC_CALR_CALM_5              EQU (0x00000020)
RTC_CALR_CALM_6              EQU (0x00000040)
RTC_CALR_CALM_7              EQU (0x00000080)
RTC_CALR_CALM_8              EQU (0x00000100)

; ********************  Bits definition for RTC_TAMPCR register  **************
RTC_TAMPCR_TAMP3MF           EQU (0x01000000)
RTC_TAMPCR_TAMP3NOERASE      EQU (0x00800000)
RTC_TAMPCR_TAMP3IE           EQU (0x00400000)
RTC_TAMPCR_TAMP2MF           EQU (0x00200000)
RTC_TAMPCR_TAMP2NOERASE      EQU (0x00100000)
RTC_TAMPCR_TAMP2IE           EQU (0x00080000)
RTC_TAMPCR_TAMP1MF           EQU (0x00040000)
RTC_TAMPCR_TAMP1NOERASE      EQU (0x00020000)
RTC_TAMPCR_TAMP1IE           EQU (0x00010000)
RTC_TAMPCR_TAMPPUDIS         EQU (0x00008000)
RTC_TAMPCR_TAMPPRCH          EQU (0x00006000)
RTC_TAMPCR_TAMPPRCH_0        EQU (0x00002000)
RTC_TAMPCR_TAMPPRCH_1        EQU (0x00004000)
RTC_TAMPCR_TAMPFLT           EQU (0x00001800)
RTC_TAMPCR_TAMPFLT_0         EQU (0x00000800)
RTC_TAMPCR_TAMPFLT_1         EQU (0x00001000)
RTC_TAMPCR_TAMPFREQ          EQU (0x00000700)
RTC_TAMPCR_TAMPFREQ_0        EQU (0x00000100)
RTC_TAMPCR_TAMPFREQ_1        EQU (0x00000200)
RTC_TAMPCR_TAMPFREQ_2        EQU (0x00000400)
RTC_TAMPCR_TAMPTS            EQU (0x00000080)
RTC_TAMPCR_TAMP3TRG          EQU (0x00000040)
RTC_TAMPCR_TAMP3E            EQU (0x00000020)
RTC_TAMPCR_TAMP2TRG          EQU (0x00000010)
RTC_TAMPCR_TAMP2E            EQU (0x00000008)
RTC_TAMPCR_TAMPIE            EQU (0x00000004)
RTC_TAMPCR_TAMP1TRG          EQU (0x00000002)
RTC_TAMPCR_TAMP1E            EQU (0x00000001)

; ********************  Bits definition for RTC_ALRMASSR register  ************
RTC_ALRMASSR_MASKSS          EQU (0x0F000000)
RTC_ALRMASSR_MASKSS_0        EQU (0x01000000)
RTC_ALRMASSR_MASKSS_1        EQU (0x02000000)
RTC_ALRMASSR_MASKSS_2        EQU (0x04000000)
RTC_ALRMASSR_MASKSS_3        EQU (0x08000000)
RTC_ALRMASSR_SS              EQU (0x00007FFF)

; ********************  Bits definition for RTC_ALRMBSSR register  ************
RTC_ALRMBSSR_MASKSS          EQU (0x0F000000)
RTC_ALRMBSSR_MASKSS_0        EQU (0x01000000)
RTC_ALRMBSSR_MASKSS_1        EQU (0x02000000)
RTC_ALRMBSSR_MASKSS_2        EQU (0x04000000)
RTC_ALRMBSSR_MASKSS_3        EQU (0x08000000)
RTC_ALRMBSSR_SS              EQU (0x00007FFF)

