Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bits definition for RTC_0R register  ******************
RTC_OR_OUT_RMP              EQU (0x00000002)
RTC_OR_ALARMOUTTYPE         EQU (0x00000001)


; ********************  Bits definition for RTC_BKP0R register  ***************
RTC_BKP0R_MASK     EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP1R register  ***************
RTC_BKP1R_MASK     EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP2R register  ***************
RTC_BKP2R_MASK     EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP3R register  ***************
RTC_BKP3R_MASK     EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP4R register  ***************
RTC_BKP4R_MASK     EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP5R register  ***************
RTC_BKP5R_MASK     EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP6R register  ***************
RTC_BKP6R_MASK     EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP7R register  ***************
RTC_BKP7R_MASK     EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP8R register  ***************
RTC_BKP8R_MASK     EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP9R register  ***************
RTC_BKP9R_MASK     EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP10R register  **************
RTC_BKP10R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP11R register  **************
RTC_BKP11R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP12R register  **************
RTC_BKP12R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP13R register  **************
RTC_BKP13R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP14R register  **************
RTC_BKP14R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP15R register  **************
RTC_BKP15R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP16R register  **************
RTC_BKP16R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP17R register  **************
RTC_BKP17R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP18R register  **************
RTC_BKP18R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP19R register  **************
RTC_BKP19R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP20R register  **************
RTC_BKP20R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP21R register  **************
RTC_BKP21R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP22R register  **************
RTC_BKP22R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP23R register  **************
RTC_BKP23R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP24R register  **************
RTC_BKP24R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP25R register  **************
RTC_BKP25R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP26R register  **************
RTC_BKP26R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP27R register  **************
RTC_BKP27R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP28R register  **************
RTC_BKP28R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP29R register  **************
RTC_BKP29R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP30R register  **************
RTC_BKP30R_MASK                   EQU (0xFFFFFFFF)

; ********************  Bits definition for RTC_BKP31R register  **************
RTC_BKP31R_MASK                   EQU (0xFFFFFFFF)

; ******************** Number of backup registers *****************************
RTC_BKP_NUMBER               EQU (0x00000020)

; *****************************************************************************
;
;                          Serial Audio Interface
;
; *****************************************************************************
; ********************  Bit definition for SAI_GCR register  ******************
SAI_GCR_SYNCIN          EQU (0x00000003)        ;SYNCIN[1:0] bits (Synchronization Inputs)
SAI_GCR_SYNCIN_0        EQU (0x00000001)        ;Bit 0
SAI_GCR_SYNCIN_1        EQU (0x00000002)        ;Bit 1

SAI_GCR_SYNCOUT         EQU (0x00000030)        ;SYNCOUT[1:0] bits (Synchronization Outputs)
SAI_GCR_SYNCOUT_0       EQU (0x00000010)        ;Bit 0
SAI_GCR_SYNCOUT_1       EQU (0x00000020)        ;Bit 1

; *******************  Bit definition for SAI_xCR1 register  ******************
SAI_xCR1_MODE            EQU (0x00000003)        ;MODE[1:0] bits (Audio Block Mode)
SAI_xCR1_MODE_0          EQU (0x00000001)        ;Bit 0
SAI_xCR1_MODE_1          EQU (0x00000002)        ;Bit 1

SAI_xCR1_PRTCFG          EQU (0x0000000C)        ;PRTCFG[1:0] bits (Protocol Configuration)
SAI_xCR1_PRTCFG_0        EQU (0x00000004)        ;Bit 0
SAI_xCR1_PRTCFG_1        EQU (0x00000008)        ;Bit 1

SAI_xCR1_DS              EQU (0x000000E0)        ;DS[1:0] bits (Data Size)
SAI_xCR1_DS_0            EQU (0x00000020)        ;Bit 0
SAI_xCR1_DS_1            EQU (0x00000040)        ;Bit 1
SAI_xCR1_DS_2            EQU (0x00000080)        ;Bit 2

SAI_xCR1_LSBFIRST        EQU (0x00000100)        ;LSB First Configuration
SAI_xCR1_CKSTR           EQU (0x00000200)        ;ClocK STRobing edge

SAI_xCR1_SYNCEN          EQU (0x00000C00)        ;SYNCEN[1:0](SYNChronization ENable)
SAI_xCR1_SYNCEN_0        EQU (0x00000400)        ;Bit 0
SAI_xCR1_SYNCEN_1        EQU (0x00000800)        ;Bit 1

