Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
SAI_xCR1_MONO            EQU (0x00001000)        ;Mono mode
SAI_xCR1_OUTDRIV         EQU (0x00002000)        ;Output Drive
SAI_xCR1_SAIEN           EQU (0x00010000)        ;Audio Block enable
SAI_xCR1_DMAEN           EQU (0x00020000)        ;DMA enable
SAI_xCR1_NODIV           EQU (0x00080000)        ;No Divider Configuration

SAI_xCR1_MCKDIV          EQU (0x00F00000)        ;MCKDIV[3:0] (Master ClocK Divider)
SAI_xCR1_MCKDIV_0        EQU (0x00100000)        ;Bit 0
SAI_xCR1_MCKDIV_1        EQU (0x00200000)        ;Bit 1
SAI_xCR1_MCKDIV_2        EQU (0x00400000)        ;Bit 2
SAI_xCR1_MCKDIV_3        EQU (0x00800000)        ;Bit 3

; *******************  Bit definition for SAI_xCR2 register  ******************
SAI_xCR2_FTH             EQU (0x00000007)        ;FTH[2:0](Fifo THreshold)
SAI_xCR2_FTH_0           EQU (0x00000001)        ;Bit 0
SAI_xCR2_FTH_1           EQU (0x00000002)        ;Bit 1
SAI_xCR2_FTH_2           EQU (0x00000004)        ;Bit 2

SAI_xCR2_FFLUSH          EQU (0x00000008)        ;Fifo FLUSH
SAI_xCR2_TRIS            EQU (0x00000010)        ;TRIState Management on data line
SAI_xCR2_MUTE            EQU (0x00000020)        ;Mute mode
SAI_xCR2_MUTEVAL         EQU (0x00000040)        ;Muate value


SAI_xCR2_MUTECNT         EQU (0x00001F80)        ;MUTECNT[5:0] (MUTE counter)
SAI_xCR2_MUTECNT_0       EQU (0x00000080)        ;Bit 0
SAI_xCR2_MUTECNT_1       EQU (0x00000100)        ;Bit 1
SAI_xCR2_MUTECNT_2       EQU (0x00000200)        ;Bit 2
SAI_xCR2_MUTECNT_3       EQU (0x00000400)        ;Bit 3
SAI_xCR2_MUTECNT_4       EQU (0x00000800)        ;Bit 4
SAI_xCR2_MUTECNT_5       EQU (0x00001000)        ;Bit 5

SAI_xCR2_CPL             EQU (0x00002000)        ;CPL mode
SAI_xCR2_COMP            EQU (0x0000C000)        ;COMP[1:0] (Companding mode)
SAI_xCR2_COMP_0          EQU (0x00004000)        ;Bit 0
SAI_xCR2_COMP_1          EQU (0x00008000)        ;Bit 1


; ******************  Bit definition for SAI_xFRCR register  ******************
SAI_xFRCR_FRL            EQU (0x000000FF)        ;FRL[7:0](Frame length)
SAI_xFRCR_FRL_0          EQU (0x00000001)        ;Bit 0
SAI_xFRCR_FRL_1          EQU (0x00000002)        ;Bit 1
SAI_xFRCR_FRL_2          EQU (0x00000004)        ;Bit 2
SAI_xFRCR_FRL_3          EQU (0x00000008)        ;Bit 3
SAI_xFRCR_FRL_4          EQU (0x00000010)        ;Bit 4
SAI_xFRCR_FRL_5          EQU (0x00000020)        ;Bit 5
SAI_xFRCR_FRL_6          EQU (0x00000040)        ;Bit 6
SAI_xFRCR_FRL_7          EQU (0x00000080)        ;Bit 7

SAI_xFRCR_FSALL          EQU (0x00007F00)        ;FRL[6:0] (Frame synchronization active level length)
SAI_xFRCR_FSALL_0        EQU (0x00000100)        ;Bit 0
SAI_xFRCR_FSALL_1        EQU (0x00000200)        ;Bit 1
SAI_xFRCR_FSALL_2        EQU (0x00000400)        ;Bit 2
SAI_xFRCR_FSALL_3        EQU (0x00000800)        ;Bit 3
SAI_xFRCR_FSALL_4        EQU (0x00001000)        ;Bit 4
SAI_xFRCR_FSALL_5        EQU (0x00002000)        ;Bit 5
SAI_xFRCR_FSALL_6        EQU (0x00004000)        ;Bit 6

SAI_xFRCR_FSDEF          EQU (0x00010000)        ; Frame Synchronization Definition
SAI_xFRCR_FSPO           EQU (0x00020000)        ;Frame Synchronization POLarity
SAI_xFRCR_FSOFF          EQU (0x00040000)        ;Frame Synchronization OFFset

; ******************  Bit definition for SAI_xSLOTR register  ******************
SAI_xSLOTR_FBOFF         EQU (0x0000001F)        ;FRL[4:0](First Bit Offset)
SAI_xSLOTR_FBOFF_0       EQU (0x00000001)        ;Bit 0
SAI_xSLOTR_FBOFF_1       EQU (0x00000002)        ;Bit 1
SAI_xSLOTR_FBOFF_2       EQU (0x00000004)        ;Bit 2
SAI_xSLOTR_FBOFF_3       EQU (0x00000008)        ;Bit 3
SAI_xSLOTR_FBOFF_4       EQU (0x00000010)        ;Bit 4

SAI_xSLOTR_SLOTSZ        EQU (0x000000C0)        ;SLOTSZ[1:0] (Slot size)
SAI_xSLOTR_SLOTSZ_0      EQU (0x00000040)        ;Bit 0
SAI_xSLOTR_SLOTSZ_1      EQU (0x00000080)        ;Bit 1

SAI_xSLOTR_NBSLOT        EQU (0x00000F00)        ;NBSLOT[3:0] (Number of Slot in audio Frame)
SAI_xSLOTR_NBSLOT_0      EQU (0x00000100)        ;Bit 0
SAI_xSLOTR_NBSLOT_1      EQU (0x00000200)        ;Bit 1
SAI_xSLOTR_NBSLOT_2      EQU (0x00000400)        ;Bit 2
SAI_xSLOTR_NBSLOT_3      EQU (0x00000800)        ;Bit 3

SAI_xSLOTR_SLOTEN        EQU (0xFFFF0000)        ;SLOTEN[15:0] (Slot Enable)

; *******************  Bit definition for SAI_xIMR register  ******************
SAI_xIMR_OVRUDRIE        EQU (0x00000001)        ;Overrun underrun interrupt enable
SAI_xIMR_MUTEDETIE       EQU (0x00000002)        ;Mute detection interrupt enable
SAI_xIMR_WCKCFGIE        EQU (0x00000004)        ;Wrong Clock Configuration interrupt enable
SAI_xIMR_FREQIE          EQU (0x00000008)        ;FIFO request interrupt enable
SAI_xIMR_CNRDYIE         EQU (0x00000010)        ;Codec not ready interrupt enable
SAI_xIMR_AFSDETIE        EQU (0x00000020)        ;Anticipated frame synchronization detection interrupt enable
SAI_xIMR_LFSDETIE        EQU (0x00000040)        ;Late frame synchronization detection interrupt enable

; ********************  Bit definition for SAI_xSR register  ******************
SAI_xSR_OVRUDR           EQU (0x00000001)         ;Overrun underrun
SAI_xSR_MUTEDET          EQU (0x00000002)         ;Mute detection
SAI_xSR_WCKCFG           EQU (0x00000004)         ;Wrong Clock Configuration
SAI_xSR_FREQ             EQU (0x00000008)         ;FIFO request
SAI_xSR_CNRDY            EQU (0x00000010)         ;Codec not ready
SAI_xSR_AFSDET           EQU (0x00000020)         ;Anticipated frame synchronization detection
SAI_xSR_LFSDET           EQU (0x00000040)         ;Late frame synchronization detection

SAI_xSR_FLVL             EQU (0x00070000)         ;FLVL[2:0] (FIFO Level Threshold)
SAI_xSR_FLVL_0           EQU (0x00010000)         ;Bit 0
SAI_xSR_FLVL_1           EQU (0x00020000)         ;Bit 1
SAI_xSR_FLVL_2           EQU (0x00030000)         ;Bit 2

; ******************  Bit definition for SAI_xCLRFR register  *****************
SAI_xCLRFR_COVRUDR       EQU (0x00000001)        ;Clear Overrun underrun
SAI_xCLRFR_CMUTEDET      EQU (0x00000002)        ;Clear Mute detection
SAI_xCLRFR_CWCKCFG       EQU (0x00000004)        ;Clear Wrong Clock Configuration
SAI_xCLRFR_CFREQ         EQU (0x00000008)        ;Clear FIFO request
SAI_xCLRFR_CCNRDY        EQU (0x00000010)        ;Clear Codec not ready
SAI_xCLRFR_CAFSDET       EQU (0x00000020)        ;Clear Anticipated frame synchronization detection
SAI_xCLRFR_CLFSDET       EQU (0x00000040)        ;Clear Late frame synchronization detection

; ******************  Bit definition for SAI_xDR register  *****************
SAI_xDR_DATA             EQU (0xFFFFFFFF)

