Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *****************************************************************************
;
;                          LCD Controller (LCD)
;
; *****************************************************************************

; *******************  Bit definition for LCD_CR register  ********************
LCD_CR_LCDEN       EQU (0x00000001)     ; LCD Enable Bit
LCD_CR_VSEL        EQU (0x00000002)     ; Voltage source selector Bit

LCD_CR_DUTY        EQU (0x0000001C)     ; DUTY[2:0] bits (Duty selector)
LCD_CR_DUTY_0      EQU (0x00000004)     ; Duty selector Bit 0
LCD_CR_DUTY_1      EQU (0x00000008)     ; Duty selector Bit 1
LCD_CR_DUTY_2      EQU (0x00000010)     ; Duty selector Bit 2

LCD_CR_BIAS        EQU (0x00000060)     ; BIAS[1:0] bits (Bias selector)
LCD_CR_BIAS_0      EQU (0x00000020)     ; Bias selector Bit 0
LCD_CR_BIAS_1      EQU (0x00000040)     ; Bias selector Bit 1

LCD_CR_MUX_SEG     EQU (0x00000080)     ; Mux Segment Enable Bit
LCD_CR_BUFEN       EQU (0x00000100)     ; Voltage output buffer enable

; *******************  Bit definition for LCD_FCR register  *******************
LCD_FCR_HD         EQU (0x00000001)     ; High Drive Enable Bit
LCD_FCR_SOFIE      EQU (0x00000002)     ; Start of Frame Interrupt Enable Bit
LCD_FCR_UDDIE      EQU (0x00000008)     ; Update Display Done Interrupt Enable Bit

LCD_FCR_PON        EQU (0x00000070)     ; PON[2:0] bits (Pulse ON Duration)
LCD_FCR_PON_0      EQU (0x00000010)     ; Bit 0
LCD_FCR_PON_1      EQU (0x00000020)     ; Bit 1
LCD_FCR_PON_2      EQU (0x00000040)     ; Bit 2

LCD_FCR_DEAD       EQU (0x00000380)     ; DEAD[2:0] bits (DEAD Time)
LCD_FCR_DEAD_0     EQU (0x00000080)     ; Bit 0
LCD_FCR_DEAD_1     EQU (0x00000100)     ; Bit 1
LCD_FCR_DEAD_2     EQU (0x00000200)     ; Bit 2

LCD_FCR_CC         EQU (0x00001C00)     ; CC[2:0] bits (Contrast Control)
LCD_FCR_CC_0       EQU (0x00000400)     ; Bit 0
LCD_FCR_CC_1       EQU (0x00000800)     ; Bit 1
LCD_FCR_CC_2       EQU (0x00001000)     ; Bit 2

LCD_FCR_BLINKF     EQU (0x0000E000)     ; BLINKF[2:0] bits (Blink Frequency)
LCD_FCR_BLINKF_0   EQU (0x00002000)     ; Bit 0
LCD_FCR_BLINKF_1   EQU (0x00004000)     ; Bit 1
LCD_FCR_BLINKF_2   EQU (0x00008000)     ; Bit 2

LCD_FCR_BLINK      EQU (0x00030000)     ; BLINK[1:0] bits (Blink Enable)
LCD_FCR_BLINK_0    EQU (0x00010000)     ; Bit 0
LCD_FCR_BLINK_1    EQU (0x00020000)     ; Bit 1

LCD_FCR_DIV        EQU (0x003C0000)     ; DIV[3:0] bits (Divider)
LCD_FCR_PS         EQU (0x03C00000)     ; PS[3:0] bits (Prescaler)

; *******************  Bit definition for LCD_SR register  ********************
LCD_SR_ENS         EQU (0x00000001)     ; LCD Enabled Bit
LCD_SR_SOF         EQU (0x00000002)     ; Start Of Frame Flag Bit
LCD_SR_UDR         EQU (0x00000004)     ; Update Display Request Bit
LCD_SR_UDD         EQU (0x00000008)     ; Update Display Done Flag Bit
LCD_SR_RDY         EQU (0x00000010)     ; Ready Flag Bit
LCD_SR_FCRSR       EQU (0x00000020)     ; LCD FCR Register Synchronization Flag Bit

; *******************  Bit definition for LCD_CLR register  *******************
LCD_CLR_SOFC       EQU (0x00000002)     ; Start Of Frame Flag Clear Bit
LCD_CLR_UDDC       EQU (0x00000008)     ; Update Display Done Flag Clear Bit

; *******************  Bit definition for LCD_RAM register  *******************
LCD_RAM_SEGMENT_DATA       EQU (0xFFFFFFFF)     ; Segment Data Bits

; *****************************************************************************
;
;                           SDMMC Interface
;
; *****************************************************************************
; ******************  Bit definition for SDMMC_POWER register  *****************
SDMMC_POWER_PWRCTRL          EQU (0x03)               ;PWRCTRL[1:0] bits (Power supply control bits)
SDMMC_POWER_PWRCTRL_0        EQU (0x01)               ;Bit 0
SDMMC_POWER_PWRCTRL_1        EQU (0x02)               ;Bit 1

; ******************  Bit definition for SDMMC_CLKCR register  *****************
SDMMC_CLKCR_CLKDIV           EQU (0x00FF)            ;Clock divide factor
SDMMC_CLKCR_CLKEN            EQU (0x0100)            ;Clock enable bit
SDMMC_CLKCR_PWRSAV           EQU (0x0200)            ;Power saving configuration bit
SDMMC_CLKCR_BYPASS           EQU (0x0400)            ;Clock divider bypass enable bit

SDMMC_CLKCR_WIDBUS           EQU (0x1800)            ;WIDBUS[1:0] bits (Wide bus mode enable bit)
SDMMC_CLKCR_WIDBUS_0         EQU (0x0800)            ;Bit 0
SDMMC_CLKCR_WIDBUS_1         EQU (0x1000)            ;Bit 1

SDMMC_CLKCR_NEGEDGE          EQU (0x2000)            ;SDMMC_CK dephasing selection bit
SDMMC_CLKCR_HWFC_EN          EQU (0x4000)            ;HW Flow Control enable

; *******************  Bit definition for SDMMC_ARG register  ******************
SDMMC_ARG_CMDARG             EQU (0xFFFFFFFF)            ;Command argument

; *******************  Bit definition for SDMMC_CMD register  ******************
SDMMC_CMD_CMDINDEX           EQU (0x003F)            ;Command Index

SDMMC_CMD_WAITRESP           EQU (0x00C0)            ;WAITRESP[1:0] bits (Wait for response bits)
SDMMC_CMD_WAITRESP_0         EQU (0x0040)            ; Bit 0
SDMMC_CMD_WAITRESP_1         EQU (0x0080)            ; Bit 1

SDMMC_CMD_WAITINT            EQU (0x0100)            ;CPSM Waits for Interrupt Request
SDMMC_CMD_WAITPEND           EQU (0x0200)            ;CPSM Waits for ends of data transfer (CmdPend internal signal)
SDMMC_CMD_CPSMEN             EQU (0x0400)            ;Command path state machine (CPSM) Enable bit
SDMMC_CMD_SDIOSUSPEND        EQU (0x0800)            ;SD I/O suspend command

; *****************  Bit definition for SDMMC_RESPCMD register  ****************
SDMMC_RESPCMD_RESPCMD        EQU (0x3F)               ;Response command index

; ******************  Bit definition for SDMMC_RESP0 register  *****************
SDMMC_RESP0_CARDSTATUS0      EQU (0xFFFFFFFF)        ;Card Status

; ******************  Bit definition for SDMMC_RESP1 register  *****************
SDMMC_RESP1_CARDSTATUS1      EQU (0xFFFFFFFF)        ;Card Status

; ******************  Bit definition for SDMMC_RESP2 register  *****************
SDMMC_RESP2_CARDSTATUS2      EQU (0xFFFFFFFF)        ;Card Status

; ******************  Bit definition for SDMMC_RESP3 register  *****************
SDMMC_RESP3_CARDSTATUS3      EQU (0xFFFFFFFF)        ;Card Status

