Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ******************  Bit definition for SDMMC_RESP4 register  *****************
SDMMC_RESP4_CARDSTATUS4      EQU (0xFFFFFFFF)        ;Card Status

; ******************  Bit definition for SDMMC_DTIMER register  ****************
SDMMC_DTIMER_DATATIME        EQU (0xFFFFFFFF)        ;Data timeout period.

; ******************  Bit definition for SDMMC_DLEN register  ******************
SDMMC_DLEN_DATALENGTH        EQU (0x01FFFFFF)        ;Data length value

; ******************  Bit definition for SDMMC_DCTRL register  *****************
SDMMC_DCTRL_DTEN             EQU (0x0001)            ;Data transfer enabled bit
SDMMC_DCTRL_DTDIR            EQU (0x0002)            ;Data transfer direction selection
SDMMC_DCTRL_DTMODE           EQU (0x0004)            ;Data transfer mode selection
SDMMC_DCTRL_DMAEN            EQU (0x0008)            ;DMA enabled bit

SDMMC_DCTRL_DBLOCKSIZE       EQU (0x00F0)            ;DBLOCKSIZE[3:0] bits (Data block size)
SDMMC_DCTRL_DBLOCKSIZE_0     EQU (0x0010)            ;Bit 0
SDMMC_DCTRL_DBLOCKSIZE_1     EQU (0x0020)            ;Bit 1
SDMMC_DCTRL_DBLOCKSIZE_2     EQU (0x0040)            ;Bit 2
SDMMC_DCTRL_DBLOCKSIZE_3     EQU (0x0080)            ;Bit 3

SDMMC_DCTRL_RWSTART          EQU (0x0100)            ;Read wait start
SDMMC_DCTRL_RWSTOP           EQU (0x0200)            ;Read wait stop
SDMMC_DCTRL_RWMOD            EQU (0x0400)            ;Read wait mode
SDMMC_DCTRL_SDIOEN           EQU (0x0800)            ;SD I/O enable functions

; ******************  Bit definition for SDMMC_DCOUNT register  ****************
SDMMC_DCOUNT_DATACOUNT       EQU (0x01FFFFFF)        ;Data count value

; ******************  Bit definition for SDMMC_STA register  *******************
SDMMC_STA_CCRCFAIL           EQU (0x00000001)        ;Command response received (CRC check failed)
SDMMC_STA_DCRCFAIL           EQU (0x00000002)        ;Data block sent/received (CRC check failed)
SDMMC_STA_CTIMEOUT           EQU (0x00000004)        ;Command response timeout
SDMMC_STA_DTIMEOUT           EQU (0x00000008)        ;Data timeout
SDMMC_STA_TXUNDERR           EQU (0x00000010)        ;Transmit FIFO underrun error
SDMMC_STA_RXOVERR            EQU (0x00000020)        ;Received FIFO overrun error
SDMMC_STA_CMDREND            EQU (0x00000040)        ;Command response received (CRC check passed)
SDMMC_STA_CMDSENT            EQU (0x00000080)        ;Command sent (no response required)
SDMMC_STA_DATAEND            EQU (0x00000100)        ;Data end (data counter, SDIDCOUNT, is zero)
SDMMC_STA_STBITERR           EQU (0x00000200)        ;Start bit not detected on all data signals in wide bus mode
SDMMC_STA_DBCKEND            EQU (0x00000400)        ;Data block sent/received (CRC check passed)
SDMMC_STA_CMDACT             EQU (0x00000800)        ;Command transfer in progress
SDMMC_STA_TXACT              EQU (0x00001000)        ;Data transmit in progress
SDMMC_STA_RXACT              EQU (0x00002000)        ;Data receive in progress
SDMMC_STA_TXFIFOHE           EQU (0x00004000)        ;Transmit FIFO Half Empty: at least 8 words can be written into the FIFO
SDMMC_STA_RXFIFOHF           EQU (0x00008000)        ;Receive FIFO Half Full: there are at least 8 words in the FIFO
SDMMC_STA_TXFIFOF            EQU (0x00010000)        ;Transmit FIFO full
SDMMC_STA_RXFIFOF            EQU (0x00020000)        ;Receive FIFO full
SDMMC_STA_TXFIFOE            EQU (0x00040000)        ;Transmit FIFO empty
SDMMC_STA_RXFIFOE            EQU (0x00080000)        ;Receive FIFO empty
SDMMC_STA_TXDAVL             EQU (0x00100000)        ;Data available in transmit FIFO
SDMMC_STA_RXDAVL             EQU (0x00200000)        ;Data available in receive FIFO
SDMMC_STA_SDIOIT             EQU (0x00400000)        ;SDIO interrupt received

; *******************  Bit definition for SDMMC_ICR register  ******************
SDMMC_ICR_CCRCFAILC          EQU (0x00000001)        ;CCRCFAIL flag clear bit
SDMMC_ICR_DCRCFAILC          EQU (0x00000002)        ;DCRCFAIL flag clear bit
SDMMC_ICR_CTIMEOUTC          EQU (0x00000004)        ;CTIMEOUT flag clear bit
SDMMC_ICR_DTIMEOUTC          EQU (0x00000008)        ;DTIMEOUT flag clear bit
SDMMC_ICR_TXUNDERRC          EQU (0x00000010)        ;TXUNDERR flag clear bit
SDMMC_ICR_RXOVERRC           EQU (0x00000020)        ;RXOVERR flag clear bit
SDMMC_ICR_CMDRENDC           EQU (0x00000040)        ;CMDREND flag clear bit
SDMMC_ICR_CMDSENTC           EQU (0x00000080)        ;CMDSENT flag clear bit
SDMMC_ICR_DATAENDC           EQU (0x00000100)        ;DATAEND flag clear bit
SDMMC_ICR_STBITERRC          EQU (0x00000200)        ;STBITERR flag clear bit
SDMMC_ICR_DBCKENDC           EQU (0x00000400)        ;DBCKEND flag clear bit
SDMMC_ICR_SDIOITC            EQU (0x00400000)        ;SDIOIT flag clear bit

; ******************  Bit definition for SDMMC_MASK register  ******************
SDMMC_MASK_CCRCFAILIE        EQU (0x00000001)        ;Command CRC Fail Interrupt Enable
SDMMC_MASK_DCRCFAILIE        EQU (0x00000002)        ;Data CRC Fail Interrupt Enable
SDMMC_MASK_CTIMEOUTIE        EQU (0x00000004)        ;Command TimeOut Interrupt Enable
SDMMC_MASK_DTIMEOUTIE        EQU (0x00000008)        ;Data TimeOut Interrupt Enable
SDMMC_MASK_TXUNDERRIE        EQU (0x00000010)        ;Tx FIFO UnderRun Error Interrupt Enable
SDMMC_MASK_RXOVERRIE         EQU (0x00000020)        ;Rx FIFO OverRun Error Interrupt Enable
SDMMC_MASK_CMDRENDIE         EQU (0x00000040)        ;Command Response Received Interrupt Enable
SDMMC_MASK_CMDSENTIE         EQU (0x00000080)        ;Command Sent Interrupt Enable
SDMMC_MASK_DATAENDIE         EQU (0x00000100)        ;Data End Interrupt Enable
SDMMC_MASK_DBCKENDIE         EQU (0x00000400)        ;Data Block End Interrupt Enable
SDMMC_MASK_CMDACTIE          EQU (0x00000800)        ;CCommand Acting Interrupt Enable
SDMMC_MASK_TXACTIE           EQU (0x00001000)        ;Data Transmit Acting Interrupt Enable
SDMMC_MASK_RXACTIE           EQU (0x00002000)        ;Data receive acting interrupt enabled
SDMMC_MASK_TXFIFOHEIE        EQU (0x00004000)        ;Tx FIFO Half Empty interrupt Enable
SDMMC_MASK_RXFIFOHFIE        EQU (0x00008000)        ;Rx FIFO Half Full interrupt Enable
SDMMC_MASK_TXFIFOFIE         EQU (0x00010000)        ;Tx FIFO Full interrupt Enable
SDMMC_MASK_RXFIFOFIE         EQU (0x00020000)        ;Rx FIFO Full interrupt Enable
SDMMC_MASK_TXFIFOEIE         EQU (0x00040000)        ;Tx FIFO Empty interrupt Enable
SDMMC_MASK_RXFIFOEIE         EQU (0x00080000)        ;Rx FIFO Empty interrupt Enable
SDMMC_MASK_TXDAVLIE          EQU (0x00100000)        ;Data available in Tx FIFO interrupt Enable
SDMMC_MASK_RXDAVLIE          EQU (0x00200000)        ;Data available in Rx FIFO interrupt Enable
SDMMC_MASK_SDIOITIE          EQU (0x00400000)        ;SDIO Mode Interrupt Received interrupt Enable

; *****************  Bit definition for SDMMC_FIFOCNT register  ****************
SDMMC_FIFOCNT_FIFOCOUNT      EQU (0x00FFFFFF)        ;Remaining number of words to be written to or read from the FIFO

; ******************  Bit definition for SDMMC_FIFO register  ******************
SDMMC_FIFO_FIFODATA          EQU (0xFFFFFFFF)        ;Receive and transmit FIFO data

