Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *****************************************************************************
;
;                        Serial Peripheral Interface (SPI)
;
; *****************************************************************************
; *******************  Bit definition for SPI_CR1 register  *******************
SPI_CR1_CPHA                EQU (0x00000001)            ;Clock Phase
SPI_CR1_CPOL                EQU (0x00000002)            ;Clock Polarity
SPI_CR1_MSTR                EQU (0x00000004)            ;Master Selection

SPI_CR1_BR                  EQU (0x00000038)            ;BR[2:0] bits (Baud Rate Control)
SPI_CR1_BR_0                EQU (0x00000008)            ;Bit 0
SPI_CR1_BR_1                EQU (0x00000010)            ;Bit 1
SPI_CR1_BR_2                EQU (0x00000020)            ;Bit 2

SPI_CR1_SPE                 EQU (0x00000040)            ;SPI Enable
SPI_CR1_LSBFIRST            EQU (0x00000080)            ;Frame Format
SPI_CR1_SSI                 EQU (0x00000100)            ;Internal slave select
SPI_CR1_SSM                 EQU (0x00000200)            ;Software slave management
SPI_CR1_RXONLY              EQU (0x00000400)            ;Receive only
SPI_CR1_CRCL                EQU (0x00000800)            ; CRC Length
SPI_CR1_CRCNEXT             EQU (0x00001000)            ;Transmit CRC next
SPI_CR1_CRCEN               EQU (0x00002000)            ;Hardware CRC calculation enable
SPI_CR1_BIDIOE              EQU (0x00004000)            ;Output enable in bidirectional mode
SPI_CR1_BIDIMODE            EQU (0x00008000)            ;Bidirectional data mode enable

; *******************  Bit definition for SPI_CR2 register  *******************
SPI_CR2_RXDMAEN             EQU (0x00000001)            ; Rx Buffer DMA Enable
SPI_CR2_TXDMAEN             EQU (0x00000002)            ; Tx Buffer DMA Enable
SPI_CR2_SSOE                EQU (0x00000004)            ; SS Output Enable
SPI_CR2_NSSP                EQU (0x00000008)            ; NSS pulse management Enable
SPI_CR2_FRF                 EQU (0x00000010)            ; Frame Format Enable
SPI_CR2_ERRIE               EQU (0x00000020)            ; Error Interrupt Enable
SPI_CR2_RXNEIE              EQU (0x00000040)            ; RX buffer Not Empty Interrupt Enable
SPI_CR2_TXEIE               EQU (0x00000080)            ; Tx buffer Empty Interrupt Enable
SPI_CR2_DS                  EQU (0x00000F00)            ; DS[3:0] Data Size
SPI_CR2_DS_0                EQU (0x00000100)            ; Bit 0
SPI_CR2_DS_1                EQU (0x00000200)            ; Bit 1
SPI_CR2_DS_2                EQU (0x00000400)            ; Bit 2
SPI_CR2_DS_3                EQU (0x00000800)            ; Bit 3
SPI_CR2_FRXTH               EQU (0x00001000)            ; FIFO reception Threshold
SPI_CR2_LDMARX              EQU (0x00002000)            ; Last DMA transfer for reception
SPI_CR2_LDMATX              EQU (0x00004000)            ; Last DMA transfer for transmission

; ********************  Bit definition for SPI_SR register  *******************
SPI_SR_RXNE                 EQU (0x00000001)            ; Receive buffer Not Empty
SPI_SR_TXE                  EQU (0x00000002)            ; Transmit buffer Empty
SPI_SR_CHSIDE               EQU (0x00000004)            ; Channel side
SPI_SR_UDR                  EQU (0x00000008)            ; Underrun flag
SPI_SR_CRCERR               EQU (0x00000010)            ; CRC Error flag
SPI_SR_MODF                 EQU (0x00000020)            ; Mode fault
SPI_SR_OVR                  EQU (0x00000040)            ; Overrun flag
SPI_SR_BSY                  EQU (0x00000080)            ; Busy flag
SPI_SR_FRE                  EQU (0x00000100)            ; TI frame format error
SPI_SR_FRLVL                EQU (0x00000600)            ; FIFO Reception Level
SPI_SR_FRLVL_0              EQU (0x00000200)            ; Bit 0
SPI_SR_FRLVL_1              EQU (0x00000400)            ; Bit 1
SPI_SR_FTLVL                EQU (0x00001800)            ; FIFO Transmission Level
SPI_SR_FTLVL_0              EQU (0x00000800)            ; Bit 0
SPI_SR_FTLVL_1              EQU (0x00001000)            ; Bit 1

; ********************  Bit definition for SPI_DR register  *******************
SPI_DR_DR                   EQU (0x0000FFFF)            ;Data Register

; *******************  Bit definition for SPI_CRCPR register  *****************
SPI_CRCPR_CRCPOLY           EQU (0x0000FFFF)            ;CRC polynomial register

; ******************  Bit definition for SPI_RXCRCR register  *****************
SPI_RXCRCR_RXCRC            EQU (0x0000FFFF)            ;Rx CRC Register

; ******************  Bit definition for SPI_TXCRCR register  *****************
SPI_TXCRCR_TXCRC            EQU (0x0000FFFF)            ;Tx CRC Register

; *****************************************************************************
;
;                                    QUADSPI
;
; *****************************************************************************
; *****************  Bit definition for QUADSPI_CR register  ******************
QUADSPI_CR_EN                   EQU (0x00000001)            ; Enable
QUADSPI_CR_ABORT                EQU (0x00000002)            ; Abort request
QUADSPI_CR_DMAEN                EQU (0x00000004)            ; DMA Enable
QUADSPI_CR_TCEN                 EQU (0x00000008)            ; Timeout Counter Enable
QUADSPI_CR_SSHIFT               EQU (0x00000010)            ; Sample Shift
QUADSPI_CR_FTHRES               EQU (0x00000F00)            ; FTHRES[3:0] FIFO Level
QUADSPI_CR_TEIE                 EQU (0x00010000)            ; Transfer Error Interrupt Enable
QUADSPI_CR_TCIE                 EQU (0x00020000)            ; Transfer Complete Interrupt Enable
QUADSPI_CR_FTIE                 EQU (0x00040000)            ; FIFO Threshold Interrupt Enable
QUADSPI_CR_SMIE                 EQU (0x00080000)            ; Status Match Interrupt Enable
QUADSPI_CR_TOIE                 EQU (0x00100000)            ; TimeOut Interrupt Enable
QUADSPI_CR_APMS                 EQU (0x00400000)            ; Automatic Polling Mode Stop
QUADSPI_CR_PMM                  EQU (0x00800000)            ; Polling Match Mode
QUADSPI_CR_PRESCALER            EQU (0xFF000000)            ; PRESCALER[7:0] Clock prescaler

; *****************  Bit definition for QUADSPI_DCR register  *****************
QUADSPI_DCR_CKMODE              EQU (0x00000001)            ; Mode 0 / Mode 3
QUADSPI_DCR_CSHT                EQU (0x00000700)            ; CSHT[2:0]: ChipSelect High Time
QUADSPI_DCR_CSHT_0              EQU (0x00000100)            ; Bit 0
QUADSPI_DCR_CSHT_1              EQU (0x00000200)            ; Bit 1
QUADSPI_DCR_CSHT_2              EQU (0x00000400)            ; Bit 2
QUADSPI_DCR_FSIZE               EQU (0x001F0000)            ; FSIZE[4:0]: Flash Size

; ******************  Bit definition for QUADSPI_SR register  ******************
QUADSPI_SR_TEF                  EQU (0x00000001)             ; Transfer Error Flag
QUADSPI_SR_TCF                  EQU (0x00000002)             ; Transfer Complete Flag
QUADSPI_SR_FTF                  EQU (0x00000004)             ; FIFO Threshlod Flag
QUADSPI_SR_SMF                  EQU (0x00000008)             ; Status Match Flag
QUADSPI_SR_TOF                  EQU (0x00000010)             ; Timeout Flag
QUADSPI_SR_BUSY                 EQU (0x00000020)             ; Busy
QUADSPI_SR_FLEVEL               EQU (0x00001F00)             ; FIFO Threshlod Flag

; ******************  Bit definition for QUADSPI_FCR register  *****************
QUADSPI_FCR_CTEF                EQU (0x00000001)             ; Clear Transfer Error Flag
QUADSPI_FCR_CTCF                EQU (0x00000002)             ; Clear Transfer Complete Flag
QUADSPI_FCR_CSMF                EQU (0x00000008)             ; Clear Status Match Flag
QUADSPI_FCR_CTOF                EQU (0x00000010)             ; Clear Timeout Flag

