Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ******************  Bit definition for QUADSPI_DLR register  *****************
QUADSPI_DLR_DL                EQU (0xFFFFFFFF)               ; DL[31:0]: Data Length

; ******************  Bit definition for QUADSPI_CCR register  *****************
QUADSPI_CCR_INSTRUCTION          EQU (0x000000FF)            ; INSTRUCTION[7:0]: Instruction
QUADSPI_CCR_IMODE                EQU (0x00000300)            ; IMODE[1:0]: Instruction Mode
QUADSPI_CCR_IMODE_0              EQU (0x00000100)            ; Bit 0
QUADSPI_CCR_IMODE_1              EQU (0x00000200)            ; Bit 1
QUADSPI_CCR_ADMODE               EQU (0x00000C00)            ; ADMODE[1:0]: Address Mode
QUADSPI_CCR_ADMODE_0             EQU (0x00000400)            ; Bit 0
QUADSPI_CCR_ADMODE_1             EQU (0x00000800)            ; Bit 1
QUADSPI_CCR_ADSIZE               EQU (0x00003000)            ; ADSIZE[1:0]: Address Size
QUADSPI_CCR_ADSIZE_0             EQU (0x00001000)            ; Bit 0
QUADSPI_CCR_ADSIZE_1             EQU (0x00002000)            ; Bit 1
QUADSPI_CCR_ABMODE               EQU (0x0000C000)            ; ABMODE[1:0]: Alternate Bytes Mode
QUADSPI_CCR_ABMODE_0             EQU (0x00004000)            ; Bit 0
QUADSPI_CCR_ABMODE_1             EQU (0x00008000)            ; Bit 1
QUADSPI_CCR_ABSIZE               EQU (0x00030000)            ; ABSIZE[1:0]: Instruction Mode
QUADSPI_CCR_ABSIZE_0             EQU (0x00010000)            ; Bit 0
QUADSPI_CCR_ABSIZE_1             EQU (0x00020000)            ; Bit 1
QUADSPI_CCR_DCYC                 EQU (0x007C0000)            ; DCYC[4:0]: Dummy Cycles
QUADSPI_CCR_DMODE                EQU (0x03000000)            ; DMODE[1:0]: Data Mode
QUADSPI_CCR_DMODE_0              EQU (0x01000000)            ; Bit 0
QUADSPI_CCR_DMODE_1              EQU (0x02000000)            ; Bit 1
QUADSPI_CCR_FMODE                EQU (0x0C000000)            ; FMODE[1:0]: Functional Mode
QUADSPI_CCR_FMODE_0              EQU (0x04000000)            ; Bit 0
QUADSPI_CCR_FMODE_1              EQU (0x08000000)            ; Bit 1
QUADSPI_CCR_SIOO                 EQU (0x10000000)            ; SIOO: Send Instruction Only Once Mode
QUADSPI_CCR_DDRM                 EQU (0x80000000)            ; DDRM: Double Data Rate Mode

; ******************  Bit definition for QUADSPI_AR register  ******************
QUADSPI_AR_ADDRESS               EQU (0xFFFFFFFF)            ; ADDRESS[31:0]: Address

; ******************  Bit definition for QUADSPI_ABR register  *****************
QUADSPI_ABR_ALTERNATE            EQU (0xFFFFFFFF)            ; ALTERNATE[31:0]: Alternate Bytes

; ******************  Bit definition for QUADSPI_DR register  ******************
QUADSPI_DR_DATA                  EQU (0xFFFFFFFF)            ; DATA[31:0]: Data

; ******************  Bit definition for QUADSPI_PSMKR register  ***************
QUADSPI_PSMKR_MASK               EQU (0xFFFFFFFF)            ; MASK[31:0]: Status Mask

; ******************  Bit definition for QUADSPI_PSMAR register  ***************
QUADSPI_PSMAR_MATCH              EQU (0xFFFFFFFF)            ; MATCH[31:0]: Status Match

; ******************  Bit definition for QUADSPI_PIR register  ****************
QUADSPI_PIR_INTERVAL             EQU (0x0000FFFF)            ; INTERVAL[15:0]: Polling Interval

; ******************  Bit definition for QUADSPI_LPTR register  ****************
QUADSPI_LPTR_TIMEOUT             EQU (0x0000FFFF)            ; TIMEOUT[15:0]: Timeout period

; *****************************************************************************
;
;                                 SYSCFG
;
; *****************************************************************************
; ******************  Bit definition for SYSCFG_MEMRMP register  **************
SYSCFG_MEMRMP_MEM_MODE  EQU (0x00000007) ; SYSCFG_Memory Remap Config
SYSCFG_MEMRMP_MEM_MODE_0        EQU (0x00000001)
SYSCFG_MEMRMP_MEM_MODE_1        EQU (0x00000002)
SYSCFG_MEMRMP_MEM_MODE_2        EQU (0x00000004)

SYSCFG_MEMRMP_FB_MODE   EQU (0x00000100) ; Flash Bank mode selection


; ******************  Bit definition for SYSCFG_CFGR1 register  *****************
SYSCFG_CFGR1_FWDIS          EQU (0x00000001) ; FIREWALL access enable
SYSCFG_CFGR1_BOOSTEN        EQU (0x00000100) ; I/O analog switch voltage booster enable
SYSCFG_CFGR1_I2C_PB6_FMP    EQU (0x00010000) ; I2C PB6 Fast mode plus
SYSCFG_CFGR1_I2C_PB7_FMP    EQU (0x00020000) ; I2C PB7 Fast mode plus
SYSCFG_CFGR1_I2C_PB8_FMP    EQU (0x00040000) ; I2C PB8 Fast mode plus
SYSCFG_CFGR1_I2C_PB9_FMP    EQU (0x00080000) ; I2C PB9 Fast mode plus
SYSCFG_CFGR1_I2C1_FMP       EQU (0x00100000) ; I2C1 Fast mode plus
SYSCFG_CFGR1_I2C2_FMP       EQU (0x00200000) ; I2C2 Fast mode plus
SYSCFG_CFGR1_I2C3_FMP       EQU (0x00400000) ; I2C3 Fast mode plus
SYSCFG_CFGR1_FPU_IE_0       EQU (0x04000000) ;  Invalid operation Interrupt enable
SYSCFG_CFGR1_FPU_IE_1       EQU (0x08000000) ;  Divide-by-zero Interrupt enable
SYSCFG_CFGR1_FPU_IE_2       EQU (0x10000000) ;  Underflow Interrupt enable
SYSCFG_CFGR1_FPU_IE_3       EQU (0x20000000) ;  Overflow Interrupt enable
SYSCFG_CFGR1_FPU_IE_4       EQU (0x40000000) ;  Input denormal Interrupt enable
SYSCFG_CFGR1_FPU_IE_5       EQU (0x80000000) ;  Inexact Interrupt enable (interrupt disabled at reset)

; *****************  Bit definition for SYSCFG_EXTICR1 register  **************
SYSCFG_EXTICR1_EXTI0    EQU (0x00000007) ;EXTI 0 configuration
SYSCFG_EXTICR1_EXTI1    EQU (0x00000070) ;EXTI 1 configuration
SYSCFG_EXTICR1_EXTI2    EQU (0x00000700) ;EXTI 2 configuration
SYSCFG_EXTICR1_EXTI3    EQU (0x00007000) ;EXTI 3 configuration
;   EXTI0 configuration

SYSCFG_EXTICR1_EXTI0_PA EQU (0x00000000) ;PA[0] pin
SYSCFG_EXTICR1_EXTI0_PB EQU (0x00000001) ;PB[0] pin
SYSCFG_EXTICR1_EXTI0_PC EQU (0x00000002) ;PC[0] pin
SYSCFG_EXTICR1_EXTI0_PD EQU (0x00000003) ;PD[0] pin
SYSCFG_EXTICR1_EXTI0_PE EQU (0x00000004) ;PE[0] pin
SYSCFG_EXTICR1_EXTI0_PF EQU (0x00000005) ;PF[0] pin
SYSCFG_EXTICR1_EXTI0_PG EQU (0x00000006) ;PG[0] pin
SYSCFG_EXTICR1_EXTI0_PH EQU (0x00000007) ;PH[0] pin


;   EXTI1 configuration

SYSCFG_EXTICR1_EXTI1_PA EQU (0x00000000) ;PA[1] pin
SYSCFG_EXTICR1_EXTI1_PB EQU (0x00000010) ;PB[1] pin
SYSCFG_EXTICR1_EXTI1_PC EQU (0x00000020) ;PC[1] pin
SYSCFG_EXTICR1_EXTI1_PD EQU (0x00000030) ;PD[1] pin
SYSCFG_EXTICR1_EXTI1_PE EQU (0x00000040) ;PE[1] pin
SYSCFG_EXTICR1_EXTI1_PF EQU (0x00000050) ;PF[1] pin
SYSCFG_EXTICR1_EXTI1_PG EQU (0x00000060) ;PG[1] pin
SYSCFG_EXTICR1_EXTI1_PH EQU (0x00000070) ;PH[1] pin

;   EXTI2 configuration

SYSCFG_EXTICR1_EXTI2_PA EQU (0x00000000) ;PA[2] pin
SYSCFG_EXTICR1_EXTI2_PB EQU (0x00000100) ;PB[2] pin
SYSCFG_EXTICR1_EXTI2_PC EQU (0x00000200) ;PC[2] pin
SYSCFG_EXTICR1_EXTI2_PD EQU (0x00000300) ;PD[2] pin
SYSCFG_EXTICR1_EXTI2_PE EQU (0x00000400) ;PE[2] pin
SYSCFG_EXTICR1_EXTI2_PF EQU (0x00000500) ;PF[2] pin
SYSCFG_EXTICR1_EXTI2_PG EQU (0x00000600) ;PG[2] pin


;   EXTI3 configuration

SYSCFG_EXTICR1_EXTI3_PA EQU (0x00000000) ;PA[3] pin
SYSCFG_EXTICR1_EXTI3_PB EQU (0x00001000) ;PB[3] pin
SYSCFG_EXTICR1_EXTI3_PC EQU (0x00002000) ;PC[3] pin
SYSCFG_EXTICR1_EXTI3_PD EQU (0x00003000) ;PD[3] pin
SYSCFG_EXTICR1_EXTI3_PE EQU (0x00004000) ;PE[3] pin
SYSCFG_EXTICR1_EXTI3_PF EQU (0x00005000) ;PF[3] pin
SYSCFG_EXTICR1_EXTI3_PG EQU (0x00006000) ;PG[3] pin


