Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *****************  Bit definition for SYSCFG_EXTICR2 register  **************
SYSCFG_EXTICR2_EXTI4    EQU (0x00000007) ;EXTI 4 configuration
SYSCFG_EXTICR2_EXTI5    EQU (0x00000070) ;EXTI 5 configuration
SYSCFG_EXTICR2_EXTI6    EQU (0x00000700) ;EXTI 6 configuration
SYSCFG_EXTICR2_EXTI7    EQU (0x00007000) ;EXTI 7 configuration
;   EXTI4 configuration

SYSCFG_EXTICR2_EXTI4_PA EQU (0x00000000) ;PA[4] pin
SYSCFG_EXTICR2_EXTI4_PB EQU (0x00000001) ;PB[4] pin
SYSCFG_EXTICR2_EXTI4_PC EQU (0x00000002) ;PC[4] pin
SYSCFG_EXTICR2_EXTI4_PD EQU (0x00000003) ;PD[4] pin
SYSCFG_EXTICR2_EXTI4_PE EQU (0x00000004) ;PE[4] pin
SYSCFG_EXTICR2_EXTI4_PF EQU (0x00000005) ;PF[4] pin
SYSCFG_EXTICR2_EXTI4_PG EQU (0x00000006) ;PG[4] pin

;   EXTI5 configuration

SYSCFG_EXTICR2_EXTI5_PA EQU (0x00000000) ;PA[5] pin
SYSCFG_EXTICR2_EXTI5_PB EQU (0x00000010) ;PB[5] pin
SYSCFG_EXTICR2_EXTI5_PC EQU (0x00000020) ;PC[5] pin
SYSCFG_EXTICR2_EXTI5_PD EQU (0x00000030) ;PD[5] pin
SYSCFG_EXTICR2_EXTI5_PE EQU (0x00000040) ;PE[5] pin
SYSCFG_EXTICR2_EXTI5_PF EQU (0x00000050) ;PF[5] pin
SYSCFG_EXTICR2_EXTI5_PG EQU (0x00000060) ;PG[5] pin

;   EXTI6 configuration

SYSCFG_EXTICR2_EXTI6_PA EQU (0x00000000) ;PA[6] pin
SYSCFG_EXTICR2_EXTI6_PB EQU (0x00000100) ;PB[6] pin
SYSCFG_EXTICR2_EXTI6_PC EQU (0x00000200) ;PC[6] pin
SYSCFG_EXTICR2_EXTI6_PD EQU (0x00000300) ;PD[6] pin
SYSCFG_EXTICR2_EXTI6_PE EQU (0x00000400) ;PE[6] pin
SYSCFG_EXTICR2_EXTI6_PF EQU (0x00000500) ;PF[6] pin
SYSCFG_EXTICR2_EXTI6_PG EQU (0x00000600) ;PG[6] pin

;   EXTI7 configuration

SYSCFG_EXTICR2_EXTI7_PA EQU (0x00000000) ;PA[7] pin
SYSCFG_EXTICR2_EXTI7_PB EQU (0x00001000) ;PB[7] pin
SYSCFG_EXTICR2_EXTI7_PC EQU (0x00002000) ;PC[7] pin
SYSCFG_EXTICR2_EXTI7_PD EQU (0x00003000) ;PD[7] pin
SYSCFG_EXTICR2_EXTI7_PE EQU (0x00004000) ;PE[7] pin
SYSCFG_EXTICR2_EXTI7_PF EQU (0x00005000) ;PF[7] pin
SYSCFG_EXTICR2_EXTI7_PG EQU (0x00006000) ;PG[7] pin


; *****************  Bit definition for SYSCFG_EXTICR3 register  **************
SYSCFG_EXTICR3_EXTI8    EQU (0x00000007) ;EXTI 8 configuration
SYSCFG_EXTICR3_EXTI9    EQU (0x00000070) ;EXTI 9 configuration
SYSCFG_EXTICR3_EXTI10   EQU (0x00000700) ;EXTI 10 configuration
SYSCFG_EXTICR3_EXTI11   EQU (0x00007000) ;EXTI 11 configuration

;   EXTI8 configuration

SYSCFG_EXTICR3_EXTI8_PA EQU (0x00000000) ;PA[8] pin
SYSCFG_EXTICR3_EXTI8_PB EQU (0x00000001) ;PB[8] pin
SYSCFG_EXTICR3_EXTI8_PC EQU (0x00000002) ;PC[8] pin
SYSCFG_EXTICR3_EXTI8_PD EQU (0x00000003) ;PD[8] pin
SYSCFG_EXTICR3_EXTI8_PE EQU (0x00000004) ;PE[8] pin
SYSCFG_EXTICR3_EXTI8_PF EQU (0x00000005) ;PF[8] pin
SYSCFG_EXTICR3_EXTI8_PG EQU (0x00000006) ;PG[8] pin

;   EXTI9 configuration

SYSCFG_EXTICR3_EXTI9_PA EQU (0x00000000) ;PA[9] pin
SYSCFG_EXTICR3_EXTI9_PB EQU (0x00000010) ;PB[9] pin
SYSCFG_EXTICR3_EXTI9_PC EQU (0x00000020) ;PC[9] pin
SYSCFG_EXTICR3_EXTI9_PD EQU (0x00000030) ;PD[9] pin
SYSCFG_EXTICR3_EXTI9_PE EQU (0x00000040) ;PE[9] pin
SYSCFG_EXTICR3_EXTI9_PF EQU (0x00000050) ;PF[9] pin
SYSCFG_EXTICR3_EXTI9_PG EQU (0x00000060) ;PG[9] pin

;   EXTI10 configuration

SYSCFG_EXTICR3_EXTI10_PA        EQU (0x00000000) ;PA[10] pin
SYSCFG_EXTICR3_EXTI10_PB        EQU (0x00000100) ;PB[10] pin
SYSCFG_EXTICR3_EXTI10_PC        EQU (0x00000200) ;PC[10] pin
SYSCFG_EXTICR3_EXTI10_PD        EQU (0x00000300) ;PD[10] pin
SYSCFG_EXTICR3_EXTI10_PE        EQU (0x00000400) ;PE[10] pin
SYSCFG_EXTICR3_EXTI10_PF        EQU (0x00000500) ;PF[10] pin
SYSCFG_EXTICR3_EXTI10_PG        EQU (0x00000600) ;PG[10] pin

;   EXTI11 configuration

SYSCFG_EXTICR3_EXTI11_PA        EQU (0x00000000) ;PA[11] pin
SYSCFG_EXTICR3_EXTI11_PB        EQU (0x00001000) ;PB[11] pin
SYSCFG_EXTICR3_EXTI11_PC        EQU (0x00002000) ;PC[11] pin
SYSCFG_EXTICR3_EXTI11_PD        EQU (0x00003000) ;PD[11] pin
SYSCFG_EXTICR3_EXTI11_PE        EQU (0x00004000) ;PE[11] pin
SYSCFG_EXTICR3_EXTI11_PF        EQU (0x00005000) ;PF[11] pin
SYSCFG_EXTICR3_EXTI11_PG        EQU (0x00006000) ;PG[11] pin

; *****************  Bit definition for SYSCFG_EXTICR4 register  **************
SYSCFG_EXTICR4_EXTI12   EQU (0x00000007) ;EXTI 12 configuration
SYSCFG_EXTICR4_EXTI13   EQU (0x00000070) ;EXTI 13 configuration
SYSCFG_EXTICR4_EXTI14   EQU (0x00000700) ;EXTI 14 configuration
SYSCFG_EXTICR4_EXTI15   EQU (0x00007000) ;EXTI 15 configuration
;   EXTI12 configuration

SYSCFG_EXTICR4_EXTI12_PA        EQU (0x00000000) ;PA[12] pin
SYSCFG_EXTICR4_EXTI12_PB        EQU (0x00000001) ;PB[12] pin
SYSCFG_EXTICR4_EXTI12_PC        EQU (0x00000002) ;PC[12] pin
SYSCFG_EXTICR4_EXTI12_PD        EQU (0x00000003) ;PD[12] pin
SYSCFG_EXTICR4_EXTI12_PE        EQU (0x00000004) ;PE[12] pin
SYSCFG_EXTICR4_EXTI12_PF        EQU (0x00000005) ;PF[12] pin
SYSCFG_EXTICR4_EXTI12_PG        EQU (0x00000006) ;PG[12] pin

;   EXTI13 configuration

SYSCFG_EXTICR4_EXTI13_PA        EQU (0x00000000) ;PA[13] pin
SYSCFG_EXTICR4_EXTI13_PB        EQU (0x00000010) ;PB[13] pin
SYSCFG_EXTICR4_EXTI13_PC        EQU (0x00000020) ;PC[13] pin
SYSCFG_EXTICR4_EXTI13_PD        EQU (0x00000030) ;PD[13] pin
SYSCFG_EXTICR4_EXTI13_PE        EQU (0x00000040) ;PE[13] pin
SYSCFG_EXTICR4_EXTI13_PF        EQU (0x00000050) ;PF[13] pin
SYSCFG_EXTICR4_EXTI13_PG        EQU (0x00000060) ;PG[13] pin

;   EXTI14 configuration

SYSCFG_EXTICR4_EXTI14_PA        EQU (0x00000000) ;PA[14] pin
SYSCFG_EXTICR4_EXTI14_PB        EQU (0x00000100) ;PB[14] pin
SYSCFG_EXTICR4_EXTI14_PC        EQU (0x00000200) ;PC[14] pin
SYSCFG_EXTICR4_EXTI14_PD        EQU (0x00000300) ;PD[14] pin
SYSCFG_EXTICR4_EXTI14_PE        EQU (0x00000400) ;PE[14] pin
SYSCFG_EXTICR4_EXTI14_PF        EQU (0x00000500) ;PF[14] pin
SYSCFG_EXTICR4_EXTI14_PG        EQU (0x00000600) ;PG[14] pin

;   EXTI15 configuration

SYSCFG_EXTICR4_EXTI15_PA        EQU (0x00000000) ;PA[15] pin
SYSCFG_EXTICR4_EXTI15_PB        EQU (0x00001000) ;PB[15] pin
SYSCFG_EXTICR4_EXTI15_PC        EQU (0x00002000) ;PC[15] pin
SYSCFG_EXTICR4_EXTI15_PD        EQU (0x00003000) ;PD[15] pin
SYSCFG_EXTICR4_EXTI15_PE        EQU (0x00004000) ;PE[15] pin
SYSCFG_EXTICR4_EXTI15_PF        EQU (0x00005000) ;PF[15] pin
SYSCFG_EXTICR4_EXTI15_PG        EQU (0x00006000) ;PG[15] pin

; ******************  Bit definition for SYSCFG_SCSR register  ***************
SYSCFG_SCSR_SRAM2ER     EQU (0x00000001) ; SRAM2 Erase Request
SYSCFG_SCSR_SRAM2BSY    EQU (0x00000002) ; SRAM2 Erase Ongoing

; ******************  Bit definition for SYSCFG_CFGR2 register  ***************
SYSCFG_CFGR2_CLL        EQU (0x00000001) ; Core Lockup Lock
SYSCFG_CFGR2_SPL        EQU (0x00000002) ; SRAM Parity Lock
SYSCFG_CFGR2_PVDL       EQU (0x00000004) ;  PVD Lock
SYSCFG_CFGR2_ECCL       EQU (0x00000008) ; ECC Lock
SYSCFG_CFGR2_SPF        EQU (0x00000100) ; SRAM Parity Flag

; ******************  Bit definition for SYSCFG_SWPR register  ***************
SYSCFG_SWPR_PAGE0  EQU (0x00000001) ; SRAM2 Write protection page 0
SYSCFG_SWPR_PAGE1  EQU (0x00000002) ; SRAM2 Write protection page 1
SYSCFG_SWPR_PAGE2  EQU (0x00000004) ; SRAM2 Write protection page 2
SYSCFG_SWPR_PAGE3  EQU (0x00000008) ; SRAM2 Write protection page 3
SYSCFG_SWPR_PAGE4  EQU (0x00000010) ; SRAM2 Write protection page 4
SYSCFG_SWPR_PAGE5  EQU (0x00000020) ; SRAM2 Write protection page 5
SYSCFG_SWPR_PAGE6  EQU (0x00000040) ; SRAM2 Write protection page 6
SYSCFG_SWPR_PAGE7  EQU (0x00000080) ; SRAM2 Write protection page 7
SYSCFG_SWPR_PAGE8  EQU (0x00000100) ; SRAM2 Write protection page 8
SYSCFG_SWPR_PAGE9  EQU (0x00000200) ; SRAM2 Write protection page 9
SYSCFG_SWPR_PAGE10 EQU (0x00000400) ; SRAM2 Write protection page 10
SYSCFG_SWPR_PAGE11 EQU (0x00000800) ; SRAM2 Write protection page 11
SYSCFG_SWPR_PAGE12 EQU (0x00001000) ; SRAM2 Write protection page 12
SYSCFG_SWPR_PAGE13 EQU (0x00002000) ; SRAM2 Write protection page 13
SYSCFG_SWPR_PAGE14 EQU (0x00004000) ; SRAM2 Write protection page 14
SYSCFG_SWPR_PAGE15 EQU (0x00008000) ; SRAM2 Write protection page 15
SYSCFG_SWPR_PAGE16 EQU (0x00010000) ; SRAM2 Write protection page 16
SYSCFG_SWPR_PAGE17 EQU (0x00020000) ; SRAM2 Write protection page 17
SYSCFG_SWPR_PAGE18 EQU (0x00040000) ; SRAM2 Write protection page 18
SYSCFG_SWPR_PAGE19 EQU (0x00080000) ; SRAM2 Write protection page 19
SYSCFG_SWPR_PAGE20 EQU (0x00100000) ; SRAM2 Write protection page 20
SYSCFG_SWPR_PAGE21 EQU (0x00200000) ; SRAM2 Write protection page 21
SYSCFG_SWPR_PAGE22 EQU (0x00400000) ; SRAM2 Write protection page 22
SYSCFG_SWPR_PAGE23 EQU (0x00800000) ; SRAM2 Write protection page 23
SYSCFG_SWPR_PAGE24 EQU (0x01000000) ; SRAM2 Write protection page 24
SYSCFG_SWPR_PAGE25 EQU (0x02000000) ; SRAM2 Write protection page 25
SYSCFG_SWPR_PAGE26 EQU (0x04000000) ; SRAM2 Write protection page 26
SYSCFG_SWPR_PAGE27 EQU (0x08000000) ; SRAM2 Write protection page 27
SYSCFG_SWPR_PAGE28 EQU (0x10000000) ; SRAM2 Write protection page 28
SYSCFG_SWPR_PAGE29 EQU (0x20000000) ; SRAM2 Write protection page 29
SYSCFG_SWPR_PAGE30 EQU (0x40000000) ; SRAM2 Write protection page 30
SYSCFG_SWPR_PAGE31 EQU (0x80000000) ; SRAM2 Write protection page 31

