Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ******************  Bit definition for SYSCFG_SKR register  ***************
SYSCFG_SKR_KEY     EQU (0x000000FF) ;  SRAM2 write protection key for software erase




; *****************************************************************************
;
;                                    TIM
;
; *****************************************************************************
; *******************  Bit definition for TIM_CR1 register  *******************
TIM_CR1_CEN       EQU (0x00000001)            ;Counter enable
TIM_CR1_UDIS      EQU (0x00000002)            ;Update disable
TIM_CR1_URS       EQU (0x00000004)            ;Update request source
TIM_CR1_OPM       EQU (0x00000008)            ;One pulse mode
TIM_CR1_DIR       EQU (0x00000010)            ;Direction

TIM_CR1_CMS       EQU (0x00000060)            ;CMS[1:0] bits (Center-aligned mode selection)
TIM_CR1_CMS_0     EQU (0x00000020)            ;Bit 0
TIM_CR1_CMS_1     EQU (0x00000040)            ;Bit 1

TIM_CR1_ARPE      EQU (0x00000080)            ;Auto-reload preload enable

TIM_CR1_CKD       EQU (0x00000300)            ;CKD[1:0] bits (clock division)
TIM_CR1_CKD_0     EQU (0x00000100)            ;Bit 0
TIM_CR1_CKD_1     EQU (0x00000200)            ;Bit 1

TIM_CR1_UIFREMAP  EQU (0x00000800)            ;Update interrupt flag remap

; *******************  Bit definition for TIM_CR2 register  *******************
TIM_CR2_CCPC      EQU (0x00000001)            ;Capture/Compare Preloaded Control
TIM_CR2_CCUS      EQU (0x00000004)            ;Capture/Compare Control Update Selection
TIM_CR2_CCDS      EQU (0x00000008)            ;Capture/Compare DMA Selection

TIM_CR2_MMS       EQU (0x00000070)            ;MMS[2:0] bits (Master Mode Selection)
TIM_CR2_MMS_0     EQU (0x00000010)            ;Bit 0
TIM_CR2_MMS_1     EQU (0x00000020)            ;Bit 1
TIM_CR2_MMS_2     EQU (0x00000040)            ;Bit 2

TIM_CR2_TI1S      EQU (0x00000080)            ;TI1 Selection
TIM_CR2_OIS1      EQU (0x00000100)            ;Output Idle state 1 (OC1 output)
TIM_CR2_OIS1N     EQU (0x00000200)            ;Output Idle state 1 (OC1N output)
TIM_CR2_OIS2      EQU (0x00000400)            ;Output Idle state 2 (OC2 output)
TIM_CR2_OIS2N     EQU (0x00000800)            ;Output Idle state 2 (OC2N output)
TIM_CR2_OIS3      EQU (0x00001000)            ;Output Idle state 3 (OC3 output)
TIM_CR2_OIS3N     EQU (0x00002000)            ;Output Idle state 3 (OC3N output)
TIM_CR2_OIS4      EQU (0x00004000)            ;Output Idle state 4 (OC4 output)
TIM_CR2_OIS5      EQU (0x00010000)            ;Output Idle state 5 (OC5 output)
TIM_CR2_OIS6      EQU (0x00040000)            ;Output Idle state 6 (OC6 output)

TIM_CR2_MMS2      EQU (0x00F00000)            ;MMS[2:0] bits (Master Mode Selection)
TIM_CR2_MMS2_0    EQU (0x00100000)            ;Bit 0
TIM_CR2_MMS2_1    EQU (0x00200000)            ;Bit 1
TIM_CR2_MMS2_2    EQU (0x00400000)            ;Bit 2
TIM_CR2_MMS2_3    EQU (0x00800000)            ;Bit 2

; *******************  Bit definition for TIM_SMCR register  ******************
TIM_SMCR_SMS      EQU (0x00010007)            ;SMS[2:0] bits (Slave mode selection)
TIM_SMCR_SMS_0    EQU (0x00000001)            ;Bit 0
TIM_SMCR_SMS_1    EQU (0x00000002)            ;Bit 1
TIM_SMCR_SMS_2    EQU (0x00000004)            ;Bit 2
TIM_SMCR_SMS_3    EQU (0x00010000)            ;Bit 3

TIM_SMCR_OCCS     EQU (0x00000008)            ; OCREF clear selection

TIM_SMCR_TS       EQU (0x00000070)            ;TS[2:0] bits (Trigger selection)
TIM_SMCR_TS_0     EQU (0x00000010)            ;Bit 0
TIM_SMCR_TS_1     EQU (0x00000020)            ;Bit 1
TIM_SMCR_TS_2     EQU (0x00000040)            ;Bit 2

TIM_SMCR_MSM      EQU (0x00000080)            ;Master/slave mode

TIM_SMCR_ETF      EQU (0x00000F00)            ;ETF[3:0] bits (External trigger filter)
TIM_SMCR_ETF_0    EQU (0x00000100)            ;Bit 0
TIM_SMCR_ETF_1    EQU (0x00000200)            ;Bit 1
TIM_SMCR_ETF_2    EQU (0x00000400)            ;Bit 2
TIM_SMCR_ETF_3    EQU (0x00000800)            ;Bit 3

TIM_SMCR_ETPS     EQU (0x00003000)            ;ETPS[1:0] bits (External trigger prescaler)
TIM_SMCR_ETPS_0   EQU (0x00001000)            ;Bit 0
TIM_SMCR_ETPS_1   EQU (0x00002000)            ;Bit 1

TIM_SMCR_ECE      EQU (0x00004000)            ;External clock enable
TIM_SMCR_ETP      EQU (0x00008000)            ;External trigger polarity

; *******************  Bit definition for TIM_DIER register  ******************
TIM_DIER_UIE      EQU (0x00000001)            ;Update interrupt enable
TIM_DIER_CC1IE    EQU (0x00000002)            ;Capture/Compare 1 interrupt enable
TIM_DIER_CC2IE    EQU (0x00000004)            ;Capture/Compare 2 interrupt enable
TIM_DIER_CC3IE    EQU (0x00000008)            ;Capture/Compare 3 interrupt enable
TIM_DIER_CC4IE    EQU (0x00000010)            ;Capture/Compare 4 interrupt enable
TIM_DIER_COMIE    EQU (0x00000020)            ;COM interrupt enable
TIM_DIER_TIE      EQU (0x00000040)            ;Trigger interrupt enable
TIM_DIER_BIE      EQU (0x00000080)            ;Break interrupt enable
TIM_DIER_UDE      EQU (0x00000100)            ;Update DMA request enable
TIM_DIER_CC1DE    EQU (0x00000200)            ;Capture/Compare 1 DMA request enable
TIM_DIER_CC2DE    EQU (0x00000400)            ;Capture/Compare 2 DMA request enable
TIM_DIER_CC3DE    EQU (0x00000800)            ;Capture/Compare 3 DMA request enable
TIM_DIER_CC4DE    EQU (0x00001000)            ;Capture/Compare 4 DMA request enable
TIM_DIER_COMDE    EQU (0x00002000)            ;COM DMA request enable
TIM_DIER_TDE      EQU (0x00004000)            ;Trigger DMA request enable

; ********************  Bit definition for TIM_SR register  *******************
TIM_SR_UIF        EQU (0x00000001)            ;Update interrupt Flag
TIM_SR_CC1IF      EQU (0x00000002)            ;Capture/Compare 1 interrupt Flag
TIM_SR_CC2IF      EQU (0x00000004)            ;Capture/Compare 2 interrupt Flag
TIM_SR_CC3IF      EQU (0x00000008)            ;Capture/Compare 3 interrupt Flag
TIM_SR_CC4IF      EQU (0x00000010)            ;Capture/Compare 4 interrupt Flag
TIM_SR_COMIF      EQU (0x00000020)            ;COM interrupt Flag
TIM_SR_TIF        EQU (0x00000040)            ;Trigger interrupt Flag
TIM_SR_BIF        EQU (0x00000080)            ;Break interrupt Flag
TIM_SR_B2IF       EQU (0x00000100)            ;Break 2 interrupt Flag
TIM_SR_CC1OF      EQU (0x00000200)            ;Capture/Compare 1 Overcapture Flag
TIM_SR_CC2OF      EQU (0x00000400)            ;Capture/Compare 2 Overcapture Flag
TIM_SR_CC3OF      EQU (0x00000800)            ;Capture/Compare 3 Overcapture Flag
TIM_SR_CC4OF      EQU (0x00001000)            ;Capture/Compare 4 Overcapture Flag
TIM_SR_SBIF       EQU (0x00002000)            ;System Break interrupt Flag
TIM_SR_CC5IF      EQU (0x00010000)            ;Capture/Compare 5 interrupt Flag
TIM_SR_CC6IF      EQU (0x00020000)            ;Capture/Compare 6 interrupt Flag


; *******************  Bit definition for TIM_EGR register  *******************
TIM_EGR_UG        EQU (0x00000001)            ;Update Generation
TIM_EGR_CC1G      EQU (0x00000002)            ;Capture/Compare 1 Generation
TIM_EGR_CC2G      EQU (0x00000004)            ;Capture/Compare 2 Generation
TIM_EGR_CC3G      EQU (0x00000008)            ;Capture/Compare 3 Generation
TIM_EGR_CC4G      EQU (0x00000010)            ;Capture/Compare 4 Generation
TIM_EGR_COMG      EQU (0x00000020)            ;Capture/Compare Control Update Generation
TIM_EGR_TG        EQU (0x00000040)            ;Trigger Generation
TIM_EGR_BG        EQU (0x00000080)            ;Break Generation
TIM_EGR_B2G       EQU (0x00000100)            ;Break 2 Generation


; ******************  Bit definition for TIM_CCMR1 register  ******************
TIM_CCMR1_CC1S    EQU (0x00000003)            ;CC1S[1:0] bits (Capture/Compare 1 Selection)
TIM_CCMR1_CC1S_0  EQU (0x00000001)            ;Bit 0
TIM_CCMR1_CC1S_1  EQU (0x00000002)            ;Bit 1

TIM_CCMR1_OC1FE   EQU (0x00000004)            ;Output Compare 1 Fast enable
TIM_CCMR1_OC1PE   EQU (0x00000008)            ;Output Compare 1 Preload enable

TIM_CCMR1_OC1M    EQU (0x00010070)            ;OC1M[2:0] bits (Output Compare 1 Mode)
TIM_CCMR1_OC1M_0  EQU (0x00000010)            ;Bit 0
TIM_CCMR1_OC1M_1  EQU (0x00000020)            ;Bit 1
TIM_CCMR1_OC1M_2  EQU (0x00000040)            ;Bit 2
TIM_CCMR1_OC1M_3  EQU (0x00010000)            ;Bit 3

