Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
TIM_CCMR1_OC1CE   EQU (0x00000080)            ;Output Compare 1 Clear Enable

TIM_CCMR1_CC2S    EQU (0x00000300)            ;CC2S[1:0] bits (Capture/Compare 2 Selection)
TIM_CCMR1_CC2S_0  EQU (0x00000100)            ;Bit 0
TIM_CCMR1_CC2S_1  EQU (0x00000200)            ;Bit 1

TIM_CCMR1_OC2FE   EQU (0x00000400)            ;Output Compare 2 Fast enable
TIM_CCMR1_OC2PE   EQU (0x00000800)            ;Output Compare 2 Preload enable

TIM_CCMR1_OC2M    EQU (0x01007000)            ;OC2M[2:0] bits (Output Compare 2 Mode)
TIM_CCMR1_OC2M_0  EQU (0x00001000)            ;Bit 0
TIM_CCMR1_OC2M_1  EQU (0x00002000)            ;Bit 1
TIM_CCMR1_OC2M_2  EQU (0x00004000)            ;Bit 2
TIM_CCMR1_OC2M_3  EQU (0x01000000)            ;Bit 3

TIM_CCMR1_OC2CE   EQU (0x00008000)            ;Output Compare 2 Clear Enable

;----------------------------------------------------------------------------
TIM_CCMR1_IC1PSC  EQU (0x0000000C)            ;IC1PSC[1:0] bits (Input Capture 1 Prescaler)
TIM_CCMR1_IC1PSC_0        EQU (0x00000004)            ;Bit 0
TIM_CCMR1_IC1PSC_1        EQU (0x00000008)            ;Bit 1

TIM_CCMR1_IC1F    EQU (0x000000F0)            ;IC1F[3:0] bits (Input Capture 1 Filter)
TIM_CCMR1_IC1F_0  EQU (0x00000010)            ;Bit 0
TIM_CCMR1_IC1F_1  EQU (0x00000020)            ;Bit 1
TIM_CCMR1_IC1F_2  EQU (0x00000040)            ;Bit 2
TIM_CCMR1_IC1F_3  EQU (0x00000080)            ;Bit 3

TIM_CCMR1_IC2PSC  EQU (0x00000C00)            ;IC2PSC[1:0] bits (Input Capture 2 Prescaler)
TIM_CCMR1_IC2PSC_0        EQU (0x00000400)            ;Bit 0
TIM_CCMR1_IC2PSC_1        EQU (0x00000800)            ;Bit 1

TIM_CCMR1_IC2F    EQU (0x0000F000)            ;IC2F[3:0] bits (Input Capture 2 Filter)
TIM_CCMR1_IC2F_0  EQU (0x00001000)            ;Bit 0
TIM_CCMR1_IC2F_1  EQU (0x00002000)            ;Bit 1
TIM_CCMR1_IC2F_2  EQU (0x00004000)            ;Bit 2
TIM_CCMR1_IC2F_3  EQU (0x00008000)            ;Bit 3

; ******************  Bit definition for TIM_CCMR2 register  ******************
TIM_CCMR2_CC3S    EQU (0x00000003)            ;CC3S[1:0] bits (Capture/Compare 3 Selection)
TIM_CCMR2_CC3S_0  EQU (0x00000001)            ;Bit 0
TIM_CCMR2_CC3S_1  EQU (0x00000002)            ;Bit 1

TIM_CCMR2_OC3FE   EQU (0x00000004)            ;Output Compare 3 Fast enable
TIM_CCMR2_OC3PE   EQU (0x00000008)            ;Output Compare 3 Preload enable

TIM_CCMR2_OC3M    EQU (0x00010070)            ;OC3M[2:0] bits (Output Compare 3 Mode)
TIM_CCMR2_OC3M_0  EQU (0x00000010)            ;Bit 0
TIM_CCMR2_OC3M_1  EQU (0x00000020)            ;Bit 1
TIM_CCMR2_OC3M_2  EQU (0x00000040)            ;Bit 2
TIM_CCMR2_OC3M_3  EQU (0x00010000)            ;Bit 3

TIM_CCMR2_OC3CE   EQU (0x00000080)            ;Output Compare 3 Clear Enable

TIM_CCMR2_CC4S    EQU (0x00000300)            ;CC4S[1:0] bits (Capture/Compare 4 Selection)
TIM_CCMR2_CC4S_0  EQU (0x00000100)            ;Bit 0
TIM_CCMR2_CC4S_1  EQU (0x00000200)            ;Bit 1

TIM_CCMR2_OC4FE   EQU (0x00000400)            ;Output Compare 4 Fast enable
TIM_CCMR2_OC4PE   EQU (0x00000800)            ;Output Compare 4 Preload enable

TIM_CCMR2_OC4M    EQU (0x01007000)            ;OC4M[2:0] bits (Output Compare 4 Mode)
TIM_CCMR2_OC4M_0  EQU (0x00001000)            ;Bit 0
TIM_CCMR2_OC4M_1  EQU (0x00002000)            ;Bit 1
TIM_CCMR2_OC4M_2  EQU (0x00004000)            ;Bit 2
TIM_CCMR2_OC4M_3  EQU (0x01000000)            ;Bit 3

TIM_CCMR2_OC4CE   EQU (0x00008000)            ;Output Compare 4 Clear Enable

;----------------------------------------------------------------------------
TIM_CCMR2_IC3PSC  EQU (0x0000000C)            ;IC3PSC[1:0] bits (Input Capture 3 Prescaler)
TIM_CCMR2_IC3PSC_0        EQU (0x00000004)            ;Bit 0
TIM_CCMR2_IC3PSC_1        EQU (0x00000008)            ;Bit 1

TIM_CCMR2_IC3F    EQU (0x000000F0)            ;IC3F[3:0] bits (Input Capture 3 Filter)
TIM_CCMR2_IC3F_0  EQU (0x00000010)            ;Bit 0
TIM_CCMR2_IC3F_1  EQU (0x00000020)            ;Bit 1
TIM_CCMR2_IC3F_2  EQU (0x00000040)            ;Bit 2
TIM_CCMR2_IC3F_3  EQU (0x00000080)            ;Bit 3

TIM_CCMR2_IC4PSC  EQU (0x00000C00)            ;IC4PSC[1:0] bits (Input Capture 4 Prescaler)
TIM_CCMR2_IC4PSC_0        EQU (0x00000400)            ;Bit 0
TIM_CCMR2_IC4PSC_1        EQU (0x00000800)            ;Bit 1

TIM_CCMR2_IC4F    EQU (0x0000F000)            ;IC4F[3:0] bits (Input Capture 4 Filter)
TIM_CCMR2_IC4F_0  EQU (0x00001000)            ;Bit 0
TIM_CCMR2_IC4F_1  EQU (0x00002000)            ;Bit 1
TIM_CCMR2_IC4F_2  EQU (0x00004000)            ;Bit 2
TIM_CCMR2_IC4F_3  EQU (0x00008000)            ;Bit 3

; ******************  Bit definition for TIM_CCMR3 register  ******************
TIM_CCMR3_OC5FE   EQU (0x00000004)            ;Output Compare 5 Fast enable
TIM_CCMR3_OC5PE   EQU (0x00000008)            ;Output Compare 5 Preload enable

TIM_CCMR3_OC5M    EQU (0x00010070)            ;OC5M[3:0] bits (Output Compare 5 Mode)
TIM_CCMR3_OC5M_0  EQU (0x00000010)            ;Bit 0
TIM_CCMR3_OC5M_1  EQU (0x00000020)            ;Bit 1
TIM_CCMR3_OC5M_2  EQU (0x00000040)            ;Bit 2
TIM_CCMR3_OC5M_3  EQU (0x00010000)            ;Bit 3

TIM_CCMR3_OC5CE   EQU (0x00000080)            ;Output Compare 5 Clear Enable

TIM_CCMR3_OC6FE   EQU (0x00000400)            ;Output Compare 6 Fast enable
TIM_CCMR3_OC6PE   EQU (0x00000800)            ;Output Compare 6 Preload enable

TIM_CCMR3_OC6M    EQU (0x01007000)            ;OC6M[3:0] bits (Output Compare 6 Mode)
TIM_CCMR3_OC6M_0  EQU (0x00001000)            ;Bit 0
TIM_CCMR3_OC6M_1  EQU (0x00002000)            ;Bit 1
TIM_CCMR3_OC6M_2  EQU (0x00004000)            ;Bit 2
TIM_CCMR3_OC6M_3  EQU (0x01000000)            ;Bit 3

TIM_CCMR3_OC6CE   EQU (0x00008000)            ;Output Compare 6 Clear Enable

; *******************  Bit definition for TIM_CCER register  ******************
TIM_CCER_CC1E     EQU (0x00000001)            ;Capture/Compare 1 output enable
TIM_CCER_CC1P     EQU (0x00000002)            ;Capture/Compare 1 output Polarity
TIM_CCER_CC1NE    EQU (0x00000004)            ;Capture/Compare 1 Complementary output enable
TIM_CCER_CC1NP    EQU (0x00000008)            ;Capture/Compare 1 Complementary output Polarity
TIM_CCER_CC2E     EQU (0x00000010)            ;Capture/Compare 2 output enable
TIM_CCER_CC2P     EQU (0x00000020)            ;Capture/Compare 2 output Polarity
TIM_CCER_CC2NE    EQU (0x00000040)            ;Capture/Compare 2 Complementary output enable
TIM_CCER_CC2NP    EQU (0x00000080)            ;Capture/Compare 2 Complementary output Polarity
TIM_CCER_CC3E     EQU (0x00000100)            ;Capture/Compare 3 output enable
TIM_CCER_CC3P     EQU (0x00000200)            ;Capture/Compare 3 output Polarity
TIM_CCER_CC3NE    EQU (0x00000400)            ;Capture/Compare 3 Complementary output enable
TIM_CCER_CC3NP    EQU (0x00000800)            ;Capture/Compare 3 Complementary output Polarity
TIM_CCER_CC4E     EQU (0x00001000)            ;Capture/Compare 4 output enable
TIM_CCER_CC4P     EQU (0x00002000)            ;Capture/Compare 4 output Polarity
TIM_CCER_CC4NP    EQU (0x00008000)            ;Capture/Compare 4 Complementary output Polarity
TIM_CCER_CC5E     EQU (0x00010000)            ;Capture/Compare 5 output enable
TIM_CCER_CC5P     EQU (0x00020000)            ;Capture/Compare 5 output Polarity
TIM_CCER_CC6E     EQU (0x00100000)            ;Capture/Compare 6 output enable
TIM_CCER_CC6P     EQU (0x00200000)            ;Capture/Compare 6 output Polarity

; *******************  Bit definition for TIM_CNT register  *******************
TIM_CNT_CNT       EQU (0xFFFFFFFF)            ;Counter Value
TIM_CNT_UIFCPY    EQU (0x80000000)            ;Update interrupt flag copy (if UIFREMAPEQU 1)

; *******************  Bit definition for TIM_PSC register  *******************
TIM_PSC_PSC       EQU (0x0000FFFF)            ;Prescaler Value

