Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *******************  Bit definition for TIM_ARR register  *******************
TIM_ARR_ARR       EQU (0xFFFFFFFF)            ;Actual auto-reload Value

; *******************  Bit definition for TIM_RCR register  *******************
TIM_RCR_REP       EQU (0x0000FFFF)            ;Repetition Counter Value

; *******************  Bit definition for TIM_CCR1 register  ******************
TIM_CCR1_CCR1     EQU (0x0000FFFF)            ;Capture/Compare 1 Value

; *******************  Bit definition for TIM_CCR2 register  ******************
TIM_CCR2_CCR2     EQU (0x0000FFFF)            ;Capture/Compare 2 Value

; *******************  Bit definition for TIM_CCR3 register  ******************
TIM_CCR3_CCR3     EQU (0x0000FFFF)            ;Capture/Compare 3 Value

; *******************  Bit definition for TIM_CCR4 register  ******************
TIM_CCR4_CCR4     EQU (0x0000FFFF)            ;Capture/Compare 4 Value

; *******************  Bit definition for TIM_CCR5 register  ******************
TIM_CCR5_CCR5     EQU (0xFFFFFFFF)            ;Capture/Compare 5 Value
TIM_CCR5_GC5C1    EQU (0x20000000)            ;Group Channel 5 and Channel 1
TIM_CCR5_GC5C2    EQU (0x40000000)            ;Group Channel 5 and Channel 2
TIM_CCR5_GC5C3    EQU (0x80000000)            ;Group Channel 5 and Channel 3

; *******************  Bit definition for TIM_CCR6 register  ******************
TIM_CCR6_CCR6     EQU (0x0000FFFF)            ;Capture/Compare 6 Value

; *******************  Bit definition for TIM_BDTR register  ******************
TIM_BDTR_DTG      EQU (0x000000FF)            ;DTG[0:7] bits (Dead-Time Generator set-up)
TIM_BDTR_DTG_0    EQU (0x00000001)            ;Bit 0
TIM_BDTR_DTG_1    EQU (0x00000002)            ;Bit 1
TIM_BDTR_DTG_2    EQU (0x00000004)            ;Bit 2
TIM_BDTR_DTG_3    EQU (0x00000008)            ;Bit 3
TIM_BDTR_DTG_4    EQU (0x00000010)            ;Bit 4
TIM_BDTR_DTG_5    EQU (0x00000020)            ;Bit 5
TIM_BDTR_DTG_6    EQU (0x00000040)            ;Bit 6
TIM_BDTR_DTG_7    EQU (0x00000080)            ;Bit 7

TIM_BDTR_LOCK     EQU (0x00000300)            ;LOCK[1:0] bits (Lock Configuration)
TIM_BDTR_LOCK_0   EQU (0x00000100)            ;Bit 0
TIM_BDTR_LOCK_1   EQU (0x00000200)            ;Bit 1

TIM_BDTR_OSSI     EQU (0x00000400)            ;Off-State Selection for Idle mode
TIM_BDTR_OSSR     EQU (0x00000800)            ;Off-State Selection for Run mode
TIM_BDTR_BKE      EQU (0x00001000)            ;Break enable for Break 1
TIM_BDTR_BKP      EQU (0x00002000)            ;Break Polarity for Break 1
TIM_BDTR_AOE      EQU (0x00004000)            ;Automatic Output enable
TIM_BDTR_MOE      EQU (0x00008000)            ;Main Output enable

TIM_BDTR_BKF      EQU (0x000F0000)            ;Break Filter for Break 1
TIM_BDTR_BK2F     EQU (0x00F00000)            ;Break Filter for Break 2

TIM_BDTR_BK2E     EQU (0x01000000)            ;Break enable for Break 2
TIM_BDTR_BK2P     EQU (0x02000000)            ;Break Polarity for Break 2

; *******************  Bit definition for TIM_DCR register  *******************
TIM_DCR_DBA       EQU (0x0000001F)            ;DBA[4:0] bits (DMA Base Address)
TIM_DCR_DBA_0     EQU (0x00000001)            ;Bit 0
TIM_DCR_DBA_1     EQU (0x00000002)            ;Bit 1
TIM_DCR_DBA_2     EQU (0x00000004)            ;Bit 2
TIM_DCR_DBA_3     EQU (0x00000008)            ;Bit 3
TIM_DCR_DBA_4     EQU (0x00000010)            ;Bit 4

TIM_DCR_DBL       EQU (0x00001F00)            ;DBL[4:0] bits (DMA Burst Length)
TIM_DCR_DBL_0     EQU (0x00000100)            ;Bit 0
TIM_DCR_DBL_1     EQU (0x00000200)            ;Bit 1
TIM_DCR_DBL_2     EQU (0x00000400)            ;Bit 2
TIM_DCR_DBL_3     EQU (0x00000800)            ;Bit 3
TIM_DCR_DBL_4     EQU (0x00001000)            ;Bit 4

; *******************  Bit definition for TIM_DMAR register  ******************
TIM_DMAR_DMAB     EQU (0x0000FFFF)            ;DMA register for burst accesses

; *******************  Bit definition for TIM1_OR1 register  ******************
TIM1_OR1_ETR_ADC1_RMP      EQU (0x00000003)            ;ETR_ADC1_RMP[1:0] bits (TIM1 ETR remap on ADC1)
TIM1_OR1_ETR_ADC1_RMP_0    EQU (0x00000001)            ;Bit 0
TIM1_OR1_ETR_ADC1_RMP_1    EQU (0x00000002)            ;Bit 1

TIM1_OR1_ETR_ADC3_RMP      EQU (0x0000000C)            ;ETR_ADC3_RMP[1:0] bits (TIM1 ETR remap on ADC3)
TIM1_OR1_ETR_ADC3_RMP_0    EQU (0x00000004)            ;Bit 0
TIM1_OR1_ETR_ADC3_RMP_1    EQU (0x00000008)            ;Bit 1

TIM1_OR1_TI1_RMP   EQU (0x00000010)            ;TIM1 Input Capture 1 remap

; *******************  Bit definition for TIM1_OR2 register  ******************
TIM1_OR2_BKINE     EQU (0x00000001)            ;BRK BKIN input enable
TIM1_OR2_BKCMP1E   EQU (0x00000002)            ;BRK COMP1 enable
TIM1_OR2_BKCMP2E   EQU (0x00000004)            ;BRK COMP2 enable
TIM1_OR2_BKDFBK0E  EQU (0x00000100)            ;BRK DFSDM_BREAK[0] enable
TIM1_OR2_BKINP     EQU (0x00000200)            ;BRK BKIN input polarity
TIM1_OR2_BKCMP1P   EQU (0x00000400)            ;BRK COMP1 input polarity
TIM1_OR2_BKCMP2P   EQU (0x00000800)            ;BRK COMP2 input polarity

TIM1_OR2_ETRSEL    EQU (0x0001C000)            ;ETRSEL[2:0] bits (TIM1 ETR source selection)
TIM1_OR2_ETRSEL_0  EQU (0x00004000)            ;Bit 0
TIM1_OR2_ETRSEL_1  EQU (0x00008000)            ;Bit 1
TIM1_OR2_ETRSEL_2  EQU (0x00010000)            ;Bit 2

; *******************  Bit definition for TIM1_OR3 register  ******************
TIM1_OR3_BK2INE    EQU (0x00000001)            ;BRK2 BKIN2 input enable
TIM1_OR3_BK2CMP1E  EQU (0x00000002)            ;BRK2 COMP1 enable
TIM1_OR3_BK2CMP2E  EQU (0x00000004)            ;BRK2 COMP2 enable
TIM1_OR3_BK2DFBK1E EQU (0x00000100)            ;BRK2 DFSDM_BREAK[1] enable
TIM1_OR3_BK2INP    EQU (0x00000200)            ;BRK2 BKIN2 input polarity
TIM1_OR3_BK2CMP1P  EQU (0x00000400)            ;BRK2 COMP1 input polarity
TIM1_OR3_BK2CMP2P  EQU (0x00000800)            ;BRK2 COMP2 input polarity

; *******************  Bit definition for TIM8_OR1 register  ******************
TIM8_OR1_ETR_ADC2_RMP      EQU (0x00000003)            ;ETR_ADC2_RMP[1:0] bits (TIM8 ETR remap on ADC2)
TIM8_OR1_ETR_ADC2_RMP_0    EQU (0x00000001)            ;Bit 0
TIM8_OR1_ETR_ADC2_RMP_1    EQU (0x00000002)            ;Bit 1

TIM8_OR1_ETR_ADC3_RMP      EQU (0x0000000C)            ;ETR_ADC3_RMP[1:0] bits (TIM8 ETR remap on ADC3)
TIM8_OR1_ETR_ADC3_RMP_0    EQU (0x00000004)            ;Bit 0
TIM8_OR1_ETR_ADC3_RMP_1    EQU (0x00000008)            ;Bit 1

TIM8_OR1_TI1_RMP   EQU (0x00000010)            ;TIM8 Input Capture 1 remap

; *******************  Bit definition for TIM8_OR2 register  ******************
TIM8_OR2_BKINE     EQU (0x00000001)            ;BRK BKIN input enable
TIM8_OR2_BKCMP1E   EQU (0x00000002)            ;BRK COMP1 enable
TIM8_OR2_BKCMP2E   EQU (0x00000004)            ;BRK COMP2 enable
TIM8_OR2_BKDFBK2E  EQU (0x00000100)            ;BRK DFSDM_BREAK[2] enable
TIM8_OR2_BKINP     EQU (0x00000200)            ;BRK BKIN input polarity
TIM8_OR2_BKCMP1P   EQU (0x00000400)            ;BRK COMP1 input polarity
TIM8_OR2_BKCMP2P   EQU (0x00000800)            ;BRK COMP2 input polarity

TIM8_OR2_ETRSEL    EQU (0x0001C000)            ;ETRSEL[2:0] bits (TIM8 ETR source selection)
TIM8_OR2_ETRSEL_0  EQU (0x00004000)            ;Bit 0
TIM8_OR2_ETRSEL_1  EQU (0x00008000)            ;Bit 1
TIM8_OR2_ETRSEL_2  EQU (0x00010000)            ;Bit 2

; *******************  Bit definition for TIM8_OR3 register  ******************
TIM8_OR3_BK2INE    EQU (0x00000001)            ;BRK2 BKIN2 input enable
TIM8_OR3_BK2CMP1E  EQU (0x00000002)            ;BRK2 COMP1 enable
TIM8_OR3_BK2CMP2E  EQU (0x00000004)            ;BRK2 COMP2 enable
TIM8_OR3_BK2DFBK3E EQU (0x00000100)            ;BRK2 DFSDM_BREAK[3] enable
TIM8_OR3_BK2INP    EQU (0x00000200)            ;BRK2 BKIN2 input polarity
TIM8_OR3_BK2CMP1P  EQU (0x00000400)            ;BRK2 COMP1 input polarity
TIM8_OR3_BK2CMP2P  EQU (0x00000800)            ;BRK2 COMP2 input polarity

; *******************  Bit definition for TIM2_OR1 register  ******************
TIM2_OR1_ITR1_RMP  EQU (0x00000001)            ;TIM2 Internal trigger 1 remap
TIM2_OR1_ETR1_RMP  EQU (0x00000002)            ;TIM2 External trigger 1 remap

TIM2_OR1_TI4_RMP   EQU (0x0000000C)            ;TI4_RMP[1:0] bits (TIM2 Input Capture 4 remap)
TIM2_OR1_TI4_RMP_0 EQU (0x00000004)            ;Bit 0
TIM2_OR1_TI4_RMP_1 EQU (0x00000008)            ;Bit 1

; *******************  Bit definition for TIM2_OR2 register  ******************
TIM2_OR2_ETRSEL    EQU (0x0001C000)            ;ETRSEL[2:0] bits (TIM2 ETR source selection)
TIM2_OR2_ETRSEL_0  EQU (0x00004000)            ;Bit 0
TIM2_OR2_ETRSEL_1  EQU (0x00008000)            ;Bit 1
TIM2_OR2_ETRSEL_2  EQU (0x00010000)            ;Bit 2

; *******************  Bit definition for TIM3_OR1 register  ******************
TIM3_OR1_TI1_RMP   EQU (0x00000003)            ;TI1_RMP[1:0] bits (TIM3 Input Capture 1 remap)
TIM3_OR1_TI1_RMP_0 EQU (0x00000001)            ;Bit 0
TIM3_OR1_TI1_RMP_1 EQU (0x00000002)            ;Bit 1

; *******************  Bit definition for TIM3_OR2 register  ******************
TIM3_OR2_ETRSEL    EQU (0x0001C000)            ;ETRSEL[2:0] bits (TIM3 ETR source selection)
TIM3_OR2_ETRSEL_0  EQU (0x00004000)            ;Bit 0
TIM3_OR2_ETRSEL_1  EQU (0x00008000)            ;Bit 1
TIM3_OR2_ETRSEL_2  EQU (0x00010000)            ;Bit 2

; *******************  Bit definition for TIM15_OR1 register  *****************
TIM15_OR1_TI1_RMP  EQU (0x00000001)            ;TIM15 Input Capture 1 remap

