Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
TIM15_OR1_ENCODER_MODE     EQU (0x00000006)            ;ENCODER_MODE[1:0] bits (TIM15 Encoder mode)
TIM15_OR1_ENCODER_MODE_0   EQU (0x00000002)            ;Bit 0
TIM15_OR1_ENCODER_MODE_1   EQU (0x00000004)            ;Bit 1

; *******************  Bit definition for TIM15_OR2 register  *****************
TIM15_OR2_BKINE    EQU (0x00000001)            ;BRK BKIN input enable
TIM15_OR2_BKCMP1E  EQU (0x00000002)            ;BRK COMP1 enable
TIM15_OR2_BKCMP2E  EQU (0x00000004)            ;BRK COMP2 enable
TIM15_OR2_BKDFBK0E EQU (0x00000100)            ;BRK DFSDM_BREAK[0] enable
TIM15_OR2_BKINP    EQU (0x00000200)            ;BRK BKIN input polarity
TIM15_OR2_BKCMP1P  EQU (0x00000400)            ;BRK COMP1 input polarity
TIM15_OR2_BKCMP2P  EQU (0x00000800)            ;BRK COMP2 input polarity

; *******************  Bit definition for TIM16_OR1 register  *****************
TIM16_OR1_TI1_RMP  EQU (0x00000003)            ;TI1_RMP[1:0] bits (TIM16 Input Capture 1 remap)
TIM16_OR1_TI1_RMP_0        EQU (0x00000001)            ;Bit 0
TIM16_OR1_TI1_RMP_1        EQU (0x00000002)            ;Bit 1

; *******************  Bit definition for TIM16_OR2 register  *****************
TIM16_OR2_BKINE    EQU (0x00000001)            ;BRK BKIN input enable
TIM16_OR2_BKCMP1E  EQU (0x00000002)            ;BRK COMP1 enable
TIM16_OR2_BKCMP2E  EQU (0x00000004)            ;BRK COMP2 enable
TIM16_OR2_BKDFBK1E EQU (0x00000100)            ;BRK DFSDM_BREAK[1] enable
TIM16_OR2_BKINP    EQU (0x00000200)            ;BRK BKIN input polarity
TIM16_OR2_BKCMP1P  EQU (0x00000400)            ;BRK COMP1 input polarity
TIM16_OR2_BKCMP2P  EQU (0x00000800)            ;BRK COMP2 input polarity

; *******************  Bit definition for TIM17_OR1 register  *****************
TIM17_OR1_TI1_RMP  EQU (0x00000003)            ;TI1_RMP[1:0] bits (TIM17 Input Capture 1 remap)
TIM17_OR1_TI1_RMP_0        EQU (0x00000001)            ;Bit 0
TIM17_OR1_TI1_RMP_1        EQU (0x00000002)            ;Bit 1

; *******************  Bit definition for TIM17_OR2 register  *****************
TIM17_OR2_BKINE    EQU (0x00000001)            ;BRK BKIN input enable
TIM17_OR2_BKCMP1E  EQU (0x00000002)            ;BRK COMP1 enable
TIM17_OR2_BKCMP2E  EQU (0x00000004)            ;BRK COMP2 enable
TIM17_OR2_BKDFBK2E EQU (0x00000100)            ;BRK DFSDM_BREAK[2] enable
TIM17_OR2_BKINP    EQU (0x00000200)            ;BRK BKIN input polarity
TIM17_OR2_BKCMP1P  EQU (0x00000400)            ;BRK COMP1 input polarity
TIM17_OR2_BKCMP2P  EQU (0x00000800)            ;BRK COMP2 input polarity

; *****************************************************************************
;
;                         Low Power Timer (LPTTIM)
;
; *****************************************************************************
; ******************  Bit definition for LPTIM_ISR register  ******************
LPTIM_ISR_CMPM                 EQU (0x00000001)            ; Compare match
LPTIM_ISR_ARRM                 EQU (0x00000002)            ; Autoreload match
LPTIM_ISR_EXTTRIG              EQU (0x00000004)            ; External trigger edge event
LPTIM_ISR_CMPOK                EQU (0x00000008)            ; Compare register update OK
LPTIM_ISR_ARROK                EQU (0x00000010)            ; Autoreload register update OK
LPTIM_ISR_UP                   EQU (0x00000020)            ; Counter direction change down to up
LPTIM_ISR_DOWN                 EQU (0x00000040)            ; Counter direction change up to down

; ******************  Bit definition for LPTIM_ICR register  ******************
LPTIM_ICR_CMPMCF               EQU (0x00000001)            ; Compare match Clear Flag
LPTIM_ICR_ARRMCF               EQU (0x00000002)            ; Autoreload match Clear Flag
LPTIM_ICR_EXTTRIGCF            EQU (0x00000004)            ; External trigger edge event Clear Flag
LPTIM_ICR_CMPOKCF              EQU (0x00000008)            ; Compare register update OK Clear Flag
LPTIM_ICR_ARROKCF              EQU (0x00000010)            ; Autoreload register update OK Clear Flag
LPTIM_ICR_UPCF                 EQU (0x00000020)            ; Counter direction change down to up Clear Flag
LPTIM_ICR_DOWNCF               EQU (0x00000040)            ; Counter direction change up to down Clear Flag

; ******************  Bit definition for LPTIM_IER register *******************
LPTIM_IER_CMPMIE               EQU (0x00000001)            ; Compare match Interrupt Enable
LPTIM_IER_ARRMIE               EQU (0x00000002)            ; Autoreload match Interrupt Enable
LPTIM_IER_EXTTRIGIE            EQU (0x00000004)            ; External trigger edge event Interrupt Enable
LPTIM_IER_CMPOKIE              EQU (0x00000008)            ; Compare register update OK Interrupt Enable
LPTIM_IER_ARROKIE              EQU (0x00000010)            ; Autoreload register update OK Interrupt Enable
LPTIM_IER_UPIE                 EQU (0x00000020)            ; Counter direction change down to up Interrupt Enable
LPTIM_IER_DOWNIE               EQU (0x00000040)            ; Counter direction change up to down Interrupt Enable

; ******************  Bit definition for LPTIM_CFGR register ******************
LPTIM_CFGR_CKSEL               EQU (0x00000001)             ; Clock selector

LPTIM_CFGR_CKPOL               EQU (0x00000006)             ; CKPOL[1:0] bits (Clock polarity)
LPTIM_CFGR_CKPOL_0             EQU (0x00000002)             ; Bit 0
LPTIM_CFGR_CKPOL_1             EQU (0x00000004)             ; Bit 1

LPTIM_CFGR_CKFLT               EQU (0x00000018)             ; CKFLT[1:0] bits (Configurable digital filter for external clock)
LPTIM_CFGR_CKFLT_0             EQU (0x00000008)             ; Bit 0
LPTIM_CFGR_CKFLT_1             EQU (0x00000010)             ; Bit 1

LPTIM_CFGR_TRGFLT              EQU (0x000000C0)             ; TRGFLT[1:0] bits (Configurable digital filter for trigger)
LPTIM_CFGR_TRGFLT_0            EQU (0x00000040)             ; Bit 0
LPTIM_CFGR_TRGFLT_1            EQU (0x00000080)             ; Bit 1

LPTIM_CFGR_PRESC               EQU (0x00000E00)             ; PRESC[2:0] bits (Clock prescaler)
LPTIM_CFGR_PRESC_0             EQU (0x00000200)             ; Bit 0
LPTIM_CFGR_PRESC_1             EQU (0x00000400)             ; Bit 1
LPTIM_CFGR_PRESC_2             EQU (0x00000800)             ; Bit 2

LPTIM_CFGR_TRIGSEL             EQU (0x0000E000)             ; TRIGSEL[2:0]] bits (Trigger selector)
LPTIM_CFGR_TRIGSEL_0           EQU (0x00002000)             ; Bit 0
LPTIM_CFGR_TRIGSEL_1           EQU (0x00004000)             ; Bit 1
LPTIM_CFGR_TRIGSEL_2           EQU (0x00008000)             ; Bit 2

LPTIM_CFGR_TRIGEN              EQU (0x00060000)             ; TRIGEN[1:0] bits (Trigger enable and polarity)
LPTIM_CFGR_TRIGEN_0            EQU (0x00020000)             ; Bit 0
LPTIM_CFGR_TRIGEN_1            EQU (0x00040000)             ; Bit 1

LPTIM_CFGR_TIMOUT              EQU (0x00080000)             ; Timout enable
LPTIM_CFGR_WAVE                EQU (0x00100000)             ; Waveform shape
LPTIM_CFGR_WAVPOL              EQU (0x00200000)             ; Waveform shape polarity
LPTIM_CFGR_PRELOAD             EQU (0x00400000)             ; Reg update mode
LPTIM_CFGR_COUNTMODE           EQU (0x00800000)             ; Counter mode enable
LPTIM_CFGR_ENC                 EQU (0x01000000)             ; Encoder mode enable

; ******************  Bit definition for LPTIM_CR register  *******************
LPTIM_CR_ENABLE                EQU (0x00000001)             ; LPTIMer enable
LPTIM_CR_SNGSTRT               EQU (0x00000002)             ; Timer start in single mode
LPTIM_CR_CNTSTRT               EQU (0x00000004)             ; Timer start in continuous mode

; ******************  Bit definition for LPTIM_CMP register  ******************
LPTIM_CMP_CMP                  EQU (0x0000FFFF)             ; Compare register

