Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ******************  Bit definition for LPTIM_ARR register  ******************
LPTIM_ARR_ARR                  EQU (0x0000FFFF)             ; Auto reload register

; ******************  Bit definition for LPTIM_CNT register  ******************
LPTIM_CNT_CNT                  EQU (0x0000FFFF)             ; Counter register

; ******************  Bit definition for LPTIM_OR register  ******************
LPTIM_OR_OR                   EQU (0x00000003)               ; LPTIMER[1:0] bits (Remap selection)
LPTIM_OR_OR_0                 EQU (0x00000001)               ; Bit 0
LPTIM_OR_OR_1                 EQU (0x00000002)               ; Bit 1

; *****************************************************************************
;
;                      Analog Comparators (COMP)
;
; *****************************************************************************
; **********************  Bit definition for COMPx_CSR register  **************
COMP_CSR_EN            EQU (0x00000001) ; COMPx enable

COMP_CSR_PWRMODE       EQU (0x0000000C) ; COMPx power mode
COMP_CSR_PWRMODE_0     EQU (0x00000004) ; COMPx power mode bit 0
COMP_CSR_PWRMODE_1     EQU (0x00000008) ; COMPx power mode bit 1

COMP_CSR_INMSEL        EQU (0x00000070) ; COMPx inverting input (minus) selection
COMP_CSR_INMSEL_0      EQU (0x00000010) ; COMPx inverting input (minus) selection bit 0
COMP_CSR_INMSEL_1      EQU (0x00000020) ; COMPx inverting input (minus) selection bit 1
COMP_CSR_INMSEL_2      EQU (0x00000040) ; COMPx inverting input (minus) selection bit 2

COMP_CSR_INPSEL        EQU (0x00000080) ; COMPx non inverting input (plus) selection
COMP_CSR_INPSEL_0      EQU (0x00000080) ; COMPx non inverting input (plus) selection bit 0
COMP_CSR_WINMODE       EQU (0x00000200) ; COMPx window mode (only available on COMP2)
COMP_CSR_POLARITY      EQU (0x00008000) ; COMPx output polarity

COMP_CSR_HYST          EQU (0x00030000) ; COMPx hysteresis
COMP_CSR_HYST_0        EQU (0x00010000) ; COMPx hysteresis bit 0
COMP_CSR_HYST_1        EQU (0x00020000) ; COMPx hysteresis bit 1

COMP_CSR_BLANKING      EQU (0x001C0000) ; COMPx blanking source
COMP_CSR_BLANKING_0    EQU (0x00040000) ; COMPx blanking source bit 0
COMP_CSR_BLANKING_1    EQU (0x00080000) ; COMPx blanking source bit 1
COMP_CSR_BLANKING_2    EQU (0x00100000) ; COMPx blanking source bit 2

COMP_CSR_BRGEN         EQU (0x00400000) ; COMPx voltage scaler enable
COMP_CSR_SCALEN        EQU (0x00800000) ; COMPx scaler bridge enable
COMP_CSR_VALUE         EQU (0x40000000) ; COMPx value
COMP_CSR_LOCK          EQU (0x80000000) ; COMPx lock

; *****************************************************************************
;
;                         Operational Amplifier (OPAMP)
;
; *****************************************************************************
; *********************  Bit definition for OPAMPx_CSR register  **************
OPAMP_CSR_OPAMPxEN    EQU (0x00000001) ; OPAMP enable
OPAMP_CSR_OPALPM      EQU (0x00000002) ; Operational amplifier Low Power Mode

OPAMP_CSR_OPAMODE     EQU (0x0000000C) ; Operational amplifier PGA mode
OPAMP_CSR_OPAMODE_0   EQU (0x00000004) ; Bit 0
OPAMP_CSR_OPAMODE_1   EQU (0x00000008) ; Bit 1

OPAMP_CSR_PGGAIN     EQU (0x00000030) ; Operational amplifier Programmable amplifier gain value
OPAMP_CSR_PGGAIN_0   EQU (0x00000010) ; Bit 0
OPAMP_CSR_PGGAIN_1   EQU (0x00000020) ; Bit 1

OPAMP_CSR_VMSEL       EQU (0x00000300) ; Inverting input selection
OPAMP_CSR_VMSEL_0     EQU (0x00000100) ; Bit 0
OPAMP_CSR_VMSEL_1     EQU (0x00000200) ; Bit 1

OPAMP_CSR_VPSEL       EQU (0x00000400) ; Non inverted input selection
OPAMP_CSR_CALON       EQU (0x00001000) ; Calibration mode enable
OPAMP_CSR_CALSEL      EQU (0x00002000) ; Calibration selection
OPAMP_CSR_USERTRIM    EQU (0x00004000) ; User trimming enable
OPAMP_CSR_CALOUT      EQU (0x00008000) ; Operational amplifier1 calibration output

; *********************  Bit definition for OPAMP1_CSR register  **************
OPAMP1_CSR_OPAEN       EQU (0x00000001) ; Operational amplifier1 Enable
OPAMP1_CSR_OPALPM      EQU (0x00000002) ; Operational amplifier1 Low Power Mode

OPAMP1_CSR_OPAMODE     EQU (0x0000000C) ; Operational amplifier1 PGA mode
OPAMP1_CSR_OPAMODE_0   EQU (0x00000004) ; Bit 0
OPAMP1_CSR_OPAMODE_1   EQU (0x00000008) ; Bit 1

OPAMP1_CSR_PGAGAIN     EQU (0x00000030) ; Operational amplifier1 Programmable amplifier gain value
OPAMP1_CSR_PGAGAIN_0   EQU (0x00000010) ; Bit 0
OPAMP1_CSR_PGAGAIN_1   EQU (0x00000020) ; Bit 1

OPAMP1_CSR_VMSEL       EQU (0x00000300) ; Inverting input selection
OPAMP1_CSR_VMSEL_0     EQU (0x00000100) ; Bit 0
OPAMP1_CSR_VMSEL_1     EQU (0x00000200) ; Bit 1

OPAMP1_CSR_VPSEL       EQU (0x00000400) ; Non inverted input selection
OPAMP1_CSR_CALON       EQU (0x00001000) ; Calibration mode enable
OPAMP1_CSR_CALSEL      EQU (0x00002000) ; Calibration selection
OPAMP1_CSR_USERTRIM    EQU (0x00004000) ; User trimming enable
OPAMP1_CSR_CALOUT      EQU (0x00008000) ; Operational amplifier1 calibration output
OPAMP1_CSR_OPARANGE    EQU (0x80000000) ; Operational amplifiers power supply range for stability

; *********************  Bit definition for OPAMP2_CSR register  **************
OPAMP2_CSR_OPAEN       EQU (0x00000001) ; Operational amplifier2 Enable
OPAMP2_CSR_OPALPM      EQU (0x00000002) ; Operational amplifier2 Low Power Mode

OPAMP2_CSR_OPAMODE     EQU (0x0000000C) ; Operational amplifier2 PGA mode
OPAMP2_CSR_OPAMODE_0   EQU (0x00000004) ; Bit 0
OPAMP2_CSR_OPAMODE_1   EQU (0x00000008) ; Bit 1

OPAMP2_CSR_PGAGAIN     EQU (0x00000030) ; Operational amplifier2 Programmable amplifier gain value
OPAMP2_CSR_PGAGAIN_0   EQU (0x00000010) ; Bit 0
OPAMP2_CSR_PGAGAIN_1   EQU (0x00000020) ; Bit 1

OPAMP2_CSR_VMSEL       EQU (0x00000300) ; Inverting input selection
OPAMP2_CSR_VMSEL_0     EQU (0x00000100) ; Bit 0
OPAMP2_CSR_VMSEL_1     EQU (0x00000200) ; Bit 1

OPAMP2_CSR_VPSEL       EQU (0x00000400) ; Non inverted input selection
OPAMP2_CSR_CALON       EQU (0x00001000) ; Calibration mode enable
OPAMP2_CSR_CALSEL      EQU (0x00002000) ; Calibration selection
OPAMP2_CSR_USERTRIM    EQU (0x00004000) ; User trimming enable
OPAMP2_CSR_CALOUT      EQU (0x00008000) ; Operational amplifier2 calibration output

; *******************  Bit definition for OPAMP_OTR register  *****************
OPAMP_OTR_TRIMOFFSETN    EQU (0x0000001F)        ; Trim for NMOS differential pairs
OPAMP_OTR_TRIMOFFSETP    EQU (0x00001F00)        ; Trim for PMOS differential pairs

; *******************  Bit definition for OPAMP1_OTR register  *****************
OPAMP1_OTR_TRIMOFFSETN    EQU (0x0000001F)        ; Trim for NMOS differential pairs
OPAMP1_OTR_TRIMOFFSETP    EQU (0x00001F00)        ; Trim for PMOS differential pairs

