Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *******************  Bit definition for OPAMP2_OTR register  *****************
OPAMP2_OTR_TRIMOFFSETN    EQU (0x0000001F)        ; Trim for NMOS differential pairs
OPAMP2_OTR_TRIMOFFSETP    EQU (0x00001F00)        ; Trim for PMOS differential pairs

; *******************  Bit definition for OPAMP_LPOTR register  ***************
OPAMP_LPOTR_TRIMLPOFFSETN        EQU (0x0000001F)        ; Trim for NMOS differential pairs
OPAMP_LPOTR_TRIMLPOFFSETP        EQU (0x00001F00)        ; Trim for PMOS differential pairs

; *******************  Bit definition for OPAMP1_LPOTR register  ***************
OPAMP1_LPOTR_TRIMLPOFFSETN        EQU (0x0000001F)        ; Trim for NMOS differential pairs
OPAMP1_LPOTR_TRIMLPOFFSETP        EQU (0x00001F00)        ; Trim for PMOS differential pairs

; *******************  Bit definition for OPAMP2_LPOTR register  ***************
OPAMP2_LPOTR_TRIMLPOFFSETN        EQU (0x0000001F)        ; Trim for NMOS differential pairs
OPAMP2_LPOTR_TRIMLPOFFSETP        EQU (0x00001F00)        ; Trim for PMOS differential pairs

; *****************************************************************************
;
;                          Touch Sensing Controller (TSC)
;
; *****************************************************************************
; *******************  Bit definition for TSC_CR register  ********************
TSC_CR_TSCE                 EQU (0x00000001)            ;Touch sensing controller enable
TSC_CR_START                EQU (0x00000002)            ;Start acquisition
TSC_CR_AM                   EQU (0x00000004)            ;Acquisition mode
TSC_CR_SYNCPOL              EQU (0x00000008)            ;Synchronization pin polarity
TSC_CR_IODEF                EQU (0x00000010)            ;IO default mode

TSC_CR_MCV                  EQU (0x000000E0)            ;MCV[2:0] bits (Max Count Value)
TSC_CR_MCV_0                EQU (0x00000020)            ;Bit 0
TSC_CR_MCV_1                EQU (0x00000040)            ;Bit 1
TSC_CR_MCV_2                EQU (0x00000080)            ;Bit 2

TSC_CR_PGPSC                EQU (0x00007000)            ;PGPSC[2:0] bits (Pulse Generator Prescaler)
TSC_CR_PGPSC_0              EQU (0x00001000)            ;Bit 0
TSC_CR_PGPSC_1              EQU (0x00002000)            ;Bit 1
TSC_CR_PGPSC_2              EQU (0x00004000)            ;Bit 2

TSC_CR_SSPSC                EQU (0x00008000)            ;Spread Spectrum Prescaler
TSC_CR_SSE                  EQU (0x00010000)            ;Spread Spectrum Enable

TSC_CR_SSD                  EQU (0x00FE0000)            ;SSD[6:0] bits (Spread Spectrum Deviation)
TSC_CR_SSD_0                EQU (0x00020000)            ;Bit 0
TSC_CR_SSD_1                EQU (0x00040000)            ;Bit 1
TSC_CR_SSD_2                EQU (0x00080000)            ;Bit 2
TSC_CR_SSD_3                EQU (0x00100000)            ;Bit 3
TSC_CR_SSD_4                EQU (0x00200000)            ;Bit 4
TSC_CR_SSD_5                EQU (0x00400000)            ;Bit 5
TSC_CR_SSD_6                EQU (0x00800000)            ;Bit 6

TSC_CR_CTPL                 EQU (0x0F000000)            ;CTPL[3:0] bits (Charge Transfer pulse low)
TSC_CR_CTPL_0               EQU (0x01000000)            ;Bit 0
TSC_CR_CTPL_1               EQU (0x02000000)            ;Bit 1
TSC_CR_CTPL_2               EQU (0x04000000)            ;Bit 2
TSC_CR_CTPL_3               EQU (0x08000000)            ;Bit 3

TSC_CR_CTPH                 EQU (0xF0000000)            ;CTPH[3:0] bits (Charge Transfer pulse high)
TSC_CR_CTPH_0               EQU (0x10000000)            ;Bit 0
TSC_CR_CTPH_1               EQU (0x20000000)            ;Bit 1
TSC_CR_CTPH_2               EQU (0x40000000)            ;Bit 2
TSC_CR_CTPH_3               EQU (0x80000000)            ;Bit 3

; *******************  Bit definition for TSC_IER register  *******************
TSC_IER_EOAIE               EQU (0x00000001)            ;End of acquisition interrupt enable
TSC_IER_MCEIE               EQU (0x00000002)            ;Max count error interrupt enable

; *******************  Bit definition for TSC_ICR register  *******************
TSC_ICR_EOAIC               EQU (0x00000001)            ;End of acquisition interrupt clear
TSC_ICR_MCEIC               EQU (0x00000002)            ;Max count error interrupt clear

; *******************  Bit definition for TSC_ISR register  *******************
TSC_ISR_EOAF                EQU (0x00000001)            ;End of acquisition flag
TSC_ISR_MCEF                EQU (0x00000002)            ;Max count error flag

; *******************  Bit definition for TSC_IOHCR register  *****************
TSC_IOHCR_G1_IO1            EQU (0x00000001)            ;GROUP1_IO1 schmitt trigger hysteresis mode
TSC_IOHCR_G1_IO2            EQU (0x00000002)            ;GROUP1_IO2 schmitt trigger hysteresis mode
TSC_IOHCR_G1_IO3            EQU (0x00000004)            ;GROUP1_IO3 schmitt trigger hysteresis mode
TSC_IOHCR_G1_IO4            EQU (0x00000008)            ;GROUP1_IO4 schmitt trigger hysteresis mode
TSC_IOHCR_G2_IO1            EQU (0x00000010)            ;GROUP2_IO1 schmitt trigger hysteresis mode
TSC_IOHCR_G2_IO2            EQU (0x00000020)            ;GROUP2_IO2 schmitt trigger hysteresis mode
TSC_IOHCR_G2_IO3            EQU (0x00000040)            ;GROUP2_IO3 schmitt trigger hysteresis mode
TSC_IOHCR_G2_IO4            EQU (0x00000080)            ;GROUP2_IO4 schmitt trigger hysteresis mode
TSC_IOHCR_G3_IO1            EQU (0x00000100)            ;GROUP3_IO1 schmitt trigger hysteresis mode
TSC_IOHCR_G3_IO2            EQU (0x00000200)            ;GROUP3_IO2 schmitt trigger hysteresis mode
TSC_IOHCR_G3_IO3            EQU (0x00000400)            ;GROUP3_IO3 schmitt trigger hysteresis mode
TSC_IOHCR_G3_IO4            EQU (0x00000800)            ;GROUP3_IO4 schmitt trigger hysteresis mode
TSC_IOHCR_G4_IO1            EQU (0x00001000)            ;GROUP4_IO1 schmitt trigger hysteresis mode
TSC_IOHCR_G4_IO2            EQU (0x00002000)            ;GROUP4_IO2 schmitt trigger hysteresis mode
TSC_IOHCR_G4_IO3            EQU (0x00004000)            ;GROUP4_IO3 schmitt trigger hysteresis mode
TSC_IOHCR_G4_IO4            EQU (0x00008000)            ;GROUP4_IO4 schmitt trigger hysteresis mode
TSC_IOHCR_G5_IO1            EQU (0x00010000)            ;GROUP5_IO1 schmitt trigger hysteresis mode
TSC_IOHCR_G5_IO2            EQU (0x00020000)            ;GROUP5_IO2 schmitt trigger hysteresis mode
TSC_IOHCR_G5_IO3            EQU (0x00040000)            ;GROUP5_IO3 schmitt trigger hysteresis mode
TSC_IOHCR_G5_IO4            EQU (0x00080000)            ;GROUP5_IO4 schmitt trigger hysteresis mode
TSC_IOHCR_G6_IO1            EQU (0x00100000)            ;GROUP6_IO1 schmitt trigger hysteresis mode
TSC_IOHCR_G6_IO2            EQU (0x00200000)            ;GROUP6_IO2 schmitt trigger hysteresis mode
TSC_IOHCR_G6_IO3            EQU (0x00400000)            ;GROUP6_IO3 schmitt trigger hysteresis mode
TSC_IOHCR_G6_IO4            EQU (0x00800000)            ;GROUP6_IO4 schmitt trigger hysteresis mode
TSC_IOHCR_G7_IO1            EQU (0x01000000)            ;GROUP7_IO1 schmitt trigger hysteresis mode
TSC_IOHCR_G7_IO2            EQU (0x02000000)            ;GROUP7_IO2 schmitt trigger hysteresis mode
TSC_IOHCR_G7_IO3            EQU (0x04000000)            ;GROUP7_IO3 schmitt trigger hysteresis mode
TSC_IOHCR_G7_IO4            EQU (0x08000000)            ;GROUP7_IO4 schmitt trigger hysteresis mode
TSC_IOHCR_G8_IO1            EQU (0x10000000)            ;GROUP8_IO1 schmitt trigger hysteresis mode
TSC_IOHCR_G8_IO2            EQU (0x20000000)            ;GROUP8_IO2 schmitt trigger hysteresis mode
TSC_IOHCR_G8_IO3            EQU (0x40000000)            ;GROUP8_IO3 schmitt trigger hysteresis mode
TSC_IOHCR_G8_IO4            EQU (0x80000000)            ;GROUP8_IO4 schmitt trigger hysteresis mode

; *******************  Bit definition for TSC_IOASCR register  ****************
TSC_IOASCR_G1_IO1           EQU (0x00000001)            ;GROUP1_IO1 analog switch enable
TSC_IOASCR_G1_IO2           EQU (0x00000002)            ;GROUP1_IO2 analog switch enable
TSC_IOASCR_G1_IO3           EQU (0x00000004)            ;GROUP1_IO3 analog switch enable
TSC_IOASCR_G1_IO4           EQU (0x00000008)            ;GROUP1_IO4 analog switch enable
TSC_IOASCR_G2_IO1           EQU (0x00000010)            ;GROUP2_IO1 analog switch enable
TSC_IOASCR_G2_IO2           EQU (0x00000020)            ;GROUP2_IO2 analog switch enable
TSC_IOASCR_G2_IO3           EQU (0x00000040)            ;GROUP2_IO3 analog switch enable
TSC_IOASCR_G2_IO4           EQU (0x00000080)            ;GROUP2_IO4 analog switch enable
TSC_IOASCR_G3_IO1           EQU (0x00000100)            ;GROUP3_IO1 analog switch enable
TSC_IOASCR_G3_IO2           EQU (0x00000200)            ;GROUP3_IO2 analog switch enable
TSC_IOASCR_G3_IO3           EQU (0x00000400)            ;GROUP3_IO3 analog switch enable
TSC_IOASCR_G3_IO4           EQU (0x00000800)            ;GROUP3_IO4 analog switch enable
TSC_IOASCR_G4_IO1           EQU (0x00001000)            ;GROUP4_IO1 analog switch enable
TSC_IOASCR_G4_IO2           EQU (0x00002000)            ;GROUP4_IO2 analog switch enable
TSC_IOASCR_G4_IO3           EQU (0x00004000)            ;GROUP4_IO3 analog switch enable
TSC_IOASCR_G4_IO4           EQU (0x00008000)            ;GROUP4_IO4 analog switch enable
TSC_IOASCR_G5_IO1           EQU (0x00010000)            ;GROUP5_IO1 analog switch enable
TSC_IOASCR_G5_IO2           EQU (0x00020000)            ;GROUP5_IO2 analog switch enable
TSC_IOASCR_G5_IO3           EQU (0x00040000)            ;GROUP5_IO3 analog switch enable
TSC_IOASCR_G5_IO4           EQU (0x00080000)            ;GROUP5_IO4 analog switch enable
TSC_IOASCR_G6_IO1           EQU (0x00100000)            ;GROUP6_IO1 analog switch enable
TSC_IOASCR_G6_IO2           EQU (0x00200000)            ;GROUP6_IO2 analog switch enable
TSC_IOASCR_G6_IO3           EQU (0x00400000)            ;GROUP6_IO3 analog switch enable
TSC_IOASCR_G6_IO4           EQU (0x00800000)            ;GROUP6_IO4 analog switch enable
TSC_IOASCR_G7_IO1           EQU (0x01000000)            ;GROUP7_IO1 analog switch enable
TSC_IOASCR_G7_IO2           EQU (0x02000000)            ;GROUP7_IO2 analog switch enable
TSC_IOASCR_G7_IO3           EQU (0x04000000)            ;GROUP7_IO3 analog switch enable
TSC_IOASCR_G7_IO4           EQU (0x08000000)            ;GROUP7_IO4 analog switch enable
TSC_IOASCR_G8_IO1           EQU (0x10000000)            ;GROUP8_IO1 analog switch enable
TSC_IOASCR_G8_IO2           EQU (0x20000000)            ;GROUP8_IO2 analog switch enable
TSC_IOASCR_G8_IO3           EQU (0x40000000)            ;GROUP8_IO3 analog switch enable
TSC_IOASCR_G8_IO4           EQU (0x80000000)            ;GROUP8_IO4 analog switch enable

; *******************  Bit definition for TSC_IOSCR register  *****************
TSC_IOSCR_G1_IO1            EQU (0x00000001)            ;GROUP1_IO1 sampling mode
TSC_IOSCR_G1_IO2            EQU (0x00000002)            ;GROUP1_IO2 sampling mode
TSC_IOSCR_G1_IO3            EQU (0x00000004)            ;GROUP1_IO3 sampling mode
TSC_IOSCR_G1_IO4            EQU (0x00000008)            ;GROUP1_IO4 sampling mode
TSC_IOSCR_G2_IO1            EQU (0x00000010)            ;GROUP2_IO1 sampling mode
TSC_IOSCR_G2_IO2            EQU (0x00000020)            ;GROUP2_IO2 sampling mode
TSC_IOSCR_G2_IO3            EQU (0x00000040)            ;GROUP2_IO3 sampling mode
TSC_IOSCR_G2_IO4            EQU (0x00000080)            ;GROUP2_IO4 sampling mode
TSC_IOSCR_G3_IO1            EQU (0x00000100)            ;GROUP3_IO1 sampling mode
TSC_IOSCR_G3_IO2            EQU (0x00000200)            ;GROUP3_IO2 sampling mode
TSC_IOSCR_G3_IO3            EQU (0x00000400)            ;GROUP3_IO3 sampling mode
TSC_IOSCR_G3_IO4            EQU (0x00000800)            ;GROUP3_IO4 sampling mode
TSC_IOSCR_G4_IO1            EQU (0x00001000)            ;GROUP4_IO1 sampling mode
TSC_IOSCR_G4_IO2            EQU (0x00002000)            ;GROUP4_IO2 sampling mode
TSC_IOSCR_G4_IO3            EQU (0x00004000)            ;GROUP4_IO3 sampling mode
TSC_IOSCR_G4_IO4            EQU (0x00008000)            ;GROUP4_IO4 sampling mode
TSC_IOSCR_G5_IO1            EQU (0x00010000)            ;GROUP5_IO1 sampling mode
TSC_IOSCR_G5_IO2            EQU (0x00020000)            ;GROUP5_IO2 sampling mode
TSC_IOSCR_G5_IO3            EQU (0x00040000)            ;GROUP5_IO3 sampling mode
TSC_IOSCR_G5_IO4            EQU (0x00080000)            ;GROUP5_IO4 sampling mode
TSC_IOSCR_G6_IO1            EQU (0x00100000)            ;GROUP6_IO1 sampling mode
TSC_IOSCR_G6_IO2            EQU (0x00200000)            ;GROUP6_IO2 sampling mode
TSC_IOSCR_G6_IO3            EQU (0x00400000)            ;GROUP6_IO3 sampling mode
TSC_IOSCR_G6_IO4            EQU (0x00800000)            ;GROUP6_IO4 sampling mode
TSC_IOSCR_G7_IO1            EQU (0x01000000)            ;GROUP7_IO1 sampling mode
TSC_IOSCR_G7_IO2            EQU (0x02000000)            ;GROUP7_IO2 sampling mode
TSC_IOSCR_G7_IO3            EQU (0x04000000)            ;GROUP7_IO3 sampling mode
TSC_IOSCR_G7_IO4            EQU (0x08000000)            ;GROUP7_IO4 sampling mode
TSC_IOSCR_G8_IO1            EQU (0x10000000)            ;GROUP8_IO1 sampling mode
TSC_IOSCR_G8_IO2            EQU (0x20000000)            ;GROUP8_IO2 sampling mode
TSC_IOSCR_G8_IO3            EQU (0x40000000)            ;GROUP8_IO3 sampling mode
TSC_IOSCR_G8_IO4            EQU (0x80000000)            ;GROUP8_IO4 sampling mode

; *******************  Bit definition for TSC_IOCCR register  *****************
TSC_IOCCR_G1_IO1            EQU (0x00000001)            ;GROUP1_IO1 channel mode
TSC_IOCCR_G1_IO2            EQU (0x00000002)            ;GROUP1_IO2 channel mode
TSC_IOCCR_G1_IO3            EQU (0x00000004)            ;GROUP1_IO3 channel mode
TSC_IOCCR_G1_IO4            EQU (0x00000008)            ;GROUP1_IO4 channel mode
TSC_IOCCR_G2_IO1            EQU (0x00000010)            ;GROUP2_IO1 channel mode
TSC_IOCCR_G2_IO2            EQU (0x00000020)            ;GROUP2_IO2 channel mode
TSC_IOCCR_G2_IO3            EQU (0x00000040)            ;GROUP2_IO3 channel mode
TSC_IOCCR_G2_IO4            EQU (0x00000080)            ;GROUP2_IO4 channel mode
TSC_IOCCR_G3_IO1            EQU (0x00000100)            ;GROUP3_IO1 channel mode
TSC_IOCCR_G3_IO2            EQU (0x00000200)            ;GROUP3_IO2 channel mode
TSC_IOCCR_G3_IO3            EQU (0x00000400)            ;GROUP3_IO3 channel mode
TSC_IOCCR_G3_IO4            EQU (0x00000800)            ;GROUP3_IO4 channel mode
TSC_IOCCR_G4_IO1            EQU (0x00001000)            ;GROUP4_IO1 channel mode
TSC_IOCCR_G4_IO2            EQU (0x00002000)            ;GROUP4_IO2 channel mode
TSC_IOCCR_G4_IO3            EQU (0x00004000)            ;GROUP4_IO3 channel mode
TSC_IOCCR_G4_IO4            EQU (0x00008000)            ;GROUP4_IO4 channel mode
TSC_IOCCR_G5_IO1            EQU (0x00010000)            ;GROUP5_IO1 channel mode
TSC_IOCCR_G5_IO2            EQU (0x00020000)            ;GROUP5_IO2 channel mode
TSC_IOCCR_G5_IO3            EQU (0x00040000)            ;GROUP5_IO3 channel mode
TSC_IOCCR_G5_IO4            EQU (0x00080000)            ;GROUP5_IO4 channel mode
TSC_IOCCR_G6_IO1            EQU (0x00100000)            ;GROUP6_IO1 channel mode
TSC_IOCCR_G6_IO2            EQU (0x00200000)            ;GROUP6_IO2 channel mode
TSC_IOCCR_G6_IO3            EQU (0x00400000)            ;GROUP6_IO3 channel mode
TSC_IOCCR_G6_IO4            EQU (0x00800000)            ;GROUP6_IO4 channel mode
TSC_IOCCR_G7_IO1            EQU (0x01000000)            ;GROUP7_IO1 channel mode
TSC_IOCCR_G7_IO2            EQU (0x02000000)            ;GROUP7_IO2 channel mode
TSC_IOCCR_G7_IO3            EQU (0x04000000)            ;GROUP7_IO3 channel mode
TSC_IOCCR_G7_IO4            EQU (0x08000000)            ;GROUP7_IO4 channel mode
TSC_IOCCR_G8_IO1            EQU (0x10000000)            ;GROUP8_IO1 channel mode
TSC_IOCCR_G8_IO2            EQU (0x20000000)            ;GROUP8_IO2 channel mode
TSC_IOCCR_G8_IO3            EQU (0x40000000)            ;GROUP8_IO3 channel mode
TSC_IOCCR_G8_IO4            EQU (0x80000000)            ;GROUP8_IO4 channel mode

; *******************  Bit definition for TSC_IOGCSR register  ****************
TSC_IOGCSR_G1E              EQU (0x00000001)            ;Analog IO GROUP1 enable
TSC_IOGCSR_G2E              EQU (0x00000002)            ;Analog IO GROUP2 enable
TSC_IOGCSR_G3E              EQU (0x00000004)            ;Analog IO GROUP3 enable
TSC_IOGCSR_G4E              EQU (0x00000008)            ;Analog IO GROUP4 enable
TSC_IOGCSR_G5E              EQU (0x00000010)            ;Analog IO GROUP5 enable
TSC_IOGCSR_G6E              EQU (0x00000020)            ;Analog IO GROUP6 enable
TSC_IOGCSR_G7E              EQU (0x00000040)            ;Analog IO GROUP7 enable
TSC_IOGCSR_G8E              EQU (0x00000080)            ;Analog IO GROUP8 enable
TSC_IOGCSR_G1S              EQU (0x00010000)            ;Analog IO GROUP1 status
TSC_IOGCSR_G2S              EQU (0x00020000)            ;Analog IO GROUP2 status
TSC_IOGCSR_G3S              EQU (0x00040000)            ;Analog IO GROUP3 status
TSC_IOGCSR_G4S              EQU (0x00080000)            ;Analog IO GROUP4 status
TSC_IOGCSR_G5S              EQU (0x00100000)            ;Analog IO GROUP5 status
TSC_IOGCSR_G6S              EQU (0x00200000)            ;Analog IO GROUP6 status
TSC_IOGCSR_G7S              EQU (0x00400000)            ;Analog IO GROUP7 status
TSC_IOGCSR_G8S              EQU (0x00800000)            ;Analog IO GROUP8 status

