Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *******************  Bit definition for TSC_IOGXCR register  ****************
TSC_IOGXCR_CNT              EQU (0x00003FFF)            ;CNT[13:0] bits (Counter value)

; *****************************************************************************
;
;      Universal Synchronous Asynchronous Receiver Transmitter (USART)
;
; *****************************************************************************
; ******************  Bit definition for USART_CR1 register  ******************
USART_CR1_UE                EQU (0x00000001)            ; USART Enable
USART_CR1_UESM              EQU (0x00000002)            ; USART Enable in STOP Mode
USART_CR1_RE                EQU (0x00000004)            ; Receiver Enable
USART_CR1_TE                EQU (0x00000008)            ; Transmitter Enable
USART_CR1_IDLEIE            EQU (0x00000010)            ; IDLE Interrupt Enable
USART_CR1_RXNEIE            EQU (0x00000020)            ; RXNE Interrupt Enable
USART_CR1_TCIE              EQU (0x00000040)            ; Transmission Complete Interrupt Enable
USART_CR1_TXEIE             EQU (0x00000080)            ; TXE Interrupt Enable
USART_CR1_PEIE              EQU (0x00000100)            ; PE Interrupt Enable
USART_CR1_PS                EQU (0x00000200)            ; Parity Selection
USART_CR1_PCE               EQU (0x00000400)            ; Parity Control Enable
USART_CR1_WAKE              EQU (0x00000800)            ; Receiver Wakeup method
USART_CR1_M                 EQU (0x10001000)            ; Word length
USART_CR1_M0                EQU (0x00001000)            ; Word length - Bit 0
USART_CR1_MME               EQU (0x00002000)            ; Mute Mode Enable
USART_CR1_CMIE              EQU (0x00004000)            ; Character match interrupt enable
USART_CR1_OVER8             EQU (0x00008000)            ; Oversampling by 8-bit or 16-bit mode
USART_CR1_DEDT              EQU (0x001F0000)            ; DEDT[4:0] bits (Driver Enable Deassertion Time)
USART_CR1_DEDT_0            EQU (0x00010000)            ; Bit 0
USART_CR1_DEDT_1            EQU (0x00020000)            ; Bit 1
USART_CR1_DEDT_2            EQU (0x00040000)            ; Bit 2
USART_CR1_DEDT_3            EQU (0x00080000)            ; Bit 3
USART_CR1_DEDT_4            EQU (0x00100000)            ; Bit 4
USART_CR1_DEAT              EQU (0x03E00000)            ; DEAT[4:0] bits (Driver Enable Assertion Time)
USART_CR1_DEAT_0            EQU (0x00200000)            ; Bit 0
USART_CR1_DEAT_1            EQU (0x00400000)            ; Bit 1
USART_CR1_DEAT_2            EQU (0x00800000)            ; Bit 2
USART_CR1_DEAT_3            EQU (0x01000000)            ; Bit 3
USART_CR1_DEAT_4            EQU (0x02000000)            ; Bit 4
USART_CR1_RTOIE             EQU (0x04000000)            ; Receive Time Out interrupt enable
USART_CR1_EOBIE             EQU (0x08000000)            ; End of Block interrupt enable
USART_CR1_M1                EQU (0x10000000)            ; Word length - Bit 1

; ******************  Bit definition for USART_CR2 register  ******************
USART_CR2_ADDM7             EQU (0x00000010)            ; 7-bit or 4-bit Address Detection
USART_CR2_LBDL              EQU (0x00000020)            ; LIN Break Detection Length
USART_CR2_LBDIE             EQU (0x00000040)            ; LIN Break Detection Interrupt Enable
USART_CR2_LBCL              EQU (0x00000100)            ; Last Bit Clock pulse
USART_CR2_CPHA              EQU (0x00000200)            ; Clock Phase
USART_CR2_CPOL              EQU (0x00000400)            ; Clock Polarity
USART_CR2_CLKEN             EQU (0x00000800)            ; Clock Enable
USART_CR2_STOP              EQU (0x00003000)            ; STOP[1:0] bits (STOP bits)
USART_CR2_STOP_0            EQU (0x00001000)            ; Bit 0
USART_CR2_STOP_1            EQU (0x00002000)            ; Bit 1
USART_CR2_LINEN             EQU (0x00004000)            ; LIN mode enable
USART_CR2_SWAP              EQU (0x00008000)            ; SWAP TX/RX pins
USART_CR2_RXINV             EQU (0x00010000)            ; RX pin active level inversion
USART_CR2_TXINV             EQU (0x00020000)            ; TX pin active level inversion
USART_CR2_DATAINV           EQU (0x00040000)            ; Binary data inversion
USART_CR2_MSBFIRST          EQU (0x00080000)            ; Most Significant Bit First
USART_CR2_ABREN             EQU (0x00100000)            ; Auto Baud-Rate Enable
USART_CR2_ABRMODE           EQU (0x00600000)            ; ABRMOD[1:0] bits (Auto Baud-Rate Mode)
USART_CR2_ABRMODE_0         EQU (0x00200000)            ; Bit 0
USART_CR2_ABRMODE_1         EQU (0x00400000)            ; Bit 1
USART_CR2_RTOEN             EQU (0x00800000)            ; Receiver Time-Out enable
USART_CR2_ADD               EQU (0xFF000000)            ; Address of the USART node

; ******************  Bit definition for USART_CR3 register  ******************
USART_CR3_EIE               EQU (0x00000001)            ; Error Interrupt Enable
USART_CR3_IREN              EQU (0x00000002)            ; IrDA mode Enable
USART_CR3_IRLP              EQU (0x00000004)            ; IrDA Low-Power
USART_CR3_HDSEL             EQU (0x00000008)            ; Half-Duplex Selection
USART_CR3_NACK              EQU (0x00000010)            ; SmartCard NACK enable
USART_CR3_SCEN              EQU (0x00000020)            ; SmartCard mode enable
USART_CR3_DMAR              EQU (0x00000040)            ; DMA Enable Receiver
USART_CR3_DMAT              EQU (0x00000080)            ; DMA Enable Transmitter
USART_CR3_RTSE              EQU (0x00000100)            ; RTS Enable
USART_CR3_CTSE              EQU (0x00000200)            ; CTS Enable
USART_CR3_CTSIE             EQU (0x00000400)            ; CTS Interrupt Enable
USART_CR3_ONEBIT            EQU (0x00000800)            ; One sample bit method enable
USART_CR3_OVRDIS            EQU (0x00001000)            ; Overrun Disable
USART_CR3_DDRE              EQU (0x00002000)            ; DMA Disable on Reception Error
USART_CR3_DEM               EQU (0x00004000)            ; Driver Enable Mode
USART_CR3_DEP               EQU (0x00008000)            ; Driver Enable Polarity Selection
USART_CR3_SCARCNT           EQU (0x000E0000)            ; SCARCNT[2:0] bits (SmartCard Auto-Retry Count)
USART_CR3_SCARCNT_0         EQU (0x00020000)            ; Bit 0
USART_CR3_SCARCNT_1         EQU (0x00040000)            ; Bit 1
USART_CR3_SCARCNT_2         EQU (0x00080000)            ; Bit 2
USART_CR3_WUS               EQU (0x00300000)            ; WUS[1:0] bits (Wake UP Interrupt Flag Selection)
USART_CR3_WUS_0             EQU (0x00100000)            ; Bit 0
USART_CR3_WUS_1             EQU (0x00200000)            ; Bit 1
USART_CR3_WUFIE             EQU (0x00400000)            ; Wake Up Interrupt Enable

; ******************  Bit definition for USART_BRR register  ******************
USART_BRR_DIV_FRACTION      EQU (0x000F)                ; Fraction of USARTDIV
USART_BRR_DIV_MANTISSA      EQU (0xFFF0)                ; Mantissa of USARTDIV

