Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ******************  Bit definition for USART_GTPR register  *****************
USART_GTPR_PSC              EQU (0x000000FF)            ; PSC[7:0] bits (Prescaler value)
USART_GTPR_GT               EQU (0x0000FF00)            ; GT[7:0] bits (Guard time value)


; *******************  Bit definition for USART_RTOR register  ****************
USART_RTOR_RTO              EQU (0x00FFFFFF)            ; Receiver Time Out Value
USART_RTOR_BLEN             EQU (0xFF000000)            ; Block Length

; *******************  Bit definition for USART_RQR register  *****************
USART_RQR_ABRRQ             EQU (0x0001)                ; Auto-Baud Rate Request
USART_RQR_SBKRQ             EQU (0x0002)                ; Send Break Request
USART_RQR_MMRQ              EQU (0x0004)                ; Mute Mode Request
USART_RQR_RXFRQ             EQU (0x0008)                ; Receive Data flush Request
USART_RQR_TXFRQ             EQU (0x0010)                ; Transmit data flush Request

; *******************  Bit definition for USART_ISR register  *****************
USART_ISR_PE                EQU (0x00000001)            ; Parity Error
USART_ISR_FE                EQU (0x00000002)            ; Framing Error
USART_ISR_NE                EQU (0x00000004)            ; Noise detected Flag
USART_ISR_ORE               EQU (0x00000008)            ; OverRun Error
USART_ISR_IDLE              EQU (0x00000010)            ; IDLE line detected
USART_ISR_RXNE              EQU (0x00000020)            ; Read Data Register Not Empty
USART_ISR_TC                EQU (0x00000040)            ; Transmission Complete
USART_ISR_TXE               EQU (0x00000080)            ; Transmit Data Register Empty
USART_ISR_LBDF              EQU (0x00000100)            ; LIN Break Detection Flag
USART_ISR_CTSIF             EQU (0x00000200)            ; CTS interrupt flag
USART_ISR_CTS               EQU (0x00000400)            ; CTS flag
USART_ISR_RTOF              EQU (0x00000800)            ; Receiver Time Out
USART_ISR_EOBF              EQU (0x00001000)            ; End Of Block Flag
USART_ISR_ABRE              EQU (0x00004000)            ; Auto-Baud Rate Error
USART_ISR_ABRF              EQU (0x00008000)            ; Auto-Baud Rate Flag
USART_ISR_BUSY              EQU (0x00010000)            ; Busy Flag
USART_ISR_CMF               EQU (0x00020000)            ; Character Match Flag
USART_ISR_SBKF              EQU (0x00040000)            ; Send Break Flag
USART_ISR_RWU               EQU (0x00080000)            ; Receive Wake Up from mute mode Flag
USART_ISR_WUF               EQU (0x00100000)            ; Wake Up from stop mode Flag
USART_ISR_TEACK             EQU (0x00200000)            ; Transmit Enable Acknowledge Flag
USART_ISR_REACK             EQU (0x00400000)            ; Receive Enable Acknowledge Flag

; *******************  Bit definition for USART_ICR register  *****************
USART_ICR_PECF              EQU (0x00000001)            ; Parity Error Clear Flag
USART_ICR_FECF              EQU (0x00000002)            ; Framing Error Clear Flag
USART_ICR_NCF               EQU (0x00000004)            ; Noise detected Clear Flag
USART_ICR_ORECF             EQU (0x00000008)            ; OverRun Error Clear Flag
USART_ICR_IDLECF            EQU (0x00000010)            ; IDLE line detected Clear Flag
USART_ICR_TCCF              EQU (0x00000040)            ; Transmission Complete Clear Flag
USART_ICR_LBDCF             EQU (0x00000100)            ; LIN Break Detection Clear Flag
USART_ICR_CTSCF             EQU (0x00000200)            ; CTS Interrupt Clear Flag
USART_ICR_RTOCF             EQU (0x00000800)            ; Receiver Time Out Clear Flag
USART_ICR_EOBCF             EQU (0x00001000)            ; End Of Block Clear Flag
USART_ICR_CMCF              EQU (0x00020000)            ; Character Match Clear Flag
USART_ICR_WUCF              EQU (0x00100000)            ; Wake Up from stop mode Clear Flag

; *******************  Bit definition for USART_RDR register  *****************
USART_RDR_RDR               EQU (0x01FF)                ; RDR[8:0] bits (Receive Data value)

; *******************  Bit definition for USART_TDR register  *****************
USART_TDR_TDR               EQU (0x01FF)                ; TDR[8:0] bits (Transmit Data value)

; *****************************************************************************
;
;           Single Wire Protocol Master Interface (SWPMI)
;
; *****************************************************************************

; *******************  Bit definition for SWPMI_CR register   *******************
SWPMI_CR_RXDMA              EQU (0x00000001)        ;Reception DMA enable
SWPMI_CR_TXDMA              EQU (0x00000002)        ;Transmission DMA enable
SWPMI_CR_RXMODE             EQU (0x00000004)        ;Reception buffering mode
SWPMI_CR_TXMODE             EQU (0x00000008)        ;Transmission buffering mode
SWPMI_CR_LPBK               EQU (0x00000010)        ;Loopback mode enable
SWPMI_CR_SWPACT             EQU (0x00000020)        ;Single wire protocol master interface activate
SWPMI_CR_DEACT              EQU (0x00000400)        ;Single wire protocol master interface deactivate

; *******************  Bit definition for SWPMI_BRR register  *******************
SWPMI_BRR_BR                EQU (0x0000003F)        ;BR[5:0] bits (Bitrate prescaler)

; *******************  Bit definition for SWPMI_ISR register  *******************
SWPMI_ISR_RXBFF             EQU (0x00000001)        ;Receive buffer full flag
SWPMI_ISR_TXBEF             EQU (0x00000002)        ;Transmit buffer empty flag
SWPMI_ISR_RXBERF            EQU (0x00000004)        ;Receive CRC error flag
SWPMI_ISR_RXOVRF            EQU (0x00000008)        ;Receive overrun error flag
SWPMI_ISR_TXUNRF            EQU (0x00000010)        ;Transmit underrun error flag
SWPMI_ISR_RXNE              EQU (0x00000020)        ;Receive data register not empty
SWPMI_ISR_TXE               EQU (0x00000040)        ;Transmit data register empty
SWPMI_ISR_TCF               EQU (0x00000080)        ;Transfer complete flag
SWPMI_ISR_SRF               EQU (0x00000100)        ;Slave resume flag
SWPMI_ISR_SUSP              EQU (0x00000200)        ;SUSPEND flag
SWPMI_ISR_DEACTF            EQU (0x00000400)        ;DEACTIVATED flag

; *******************  Bit definition for SWPMI_ICR register  *******************
SWPMI_ICR_CRXBFF            EQU (0x00000001)        ;Clear receive buffer full flag
SWPMI_ICR_CTXBEF            EQU (0x00000002)        ;Clear transmit buffer empty flag
SWPMI_ICR_CRXBERF           EQU (0x00000004)        ;Clear receive CRC error flag
SWPMI_ICR_CRXOVRF           EQU (0x00000008)        ;Clear receive overrun error flag
SWPMI_ICR_CTXUNRF           EQU (0x00000010)        ;Clear transmit underrun error flag
SWPMI_ICR_CTCF              EQU (0x00000080)        ;Clear transfer complete flag
SWPMI_ICR_CSRF              EQU (0x00000100)        ;Clear slave resume flag

