Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; *******************  Bit definition for SWPMI_IER register  *******************
SWPMI_IER_SRIE              EQU (0x00000100)        ;Slave resume interrupt enable
SWPMI_IER_TCIE              EQU (0x00000080)        ;Transmit complete interrupt enable
SWPMI_IER_TIE               EQU (0x00000040)        ;Transmit interrupt enable
SWPMI_IER_RIE               EQU (0x00000020)        ;Receive interrupt enable
SWPMI_IER_TXUNRIE           EQU (0x00000010)        ;Transmit underrun error interrupt enable
SWPMI_IER_RXOVRIE           EQU (0x00000008)        ;Receive overrun error interrupt enable
SWPMI_IER_RXBERIE           EQU (0x00000004)        ;Receive CRC error interrupt enable
SWPMI_IER_TXBEIE            EQU (0x00000002)        ;Transmit buffer empty interrupt enable
SWPMI_IER_RXBFIE            EQU (0x00000001)        ;Receive buffer full interrupt enable

; *******************  Bit definition for SWPMI_RFL register  *******************
SWPMI_RFL_RFL               EQU (0x0000001F)        ;RFL[4:0] bits (Receive Frame length)
SWPMI_RFL_RFL_0_1           EQU (0x00000003)        ;RFL[1:0] bits (number of relevant bytes for the last SWPMI_RDR register read.)

; *******************  Bit definition for SWPMI_TDR register  *******************
SWPMI_TDR_TD                EQU (0xFFFFFFFF)        ;Transmit Data Register

; *******************  Bit definition for SWPMI_RDR register  *******************
SWPMI_RDR_RD                EQU (0xFFFFFFFF)        ;Receive Data Register

; *******************  Bit definition for SWPMI_OR register  *******************
SWPMI_OR_TBYP               EQU (0x00000001)        ;SWP Transceiver Bypass
SWPMI_OR_CLASS              EQU (0x00000002)        ;SWP Voltage Class selection

; *****************************************************************************
;
;                                 VREFBUF
;
; *****************************************************************************
; *******************  Bit definition for VREFBUF_CSR register  ***************
VREFBUF_CSR_ENVR            EQU (0x00000001)        ;Voltage reference buffer enable
VREFBUF_CSR_HIZ             EQU (0x00000002)        ;High impedance mode
VREFBUF_CSR_VRS             EQU (0x00000004)        ;Voltage reference scale
VREFBUF_CSR_VRR             EQU (0x00000008)        ;Voltage reference buffer ready

; *******************  Bit definition for VREFBUF_CCR register  *****************
VREFBUF_CCR_TRIM            EQU (0x0000003F)        ;TRIM[5:0] bits (Trimming code)

; *****************************************************************************
;
;                            Window WATCHDOG
;
; *****************************************************************************
; *******************  Bit definition for WWDG_CR register  *******************
WWDG_CR_T                   EQU (0x0000007F)        ;T[6:0] bits (7-Bit counter (MSB to LSB))
WWDG_CR_T_0                 EQU (0x00000001)        ;Bit 0
WWDG_CR_T_1                 EQU (0x00000002)        ;Bit 1
WWDG_CR_T_2                 EQU (0x00000004)        ;Bit 2
WWDG_CR_T_3                 EQU (0x00000008)        ;Bit 3
WWDG_CR_T_4                 EQU (0x00000010)        ;Bit 4
WWDG_CR_T_5                 EQU (0x00000020)        ;Bit 5
WWDG_CR_T_6                 EQU (0x00000040)        ;Bit 6

WWDG_CR_WDGA                EQU (0x00000080)        ;Activation bit

; *******************  Bit definition for WWDG_CFR register  ******************
WWDG_CFR_W                  EQU (0x0000007F)        ;W[6:0] bits (7-bit window value)
WWDG_CFR_W_0                EQU (0x00000001)        ;Bit 0
WWDG_CFR_W_1                EQU (0x00000002)        ;Bit 1
WWDG_CFR_W_2                EQU (0x00000004)        ;Bit 2
WWDG_CFR_W_3                EQU (0x00000008)        ;Bit 3
WWDG_CFR_W_4                EQU (0x00000010)        ;Bit 4
WWDG_CFR_W_5                EQU (0x00000020)        ;Bit 5
WWDG_CFR_W_6                EQU (0x00000040)        ;Bit 6

WWDG_CFR_WDGTB              EQU (0x00000180)        ;WDGTB[1:0] bits (Timer Base)
WWDG_CFR_WDGTB_0            EQU (0x00000080)        ;Bit 0
WWDG_CFR_WDGTB_1            EQU (0x00000100)        ;Bit 1

WWDG_CFR_EWI                EQU (0x00000200)        ;Early Wakeup Interrupt

; *******************  Bit definition for WWDG_SR register  *******************
WWDG_SR_EWIF                EQU (0x00000001)        ;Early Wakeup Interrupt Flag


; *****************************************************************************
;
;                                 Debug MCU
;
; *****************************************************************************
; ********************  Bit definition for DBGMCU_IDCODE register  ************
DBGMCU_IDCODE_DEV_ID        EQU (0x00000FFF)
DBGMCU_IDCODE_REV_ID        EQU (0xFFFF0000)

; ********************  Bit definition for DBGMCU_CR register  ****************
DBGMCU_CR_DBG_SLEEP         EQU (0x00000001)
DBGMCU_CR_DBG_STOP          EQU (0x00000002)
DBGMCU_CR_DBG_STANDBY       EQU (0x00000004)
DBGMCU_CR_TRACE_IOEN        EQU (0x00000020)

DBGMCU_CR_TRACE_MODE        EQU (0x000000C0)
DBGMCU_CR_TRACE_MODE_0      EQU (0x00000040);Bit 0
DBGMCU_CR_TRACE_MODE_1      EQU (0x00000080);Bit 1

; ********************  Bit definition for DBGMCU_APB1FZR1 register  **********
DBGMCU_APB1FZR1_DBG_TIM2_STOP       EQU (0x00000001)
DBGMCU_APB1FZR1_DBG_TIM3_STOP       EQU (0x00000002)
DBGMCU_APB1FZR1_DBG_TIM4_STOP       EQU (0x00000004)
DBGMCU_APB1FZR1_DBG_TIM5_STOP       EQU (0x00000008)
DBGMCU_APB1FZR1_DBG_TIM6_STOP       EQU (0x00000010)
DBGMCU_APB1FZR1_DBG_TIM7_STOP       EQU (0x00000020)
DBGMCU_APB1FZR1_DBG_RTC_STOP        EQU (0x00000400)
DBGMCU_APB1FZR1_DBG_WWDG_STOP       EQU (0x00000800)
DBGMCU_APB1FZR1_DBG_IWDG_STOP       EQU (0x00001000)
DBGMCU_APB1FZR1_DBG_I2C1_STOP       EQU (0x00200000)
DBGMCU_APB1FZR1_DBG_I2C2_STOP       EQU (0x00400000)
DBGMCU_APB1FZR1_DBG_I2C3_STOP       EQU (0x00800000)
DBGMCU_APB1FZR1_DBG_CAN_STOP        EQU (0x02000000)
DBGMCU_APB1FZR1_DBG_LPTIM1_STOP     EQU (0x80000000)

