Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bit definition for DBGMCU_APB1FZR2 register  *********
DBGMCU_APB1FZR2_DBG_LPTIM2_STOP     EQU (0x00000020)

; ********************  Bit definition for DBGMCU_APB2FZ register  ***********
DBGMCU_APB2FZ_DBG_TIM1_STOP EQU (0x00000800)
DBGMCU_APB2FZ_DBG_TIM8_STOP EQU (0x00002000)
DBGMCU_APB2FZ_DBG_TIM15_STOP        EQU (0x00010000)
DBGMCU_APB2FZ_DBG_TIM16_STOP        EQU (0x00020000)
DBGMCU_APB2FZ_DBG_TIM17_STOP        EQU (0x00040000)

; *****************************************************************************
;
;                                       USB_OTG
;
; *****************************************************************************
; ********************  Bit definition for USB_OTG_GOTGCTL register  *******************
USB_OTG_GOTGCTL_SRQSCS          EQU (0x00000001)         ; Session request success
USB_OTG_GOTGCTL_SRQ             EQU (0x00000002)         ; Session request
USB_OTG_GOTGCTL_VBVALOEN        EQU (0x00000004)         ; VBUS valid override enable
USB_OTG_GOTGCTL_VBVALOVAL       EQU (0x00000008)         ; VBUS valid override value
USB_OTG_GOTGCTL_AVALOEN         EQU (0x00000010)         ; A-peripheral session valid override enable
USB_OTG_GOTGCTL_AVALOVAL        EQU (0x00000020)         ; A-peripheral session valid override value
USB_OTG_GOTGCTL_BVALOEN         EQU (0x00000040)         ; B-peripheral session valid override enable
USB_OTG_GOTGCTL_BVALOVAL        EQU (0x00000080)         ; B-peripheral session valid override value
USB_OTG_GOTGCTL_BSESVLD         EQU (0x00080000)         ;  B-session valid

; ********************  Bit definition for USB_OTG_HCFG register  *******************

USB_OTG_HCFG_FSLSPCS         EQU (0x00000003)            ; FS/LS PHY clock select
USB_OTG_HCFG_FSLSPCS_0       EQU (0x00000001)            ;Bit 0
USB_OTG_HCFG_FSLSPCS_1       EQU (0x00000002)            ;Bit 1
USB_OTG_HCFG_FSLSS           EQU (0x00000004)            ; FS- and LS-only support

; ********************  Bit definition for USB_OTG_DCFG register  *******************

USB_OTG_DCFG_DSPD            EQU (0x00000003)            ; Device speed
USB_OTG_DCFG_DSPD_0          EQU (0x00000001)            ;Bit 0
USB_OTG_DCFG_DSPD_1          EQU (0x00000002)            ;Bit 1
USB_OTG_DCFG_NZLSOHSK        EQU (0x00000004)            ; Nonzero-length status OUT handshake
USB_OTG_DCFG_DAD             EQU (0x000007F0)            ; Device address
USB_OTG_DCFG_DAD_0           EQU (0x00000010)            ;Bit 0
USB_OTG_DCFG_DAD_1           EQU (0x00000020)            ;Bit 1
USB_OTG_DCFG_DAD_2           EQU (0x00000040)            ;Bit 2
USB_OTG_DCFG_DAD_3           EQU (0x00000080)            ;Bit 3
USB_OTG_DCFG_DAD_4           EQU (0x00000100)            ;Bit 4
USB_OTG_DCFG_DAD_5           EQU (0x00000200)            ;Bit 5
USB_OTG_DCFG_DAD_6           EQU (0x00000400)            ;Bit 6
USB_OTG_DCFG_PFIVL           EQU (0x00001800)            ; Periodic (micro)frame interval
USB_OTG_DCFG_PFIVL_0         EQU (0x00000800)            ;Bit 0
USB_OTG_DCFG_PFIVL_1         EQU (0x00001000)            ;Bit 1
USB_OTG_DCFG_PERSCHIVL       EQU (0x03000000)            ; Periodic scheduling interval
USB_OTG_DCFG_PERSCHIVL_0     EQU (0x01000000)            ;Bit 0
USB_OTG_DCFG_PERSCHIVL_1     EQU (0x02000000)            ;Bit 1

; ********************  Bit definition for USB_OTG_PCGCR register  *******************
USB_OTG_PCGCR_STPPCLK         EQU (0x00000001)           ; Stop PHY clock
USB_OTG_PCGCR_GATEHCLK        EQU (0x00000002)           ; Gate HCLK
USB_OTG_PCGCR_PHYSUSP         EQU (0x00000010)           ; PHY suspended

; ********************  Bit definition for USB_OTG_GOTGINT register  *******************
USB_OTG_GOTGINT_SEDET           EQU (0x00000004)         ; Session end detected
USB_OTG_GOTGINT_SRSSCHG         EQU (0x00000100)         ; Session request success status change
USB_OTG_GOTGINT_HNSSCHG         EQU (0x00000200)         ; Host negotiation success status change
USB_OTG_GOTGINT_HNGDET          EQU (0x00020000)         ; Host negotiation detected
USB_OTG_GOTGINT_ADTOCHG         EQU (0x00040000)         ; A-device timeout change
USB_OTG_GOTGINT_DBCDNE          EQU (0x00080000)         ; Debounce done

; ********************  Bit definition for USB_OTG_DCTL register  *******************
USB_OTG_DCTL_RWUSIG          EQU (0x00000001)            ; Remote wakeup signaling
USB_OTG_DCTL_SDIS            EQU (0x00000002)            ; Soft disconnect
USB_OTG_DCTL_GINSTS          EQU (0x00000004)            ; Global IN NAK status
USB_OTG_DCTL_GONSTS          EQU (0x00000008)            ; Global OUT NAK status

USB_OTG_DCTL_TCTL            EQU (0x00000070)            ; Test control
USB_OTG_DCTL_TCTL_0          EQU (0x00000010)            ;Bit 0
USB_OTG_DCTL_TCTL_1          EQU (0x00000020)            ;Bit 1
USB_OTG_DCTL_TCTL_2          EQU (0x00000040)            ;Bit 2
USB_OTG_DCTL_SGINAK          EQU (0x00000080)            ; Set global IN NAK
USB_OTG_DCTL_CGINAK          EQU (0x00000100)            ; Clear global IN NAK
USB_OTG_DCTL_SGONAK          EQU (0x00000200)            ; Set global OUT NAK
USB_OTG_DCTL_CGONAK          EQU (0x00000400)            ; Clear global OUT NAK
USB_OTG_DCTL_POPRGDNE        EQU (0x00000800)            ; Power-on programming done

; ********************  Bit definition for USB_OTG_HFIR register  *******************
USB_OTG_HFIR_FRIVL           EQU (0x0000FFFF)            ; Frame interval

; ********************  Bit definition for USB_OTG_HFNUM register  *******************
USB_OTG_HFNUM_FRNUM           EQU (0x0000FFFF)           ; Frame number
USB_OTG_HFNUM_FTREM           EQU (0xFFFF0000)           ; Frame time remaining

; ********************  Bit definition for USB_OTG_DSTS register  *******************
USB_OTG_DSTS_SUSPSTS         EQU (0x00000001)            ; Suspend status

USB_OTG_DSTS_ENUMSPD         EQU (0x00000006)            ; Enumerated speed
USB_OTG_DSTS_ENUMSPD_0       EQU (0x00000002)            ;Bit 0
USB_OTG_DSTS_ENUMSPD_1       EQU (0x00000004)            ;Bit 1
USB_OTG_DSTS_EERR            EQU (0x00000008)            ; Erratic error
USB_OTG_DSTS_FNSOF           EQU (0x003FFF00)            ; Frame number of the received SOF

; ********************  Bit definition for USB_OTG_GAHBCFG register  *******************
USB_OTG_GAHBCFG_GINT            EQU (0x00000001)         ; Global interrupt mask
USB_OTG_GAHBCFG_HBSTLEN         EQU (0x0000001E)         ; Burst length/type
USB_OTG_GAHBCFG_HBSTLEN_0       EQU (0x00000002)         ;Bit 0
USB_OTG_GAHBCFG_HBSTLEN_1       EQU (0x00000004)         ;Bit 1
USB_OTG_GAHBCFG_HBSTLEN_2       EQU (0x00000008)         ;Bit 2
USB_OTG_GAHBCFG_HBSTLEN_3       EQU (0x00000010)         ;Bit 3
USB_OTG_GAHBCFG_DMAEN           EQU (0x00000020)         ; DMA enable
USB_OTG_GAHBCFG_TXFELVL         EQU (0x00000080)         ; TxFIFO empty level
USB_OTG_GAHBCFG_PTXFELVL        EQU (0x00000100)         ; Periodic TxFIFO empty level

; ********************  Bit definition for USB_OTG_GUSBCFG register  *******************

USB_OTG_GUSBCFG_TOCAL           EQU (0x00000007)         ; FS timeout calibration
USB_OTG_GUSBCFG_TOCAL_0         EQU (0x00000001)         ;Bit 0
USB_OTG_GUSBCFG_TOCAL_1         EQU (0x00000002)         ;Bit 1
USB_OTG_GUSBCFG_TOCAL_2         EQU (0x00000004)         ;Bit 2
USB_OTG_GUSBCFG_PHYSEL          EQU (0x00000040)         ; USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select
USB_OTG_GUSBCFG_SRPCAP          EQU (0x00000100)         ; SRP-capable
USB_OTG_GUSBCFG_HNPCAP          EQU (0x00000200)         ; HNP-capable
USB_OTG_GUSBCFG_TRDT            EQU (0x00003C00)         ; USB turnaround time
USB_OTG_GUSBCFG_TRDT_0          EQU (0x00000400)         ;Bit 0
USB_OTG_GUSBCFG_TRDT_1          EQU (0x00000800)         ;Bit 1
USB_OTG_GUSBCFG_TRDT_2          EQU (0x00001000)         ;Bit 2
USB_OTG_GUSBCFG_TRDT_3          EQU (0x00002000)         ;Bit 3
USB_OTG_GUSBCFG_PHYLPCS         EQU (0x00008000)         ; PHY Low-power clock select
USB_OTG_GUSBCFG_ULPIFSLS        EQU (0x00020000)         ; ULPI FS/LS select
USB_OTG_GUSBCFG_ULPIAR          EQU (0x00040000)         ; ULPI Auto-resume
USB_OTG_GUSBCFG_ULPICSM         EQU (0x00080000)         ; ULPI Clock SuspendM
USB_OTG_GUSBCFG_ULPIEVBUSD      EQU (0x00100000)         ; ULPI External VBUS Drive
USB_OTG_GUSBCFG_ULPIEVBUSI      EQU (0x00200000)         ; ULPI external VBUS indicator
USB_OTG_GUSBCFG_TSDPS           EQU (0x00400000)         ; TermSel DLine pulsing selection
USB_OTG_GUSBCFG_PCCI            EQU (0x00800000)         ; Indicator complement
USB_OTG_GUSBCFG_PTCI            EQU (0x01000000)         ; Indicator pass through
USB_OTG_GUSBCFG_ULPIIPD         EQU (0x02000000)         ; ULPI interface protect disable
USB_OTG_GUSBCFG_FHMOD           EQU (0x20000000)         ; Forced host mode
USB_OTG_GUSBCFG_FDMOD           EQU (0x40000000)         ; Forced peripheral mode
USB_OTG_GUSBCFG_CTXPKT          EQU (0x80000000)         ; Corrupt Tx packet

