Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bit definition for USB_OTG_GRSTCTL register  *******************
USB_OTG_GRSTCTL_CSRST           EQU (0x00000001)         ; Core soft reset
USB_OTG_GRSTCTL_HSRST           EQU (0x00000002)         ; HCLK soft reset
USB_OTG_GRSTCTL_FCRST           EQU (0x00000004)         ; Host frame counter reset
USB_OTG_GRSTCTL_RXFFLSH         EQU (0x00000010)         ; RxFIFO flush
USB_OTG_GRSTCTL_TXFFLSH         EQU (0x00000020)         ; TxFIFO flush
USB_OTG_GRSTCTL_TXFNUM          EQU (0x000007C0)         ; TxFIFO number
USB_OTG_GRSTCTL_TXFNUM_0        EQU (0x00000040)         ;Bit 0
USB_OTG_GRSTCTL_TXFNUM_1        EQU (0x00000080)         ;Bit 1
USB_OTG_GRSTCTL_TXFNUM_2        EQU (0x00000100)         ;Bit 2
USB_OTG_GRSTCTL_TXFNUM_3        EQU (0x00000200)         ;Bit 3
USB_OTG_GRSTCTL_TXFNUM_4        EQU (0x00000400)         ;Bit 4
USB_OTG_GRSTCTL_DMAREQ          EQU (0x40000000)         ; DMA request signal
USB_OTG_GRSTCTL_AHBIDL          EQU (0x80000000)         ; AHB master idle

; ********************  Bit definition for USB_OTG_DIEPMSK register  *******************
USB_OTG_DIEPMSK_XFRCM           EQU (0x00000001)         ; Transfer completed interrupt mask
USB_OTG_DIEPMSK_EPDM            EQU (0x00000002)         ; Endpoint disabled interrupt mask
USB_OTG_DIEPMSK_TOM             EQU (0x00000008)         ; Timeout condition mask (nonisochronous endpoints)
USB_OTG_DIEPMSK_ITTXFEMSK       EQU (0x00000010)         ; IN token received when TxFIFO empty mask
USB_OTG_DIEPMSK_INEPNMM         EQU (0x00000020)         ; IN token received with EP mismatch mask
USB_OTG_DIEPMSK_INEPNEM         EQU (0x00000040)         ; IN endpoint NAK effective mask
USB_OTG_DIEPMSK_TXFURM          EQU (0x00000100)         ; FIFO underrun mask
USB_OTG_DIEPMSK_BIM             EQU (0x00000200)         ; BNA interrupt mask

; ********************  Bit definition for USB_OTG_HPTXSTS register  *******************
USB_OTG_HPTXSTS_PTXFSAVL        EQU (0x0000FFFF)         ; Periodic transmit data FIFO space available
USB_OTG_HPTXSTS_PTXQSAV         EQU (0x00FF0000)         ; Periodic transmit request queue space available
USB_OTG_HPTXSTS_PTXQSAV_0       EQU (0x00010000)         ;Bit 0
USB_OTG_HPTXSTS_PTXQSAV_1       EQU (0x00020000)         ;Bit 1
USB_OTG_HPTXSTS_PTXQSAV_2       EQU (0x00040000)         ;Bit 2
USB_OTG_HPTXSTS_PTXQSAV_3       EQU (0x00080000)         ;Bit 3
USB_OTG_HPTXSTS_PTXQSAV_4       EQU (0x00100000)         ;Bit 4
USB_OTG_HPTXSTS_PTXQSAV_5       EQU (0x00200000)         ;Bit 5
USB_OTG_HPTXSTS_PTXQSAV_6       EQU (0x00400000)         ;Bit 6
USB_OTG_HPTXSTS_PTXQSAV_7       EQU (0x00800000)         ;Bit 7

USB_OTG_HPTXSTS_PTXQTOP         EQU (0xFF000000)         ; Top of the periodic transmit request queue
USB_OTG_HPTXSTS_PTXQTOP_0       EQU (0x01000000)         ;Bit 0
USB_OTG_HPTXSTS_PTXQTOP_1       EQU (0x02000000)         ;Bit 1
USB_OTG_HPTXSTS_PTXQTOP_2       EQU (0x04000000)         ;Bit 2
USB_OTG_HPTXSTS_PTXQTOP_3       EQU (0x08000000)         ;Bit 3
USB_OTG_HPTXSTS_PTXQTOP_4       EQU (0x10000000)         ;Bit 4
USB_OTG_HPTXSTS_PTXQTOP_5       EQU (0x20000000)         ;Bit 5
USB_OTG_HPTXSTS_PTXQTOP_6       EQU (0x40000000)         ;Bit 6
USB_OTG_HPTXSTS_PTXQTOP_7       EQU (0x80000000)         ;Bit 7

; ********************  Bit definition for USB_OTG_HAINT register  *******************
USB_OTG_HAINT_HAINT           EQU (0x0000FFFF)           ; Channel interrupts

; ********************  Bit definition for USB_OTG_DOEPMSK register  *******************
USB_OTG_DOEPMSK_XFRCM           EQU (0x00000001)         ; Transfer completed interrupt mask
USB_OTG_DOEPMSK_EPDM            EQU (0x00000002)         ; Endpoint disabled interrupt mask
USB_OTG_DOEPMSK_STUPM           EQU (0x00000008)         ; SETUP phase done mask
USB_OTG_DOEPMSK_OTEPDM          EQU (0x00000010)         ; OUT token received when endpoint disabled mask
USB_OTG_DOEPMSK_B2BSTUP         EQU (0x00000040)         ; Back-to-back SETUP packets received mask
USB_OTG_DOEPMSK_OPEM            EQU (0x00000100)         ; OUT packet error mask
USB_OTG_DOEPMSK_BOIM            EQU (0x00000200)         ; BNA interrupt mask

; ********************  Bit definition for USB_OTG_GINTSTS register  *******************
USB_OTG_GINTSTS_CMOD            EQU (0x00000001)         ; Current mode of operation
USB_OTG_GINTSTS_MMIS            EQU (0x00000002)         ; Mode mismatch interrupt
USB_OTG_GINTSTS_OTGINT          EQU (0x00000004)         ; OTG interrupt
USB_OTG_GINTSTS_SOF             EQU (0x00000008)         ; Start of frame
USB_OTG_GINTSTS_RXFLVL          EQU (0x00000010)         ; RxFIFO nonempty
USB_OTG_GINTSTS_NPTXFE          EQU (0x00000020)         ; Nonperiodic TxFIFO empty
USB_OTG_GINTSTS_GINAKEFF        EQU (0x00000040)         ; Global IN nonperiodic NAK effective
USB_OTG_GINTSTS_BOUTNAKEFF      EQU (0x00000080)         ; Global OUT NAK effective
USB_OTG_GINTSTS_ESUSP           EQU (0x00000400)         ; Early suspend
USB_OTG_GINTSTS_USBSUSP         EQU (0x00000800)         ; USB suspend
USB_OTG_GINTSTS_USBRST          EQU (0x00001000)         ; USB reset
USB_OTG_GINTSTS_ENUMDNE         EQU (0x00002000)         ; Enumeration done
USB_OTG_GINTSTS_ISOODRP         EQU (0x00004000)         ; Isochronous OUT packet dropped interrupt
USB_OTG_GINTSTS_EOPF            EQU (0x00008000)         ; End of periodic frame interrupt
USB_OTG_GINTSTS_IEPINT          EQU (0x00040000)         ; IN endpoint interrupt
USB_OTG_GINTSTS_OEPINT          EQU (0x00080000)         ; OUT endpoint interrupt
USB_OTG_GINTSTS_IISOIXFR        EQU (0x00100000)         ; Incomplete isochronous IN transfer
USB_OTG_GINTSTS_PXFR_INCOMPISOOUT       EQU (0x00200000)         ; Incomplete periodic transfer
USB_OTG_GINTSTS_DATAFSUSP       EQU (0x00400000)         ; Data fetch suspended
USB_OTG_GINTSTS_HPRTINT         EQU (0x01000000)         ; Host port interrupt
USB_OTG_GINTSTS_HCINT           EQU (0x02000000)         ; Host channels interrupt
USB_OTG_GINTSTS_PTXFE           EQU (0x04000000)         ; Periodic TxFIFO empty
USB_OTG_GINTSTS_LPMINT           EQU (0x08000000)        ; LPM interrupt
USB_OTG_GINTSTS_CIDSCHG         EQU (0x10000000)         ; Connector ID status change
USB_OTG_GINTSTS_DISCINT         EQU (0x20000000)         ; Disconnect detected interrupt
USB_OTG_GINTSTS_SRQINT          EQU (0x40000000)         ; Session request/new session detected interrupt
USB_OTG_GINTSTS_WKUINT          EQU (0x80000000)         ; Resume/remote wakeup detected interrupt

; ********************  Bit definition for USB_OTG_GINTMSK register  *******************

