Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
USB_OTG_GINTMSK_MMISM           EQU (0x00000002)         ; Mode mismatch interrupt mask
USB_OTG_GINTMSK_OTGINT          EQU (0x00000004)         ; OTG interrupt mask
USB_OTG_GINTMSK_SOFM            EQU (0x00000008)         ; Start of frame mask
USB_OTG_GINTMSK_RXFLVLM         EQU (0x00000010)         ; Receive FIFO nonempty mask
USB_OTG_GINTMSK_NPTXFEM         EQU (0x00000020)         ; Nonperiodic TxFIFO empty mask
USB_OTG_GINTMSK_GINAKEFFM       EQU (0x00000040)         ; Global nonperiodic IN NAK effective mask
USB_OTG_GINTMSK_GONAKEFFM       EQU (0x00000080)         ; Global OUT NAK effective mask
USB_OTG_GINTMSK_ESUSPM          EQU (0x00000400)         ; Early suspend mask
USB_OTG_GINTMSK_USBSUSPM        EQU (0x00000800)         ; USB suspend mask
USB_OTG_GINTMSK_USBRST          EQU (0x00001000)         ; USB reset mask
USB_OTG_GINTMSK_ENUMDNEM        EQU (0x00002000)         ; Enumeration done mask
USB_OTG_GINTMSK_ISOODRPM        EQU (0x00004000)         ; Isochronous OUT packet dropped interrupt mask
USB_OTG_GINTMSK_EOPFM           EQU (0x00008000)         ; End of periodic frame interrupt mask
USB_OTG_GINTMSK_EPMISM          EQU (0x00020000)         ; Endpoint mismatch interrupt mask
USB_OTG_GINTMSK_IEPINT          EQU (0x00040000)         ; IN endpoints interrupt mask
USB_OTG_GINTMSK_OEPINT          EQU (0x00080000)         ; OUT endpoints interrupt mask
USB_OTG_GINTMSK_IISOIXFRM       EQU (0x00100000)         ; Incomplete isochronous IN transfer mask
USB_OTG_GINTMSK_PXFRM_IISOOXFRM EQU (0x00200000)         ; Incomplete periodic transfer mask
USB_OTG_GINTMSK_FSUSPM          EQU (0x00400000)         ; Data fetch suspended mask
USB_OTG_GINTMSK_PRTIM           EQU (0x01000000)         ; Host port interrupt mask
USB_OTG_GINTMSK_HCIM            EQU (0x02000000)         ; Host channels interrupt mask
USB_OTG_GINTMSK_PTXFEM          EQU (0x04000000)         ; Periodic TxFIFO empty mask
USB_OTG_GINTMSK_LPMINTM         EQU (0x08000000)         ; LPM interrupt Mask
USB_OTG_GINTMSK_CIDSCHGM        EQU (0x10000000)         ; Connector ID status change mask
USB_OTG_GINTMSK_DISCINT         EQU (0x20000000)         ; Disconnect detected interrupt mask
USB_OTG_GINTMSK_SRQIM           EQU (0x40000000)         ; Session request/new session detected interrupt mask
USB_OTG_GINTMSK_WUIM            EQU (0x80000000)         ; Resume/remote wakeup detected interrupt mask

; ********************  Bit definition for USB_OTG_DAINT register  *******************
USB_OTG_DAINT_IEPINT          EQU (0x0000FFFF)            ; IN endpoint interrupt bits
USB_OTG_DAINT_OEPINT          EQU (0xFFFF0000)            ; OUT endpoint interrupt bits

; ********************  Bit definition for USB_OTG_HAINTMSK register  *******************
USB_OTG_HAINTMSK_HAINTM          EQU (0x0000FFFF)        ; Channel interrupt mask

; ********************  Bit definition for USB_OTG_GRXSTSP register  *******************
USB_OTG_GRXSTSP_EPNUM            EQU (0x0000000F)        ; IN EP interrupt mask bits
USB_OTG_GRXSTSP_BCNT             EQU (0x00007FF0)        ; OUT EP interrupt mask bits
USB_OTG_GRXSTSP_DPID             EQU (0x00018000)        ; OUT EP interrupt mask bits
USB_OTG_GRXSTSP_PKTSTS           EQU (0x001E0000)        ; OUT EP interrupt mask bits

; ********************  Bit definition for USB_OTG_DAINTMSK register  *******************
USB_OTG_DAINTMSK_IEPM            EQU (0x0000FFFF)        ; IN EP interrupt mask bits
USB_OTG_DAINTMSK_OEPM            EQU (0xFFFF0000)        ; OUT EP interrupt mask bits

; ********************  Bit definition for OTG register  *******************

USB_OTG_CHNUM           EQU (0x0000000F)                 ; Channel number
USB_OTG_CHNUM_0         EQU (0x00000001)                 ;Bit 0
USB_OTG_CHNUM_1         EQU (0x00000002)                 ;Bit 1
USB_OTG_CHNUM_2         EQU (0x00000004)                 ;Bit 2
USB_OTG_CHNUM_3         EQU (0x00000008)                 ;Bit 3
USB_OTG_BCNT            EQU (0x00007FF0)                 ; Byte count
USB_OTG_DPID            EQU (0x00018000)                 ; Data PID
USB_OTG_DPID_0          EQU (0x00008000)                 ;Bit 0
USB_OTG_DPID_1          EQU (0x00010000)                 ;Bit 1
USB_OTG_PKTSTS          EQU (0x001E0000)                 ; Packet status
USB_OTG_PKTSTS_0        EQU (0x00020000)                 ;Bit 0
USB_OTG_PKTSTS_1        EQU (0x00040000)                 ;Bit 1
USB_OTG_PKTSTS_2        EQU (0x00080000)                 ;Bit 2
USB_OTG_PKTSTS_3        EQU (0x00100000)                 ;Bit 3
USB_OTG_EPNUM           EQU (0x0000000F)                 ; Endpoint number
USB_OTG_EPNUM_0         EQU (0x00000001)                 ;Bit 0
USB_OTG_EPNUM_1         EQU (0x00000002)                 ;Bit 1
USB_OTG_EPNUM_2         EQU (0x00000004)                 ;Bit 2
USB_OTG_EPNUM_3         EQU (0x00000008)                 ;Bit 3
USB_OTG_FRMNUM          EQU (0x01E00000)                 ; Frame number
USB_OTG_FRMNUM_0        EQU (0x00200000)                 ;Bit 0
USB_OTG_FRMNUM_1        EQU (0x00400000)                 ;Bit 1
USB_OTG_FRMNUM_2        EQU (0x00800000)                 ;Bit 2
USB_OTG_FRMNUM_3        EQU (0x01000000)                 ;Bit 3

; ********************  Bit definition for USB_OTG_GRXFSIZ register  *******************
USB_OTG_GRXFSIZ_RXFD    EQU (0x0000FFFF)         ; RxFIFO depth

; ********************  Bit definition for USB_OTG_DVBUSDIS register  *******************
USB_OTG_DVBUSDIS_VBUSDT EQU (0x0000FFFF)        ; Device VBUS discharge time

; ********************  Bit definition for OTG register  *******************
USB_OTG_NPTXFSA         EQU (0x0000FFFF)                 ; Nonperiodic transmit RAM start address
USB_OTG_NPTXFD          EQU (0xFFFF0000)                 ; Nonperiodic TxFIFO depth
USB_OTG_TX0FSA          EQU (0x0000FFFF)                 ; Endpoint 0 transmit RAM start address
USB_OTG_TX0FD           EQU (0xFFFF0000)                 ; Endpoint 0 TxFIFO depth

; ********************  Bit definition for USB_OTG_DVBUSPULSE register  *******************
USB_OTG_DVBUSPULSE_DVBUSP       EQU (0x00000FFF)      ; Device VBUS pulsing time

; ********************  Bit definition for USB_OTG_GNPTXSTS register  *******************
USB_OTG_GNPTXSTS_NPTXFSAV       EQU (0x0000FFFF)        ; Nonperiodic TxFIFO space available

