Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
USB_OTG_GNPTXSTS_NPTQXSAV        EQU (0x00FF0000)        ; Nonperiodic transmit request queue space available
USB_OTG_GNPTXSTS_NPTQXSAV_0      EQU (0x00010000)        ;Bit 0
USB_OTG_GNPTXSTS_NPTQXSAV_1      EQU (0x00020000)        ;Bit 1
USB_OTG_GNPTXSTS_NPTQXSAV_2      EQU (0x00040000)        ;Bit 2
USB_OTG_GNPTXSTS_NPTQXSAV_3      EQU (0x00080000)        ;Bit 3
USB_OTG_GNPTXSTS_NPTQXSAV_4      EQU (0x00100000)        ;Bit 4
USB_OTG_GNPTXSTS_NPTQXSAV_5      EQU (0x00200000)        ;Bit 5
USB_OTG_GNPTXSTS_NPTQXSAV_6      EQU (0x00400000)        ;Bit 6
USB_OTG_GNPTXSTS_NPTQXSAV_7      EQU (0x00800000)        ;Bit 7

USB_OTG_GNPTXSTS_NPTXQTOP        EQU (0x7F000000)        ; Top of the nonperiodic transmit request queue
USB_OTG_GNPTXSTS_NPTXQTOP_0      EQU (0x01000000)        ;Bit 0
USB_OTG_GNPTXSTS_NPTXQTOP_1      EQU (0x02000000)        ;Bit 1
USB_OTG_GNPTXSTS_NPTXQTOP_2      EQU (0x04000000)        ;Bit 2
USB_OTG_GNPTXSTS_NPTXQTOP_3      EQU (0x08000000)        ;Bit 3
USB_OTG_GNPTXSTS_NPTXQTOP_4      EQU (0x10000000)        ;Bit 4
USB_OTG_GNPTXSTS_NPTXQTOP_5      EQU (0x20000000)        ;Bit 5
USB_OTG_GNPTXSTS_NPTXQTOP_6      EQU (0x40000000)        ;Bit 6

; ********************  Bit definition for USB_OTG_DTHRCTL register  **************
USB_OTG_DTHRCTL_NONISOTHREN     EQU (0x00000001)         ; Nonisochronous IN endpoints threshold enable
USB_OTG_DTHRCTL_ISOTHREN        EQU (0x00000002)         ; ISO IN endpoint threshold enable

USB_OTG_DTHRCTL_TXTHRLEN        EQU (0x000007FC)         ; Transmit threshold length
USB_OTG_DTHRCTL_TXTHRLEN_0      EQU (0x00000004)         ;Bit 0
USB_OTG_DTHRCTL_TXTHRLEN_1      EQU (0x00000008)         ;Bit 1
USB_OTG_DTHRCTL_TXTHRLEN_2      EQU (0x00000010)         ;Bit 2
USB_OTG_DTHRCTL_TXTHRLEN_3      EQU (0x00000020)         ;Bit 3
USB_OTG_DTHRCTL_TXTHRLEN_4      EQU (0x00000040)         ;Bit 4
USB_OTG_DTHRCTL_TXTHRLEN_5      EQU (0x00000080)         ;Bit 5
USB_OTG_DTHRCTL_TXTHRLEN_6      EQU (0x00000100)         ;Bit 6
USB_OTG_DTHRCTL_TXTHRLEN_7      EQU (0x00000200)         ;Bit 7
USB_OTG_DTHRCTL_TXTHRLEN_8      EQU (0x00000400)         ;Bit 8
USB_OTG_DTHRCTL_RXTHREN EQU (0x00010000)         ; Receive threshold enable

USB_OTG_DTHRCTL_RXTHRLEN        EQU (0x03FE0000)         ; Receive threshold length
USB_OTG_DTHRCTL_RXTHRLEN_0      EQU (0x00020000)         ;Bit 0
USB_OTG_DTHRCTL_RXTHRLEN_1      EQU (0x00040000)         ;Bit 1
USB_OTG_DTHRCTL_RXTHRLEN_2      EQU (0x00080000)         ;Bit 2
USB_OTG_DTHRCTL_RXTHRLEN_3      EQU (0x00100000)         ;Bit 3
USB_OTG_DTHRCTL_RXTHRLEN_4      EQU (0x00200000)         ;Bit 4
USB_OTG_DTHRCTL_RXTHRLEN_5      EQU (0x00400000)         ;Bit 5
USB_OTG_DTHRCTL_RXTHRLEN_6      EQU (0x00800000)         ;Bit 6
USB_OTG_DTHRCTL_RXTHRLEN_7      EQU (0x01000000)         ;Bit 7
USB_OTG_DTHRCTL_RXTHRLEN_8      EQU (0x02000000)         ;Bit 8
USB_OTG_DTHRCTL_ARPEN   EQU (0x08000000)         ; Arbiter parking enable

; ********************  Bit definition for USB_OTG_DIEPEMPMSK register  **************
USB_OTG_DIEPEMPMSK_INEPTXFEM    EQU (0x0000FFFF)      ; IN EP Tx FIFO empty interrupt mask bits

; ********************  Bit definition for USB_OTG_DEACHINT register  *******************
USB_OTG_DEACHINT_IEP1INT        EQU (0x00000002)        ; IN endpoint 1interrupt bit
USB_OTG_DEACHINT_OEP1INT        EQU (0x00020000)        ; OUT endpoint 1 interrupt bit

; ********************  Bit definition for USB_OTG_GCCFG register  *******************
USB_OTG_GCCFG_DCDET  EQU (0x00000001)            ; Data contact detection (DCD) status
USB_OTG_GCCFG_PDET   EQU (0x00000002)            ; Primary detection (PD) status
USB_OTG_GCCFG_SDET   EQU (0x00000004)            ; Secondary detection (SD) status
USB_OTG_GCCFG_PS2DET EQU (0x00000008)            ; DM pull-up detection status
USB_OTG_GCCFG_PWRDWN EQU (0x00010000)            ; Power down
USB_OTG_GCCFG_BCDEN  EQU (0x00020000)            ; Battery charging detector (BCD) enable
USB_OTG_GCCFG_DCDEN  EQU (0x00040000)            ; Data contact detection (DCD) mode enable
USB_OTG_GCCFG_PDEN   EQU (0x00080000)            ; Primary detection (PD) mode enable
USB_OTG_GCCFG_SDEN   EQU (0x00100000)            ; Secondary detection (SD) mode enable
USB_OTG_GCCFG_VBDEN  EQU (0x00200000)            ; Secondary detection (SD) mode enable

; ********************  Bit definition for USB_OTG_GPWRDN) register  *******************
USB_OTG_GPWRDN_DISABLEVBUS   EQU (0x00000040)      ; Power down

; ********************  Bit definition for USB_OTG_DEACHINTMSK register  *******************
USB_OTG_DEACHINTMSK_IEP1INTM EQU (0x00000002)     ; IN Endpoint 1 interrupt mask bit
USB_OTG_DEACHINTMSK_OEP1INTM EQU (0x00020000)     ; OUT Endpoint 1 interrupt mask bit

; ********************  Bit definition for USB_OTG_CID register  *******************
USB_OTG_CID_PRODUCT_ID      EQU (0xFFFFFFFF)             ; Product ID field


; ********************  Bit definition for USB_OTG_GHWCFG3 register  *******************
USB_OTG_GHWCFG3_LPMMode     EQU (0x00004000)           ; LPM mode specified for Mode of Operation

; ********************  Bit definition for USB_OTG_GLPMCFG register  *******************
USB_OTG_GLPMCFG_ENBESL      EQU (0x10000000)    ; Enable best effort service latency
USB_OTG_GLPMCFG_LPMRCNTSTS  EQU (0x0E000000)    ; LPM retry count status
USB_OTG_GLPMCFG_SNDLPM      EQU (0x01000000)    ; Send LPM transaction
USB_OTG_GLPMCFG_LPMRCNT     EQU (0x00E00000)    ; LPM retry count
USB_OTG_GLPMCFG_LPMCHIDX    EQU (0x001E0000)    ; LPMCHIDX:
USB_OTG_GLPMCFG_L1ResumeOK  EQU (0x00010000)    ; Sleep State Resume OK
USB_OTG_GLPMCFG_SLPSTS      EQU (0x00008000)    ; Port sleep status
USB_OTG_GLPMCFG_LPMRSP      EQU (0x00006000)    ; LPM response
USB_OTG_GLPMCFG_L1DSEN      EQU (0x00001000)    ; L1 deep sleep enable
USB_OTG_GLPMCFG_BESLTHRS    EQU (0x00000F00)    ; BESL threshold
USB_OTG_GLPMCFG_L1SSEN      EQU (0x00000080)    ; L1 shallow sleep enable
USB_OTG_GLPMCFG_REMWAKE     EQU (0x00000040)    ; bRemoteWake value received with last ACKed LPM Token
USB_OTG_GLPMCFG_BESL        EQU (0x0000003C)    ; BESL value received with last ACKed LPM Token
USB_OTG_GLPMCFG_LPMACK      EQU (0x00000002)    ; LPM Token acknowledge enable
USB_OTG_GLPMCFG_LPMEN       EQU (0x00000001)    ; LPM support enable


; ********************  Bit definition for USB_OTG_DIEPEACHMSK1 register  *******************
USB_OTG_DIEPEACHMSK1_XFRCM   EQU (0x00000001)    ; Transfer completed interrupt mask
USB_OTG_DIEPEACHMSK1_EPDM    EQU (0x00000002)    ; Endpoint disabled interrupt mask
USB_OTG_DIEPEACHMSK1_TOM     EQU (0x00000008)    ; Timeout condition mask (nonisochronous endpoints)
USB_OTG_DIEPEACHMSK1_ITTXFEMSK       EQU (0x00000010)    ; IN token received when TxFIFO empty mask
USB_OTG_DIEPEACHMSK1_INEPNMM EQU (0x00000020)    ; IN token received with EP mismatch mask
USB_OTG_DIEPEACHMSK1_INEPNEM EQU (0x00000040)    ; IN endpoint NAK effective mask
USB_OTG_DIEPEACHMSK1_TXFURM  EQU (0x00000100)    ; FIFO underrun mask
USB_OTG_DIEPEACHMSK1_BIM     EQU (0x00000200)    ; BNA interrupt mask
USB_OTG_DIEPEACHMSK1_NAKM    EQU (0x00002000)    ; NAK interrupt mask

