Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
; ********************  Bit definition for USB_OTG_HPRT register  *******************
USB_OTG_HPRT_PCSTS   EQU (0x00000001)            ; Port connect status
USB_OTG_HPRT_PCDET   EQU (0x00000002)            ; Port connect detected
USB_OTG_HPRT_PENA    EQU (0x00000004)            ; Port enable
USB_OTG_HPRT_PENCHNG EQU (0x00000008)            ; Port enable/disable change
USB_OTG_HPRT_POCA    EQU (0x00000010)            ; Port overcurrent active
USB_OTG_HPRT_POCCHNG EQU (0x00000020)            ; Port overcurrent change
USB_OTG_HPRT_PRES    EQU (0x00000040)            ; Port resume
USB_OTG_HPRT_PSUSP   EQU (0x00000080)            ; Port suspend
USB_OTG_HPRT_PRST    EQU (0x00000100)            ; Port reset

USB_OTG_HPRT_PLSTS   EQU (0x00000C00)            ; Port line status
USB_OTG_HPRT_PLSTS_0 EQU (0x00000400)            ;Bit 0
USB_OTG_HPRT_PLSTS_1 EQU (0x00000800)            ;Bit 1
USB_OTG_HPRT_PPWR    EQU (0x00001000)            ; Port power

USB_OTG_HPRT_PTCTL   EQU (0x0001E000)            ; Port test control
USB_OTG_HPRT_PTCTL_0 EQU (0x00002000)            ;Bit 0
USB_OTG_HPRT_PTCTL_1 EQU (0x00004000)            ;Bit 1
USB_OTG_HPRT_PTCTL_2 EQU (0x00008000)            ;Bit 2
USB_OTG_HPRT_PTCTL_3 EQU (0x00010000)            ;Bit 3

USB_OTG_HPRT_PSPD    EQU (0x00060000)            ; Port speed
USB_OTG_HPRT_PSPD_0  EQU (0x00020000)            ;Bit 0
USB_OTG_HPRT_PSPD_1  EQU (0x00040000)            ;Bit 1

; ********************  Bit definition for USB_OTG_DOEPEACHMSK1 register  *******************
USB_OTG_DOEPEACHMSK1_XFRCM   EQU (0x00000001)    ; Transfer completed interrupt mask
USB_OTG_DOEPEACHMSK1_EPDM    EQU (0x00000002)    ; Endpoint disabled interrupt mask
USB_OTG_DOEPEACHMSK1_TOM     EQU (0x00000008)    ; Timeout condition mask
USB_OTG_DOEPEACHMSK1_ITTXFEMSK       EQU (0x00000010)    ; IN token received when TxFIFO empty mask
USB_OTG_DOEPEACHMSK1_INEPNMM EQU (0x00000020)    ; IN token received with EP mismatch mask
USB_OTG_DOEPEACHMSK1_INEPNEM EQU (0x00000040)    ; IN endpoint NAK effective mask
USB_OTG_DOEPEACHMSK1_TXFURM  EQU (0x00000100)    ; OUT packet error mask
USB_OTG_DOEPEACHMSK1_BIM     EQU (0x00000200)    ; BNA interrupt mask
USB_OTG_DOEPEACHMSK1_BERRM   EQU (0x00001000)    ; Bubble error interrupt mask
USB_OTG_DOEPEACHMSK1_NAKM    EQU (0x00002000)    ; NAK interrupt mask
USB_OTG_DOEPEACHMSK1_NYETM   EQU (0x00004000)    ; NYET interrupt mask

; ********************  Bit definition for USB_OTG_HPTXFSIZ register  *******************
USB_OTG_HPTXFSIZ_PTXSA       EQU (0x0000FFFF)        ; Host periodic TxFIFO start address
USB_OTG_HPTXFSIZ_PTXFD       EQU (0xFFFF0000)        ; Host periodic TxFIFO depth

; ********************  Bit definition for USB_OTG_DIEPCTL register  *******************
USB_OTG_DIEPCTL_MPSIZ        EQU (0x000007FF)         ; Maximum packet size
USB_OTG_DIEPCTL_USBAEP       EQU (0x00008000)         ; USB active endpoint
USB_OTG_DIEPCTL_EONUM_DPID   EQU (0x00010000)         ; Even/odd frame
USB_OTG_DIEPCTL_NAKSTS       EQU (0x00020000)         ; NAK status

USB_OTG_DIEPCTL_EPTYP        EQU (0x000C0000)         ; Endpoint type
USB_OTG_DIEPCTL_EPTYP_0      EQU (0x00040000)         ;Bit 0
USB_OTG_DIEPCTL_EPTYP_1      EQU (0x00080000)         ;Bit 1
USB_OTG_DIEPCTL_STALL        EQU (0x00200000)         ; STALL handshake

USB_OTG_DIEPCTL_TXFNUM       EQU (0x03C00000)         ; TxFIFO number
USB_OTG_DIEPCTL_TXFNUM_0     EQU (0x00400000)         ;Bit 0
USB_OTG_DIEPCTL_TXFNUM_1     EQU (0x00800000)         ;Bit 1
USB_OTG_DIEPCTL_TXFNUM_2     EQU (0x01000000)         ;Bit 2
USB_OTG_DIEPCTL_TXFNUM_3     EQU (0x02000000)         ;Bit 3
USB_OTG_DIEPCTL_CNAK EQU (0x04000000)         ; Clear NAK
USB_OTG_DIEPCTL_SNAK EQU (0x08000000)         ; Set NAK
USB_OTG_DIEPCTL_SD0PID_SEVNFRM       EQU (0x10000000)         ; Set DATA0 PID
USB_OTG_DIEPCTL_SODDFRM      EQU (0x20000000)         ; Set odd frame
USB_OTG_DIEPCTL_EPDIS        EQU (0x40000000)         ; Endpoint disable
USB_OTG_DIEPCTL_EPENA        EQU (0x80000000)         ; Endpoint enable

; ********************  Bit definition for USB_OTG_HCCHAR register  *******************
USB_OTG_HCCHAR_MPSIZ EQU (0x000007FF)          ; Maximum packet size

USB_OTG_HCCHAR_EPNUM EQU (0x00007800)          ; Endpoint number
USB_OTG_HCCHAR_EPNUM_0       EQU (0x00000800)          ;Bit 0
USB_OTG_HCCHAR_EPNUM_1       EQU (0x00001000)          ;Bit 1
USB_OTG_HCCHAR_EPNUM_2       EQU (0x00002000)          ;Bit 2
USB_OTG_HCCHAR_EPNUM_3       EQU (0x00004000)          ;Bit 3
USB_OTG_HCCHAR_EPDIR EQU (0x00008000)          ; Endpoint direction
USB_OTG_HCCHAR_LSDEV EQU (0x00020000)          ; Low-speed device

USB_OTG_HCCHAR_EPTYP   EQU (0x000C0000)          ; Endpoint type
USB_OTG_HCCHAR_EPTYP_0 EQU (0x00040000)          ;Bit 0
USB_OTG_HCCHAR_EPTYP_1 EQU (0x00080000)          ;Bit 1

USB_OTG_HCCHAR_MC      EQU (0x00300000)          ; Multi Count (MC) / Error Count (EC)
USB_OTG_HCCHAR_MC_0    EQU (0x00100000)          ;Bit 0
USB_OTG_HCCHAR_MC_1    EQU (0x00200000)          ;Bit 1

USB_OTG_HCCHAR_DAD     EQU (0x1FC00000)          ; Device address
USB_OTG_HCCHAR_DAD_0   EQU (0x00400000)          ;Bit 0
USB_OTG_HCCHAR_DAD_1   EQU (0x00800000)          ;Bit 1
USB_OTG_HCCHAR_DAD_2   EQU (0x01000000)          ;Bit 2
USB_OTG_HCCHAR_DAD_3   EQU (0x02000000)          ;Bit 3
USB_OTG_HCCHAR_DAD_4   EQU (0x04000000)          ;Bit 4
USB_OTG_HCCHAR_DAD_5   EQU (0x08000000)          ;Bit 5
USB_OTG_HCCHAR_DAD_6   EQU (0x10000000)          ;Bit 6
USB_OTG_HCCHAR_ODDFRM  EQU (0x20000000)          ; Odd frame
USB_OTG_HCCHAR_CHDIS   EQU (0x40000000)          ; Channel disable
USB_OTG_HCCHAR_CHENA   EQU (0x80000000)          ; Channel enable

; ********************  Bit definition for USB_OTG_HCSPLT register  *******************

USB_OTG_HCSPLT_PRTADDR EQU (0x0000007F)          ; Port address
USB_OTG_HCSPLT_PRTADDR_0       EQU (0x00000001)          ;Bit 0
USB_OTG_HCSPLT_PRTADDR_1       EQU (0x00000002)          ;Bit 1
USB_OTG_HCSPLT_PRTADDR_2       EQU (0x00000004)          ;Bit 2
USB_OTG_HCSPLT_PRTADDR_3       EQU (0x00000008)          ;Bit 3
USB_OTG_HCSPLT_PRTADDR_4       EQU (0x00000010)          ;Bit 4
USB_OTG_HCSPLT_PRTADDR_5       EQU (0x00000020)          ;Bit 5
USB_OTG_HCSPLT_PRTADDR_6       EQU (0x00000040)          ;Bit 6

USB_OTG_HCSPLT_HUBADDR EQU (0x00003F80)          ; Hub address
USB_OTG_HCSPLT_HUBADDR_0       EQU (0x00000080)          ;Bit 0
USB_OTG_HCSPLT_HUBADDR_1       EQU (0x00000100)          ;Bit 1
USB_OTG_HCSPLT_HUBADDR_2       EQU (0x00000200)          ;Bit 2
USB_OTG_HCSPLT_HUBADDR_3       EQU (0x00000400)          ;Bit 3
USB_OTG_HCSPLT_HUBADDR_4       EQU (0x00000800)          ;Bit 4
USB_OTG_HCSPLT_HUBADDR_5       EQU (0x00001000)          ;Bit 5
USB_OTG_HCSPLT_HUBADDR_6       EQU (0x00002000)          ;Bit 6

