Prat2312/General-Purpose-I-O-and-Keypad/STM32L4R5xx_constants.inc
USB_OTG_HCSPLT_XACTPOS EQU (0x0000C000)          ; XACTPOS
USB_OTG_HCSPLT_XACTPOS_0       EQU (0x00004000)          ;Bit 0
USB_OTG_HCSPLT_XACTPOS_1       EQU (0x00008000)          ;Bit 1
USB_OTG_HCSPLT_COMPLSPLT       EQU (0x00010000)          ; Do complete split
USB_OTG_HCSPLT_SPLITEN         EQU (0x80000000)          ; Split enable

; ********************  Bit definition for USB_OTG_HCINT register  *******************
USB_OTG_HCINT_XFRC            EQU (0x00000001)           ; Transfer completed
USB_OTG_HCINT_CHH             EQU (0x00000002)           ; Channel halted
USB_OTG_HCINT_AHBERR          EQU (0x00000004)           ; AHB error
USB_OTG_HCINT_STALL           EQU (0x00000008)           ; STALL response received interrupt
USB_OTG_HCINT_NAK             EQU (0x00000010)           ; NAK response received interrupt
USB_OTG_HCINT_ACK             EQU (0x00000020)           ; ACK response received/transmitted interrupt
USB_OTG_HCINT_NYET            EQU (0x00000040)           ; Response received interrupt
USB_OTG_HCINT_TXERR           EQU (0x00000080)           ; Transaction error
USB_OTG_HCINT_BBERR           EQU (0x00000100)           ; Babble error
USB_OTG_HCINT_FRMOR           EQU (0x00000200)           ; Frame overrun
USB_OTG_HCINT_DTERR           EQU (0x00000400)           ; Data toggle error

; ********************  Bit definition for USB_OTG_DIEPINT register  *******************
USB_OTG_DIEPINT_XFRC            EQU (0x00000001)         ; Transfer completed interrupt
USB_OTG_DIEPINT_EPDISD          EQU (0x00000002)         ; Endpoint disabled interrupt
USB_OTG_DIEPINT_TOC             EQU (0x00000008)         ; Timeout condition
USB_OTG_DIEPINT_ITTXFE          EQU (0x00000010)         ; IN token received when TxFIFO is empty
USB_OTG_DIEPINT_INEPNE          EQU (0x00000040)         ; IN endpoint NAK effective
USB_OTG_DIEPINT_TXFE            EQU (0x00000080)         ; Transmit FIFO empty
USB_OTG_DIEPINT_TXFIFOUDRN      EQU (0x00000100)         ; Transmit Fifo Underrun
USB_OTG_DIEPINT_BNA             EQU (0x00000200)         ; Buffer not available interrupt
USB_OTG_DIEPINT_PKTDRPSTS       EQU (0x00000800)         ; Packet dropped status
USB_OTG_DIEPINT_BERR            EQU (0x00001000)         ; Babble error interrupt
USB_OTG_DIEPINT_NAK             EQU (0x00002000)         ; NAK interrupt

; ********************  Bit definition for USB_OTG_HCINTMSK register  *******************
USB_OTG_HCINTMSK_XFRCM           EQU (0x00000001)        ; Transfer completed mask
USB_OTG_HCINTMSK_CHHM            EQU (0x00000002)        ; Channel halted mask
USB_OTG_HCINTMSK_AHBERR          EQU (0x00000004)        ; AHB error
USB_OTG_HCINTMSK_STALLM          EQU (0x00000008)        ; STALL response received interrupt mask
USB_OTG_HCINTMSK_NAKM            EQU (0x00000010)        ; NAK response received interrupt mask
USB_OTG_HCINTMSK_ACKM            EQU (0x00000020)        ; ACK response received/transmitted interrupt mask
USB_OTG_HCINTMSK_NYET            EQU (0x00000040)        ; response received interrupt mask
USB_OTG_HCINTMSK_TXERRM          EQU (0x00000080)        ; Transaction error mask
USB_OTG_HCINTMSK_BBERRM          EQU (0x00000100)        ; Babble error mask
USB_OTG_HCINTMSK_FRMORM          EQU (0x00000200)        ; Frame overrun mask
USB_OTG_HCINTMSK_DTERRM          EQU (0x00000400)        ; Data toggle error mask

; ********************  Bit definition for USB_OTG_DIEPTSIZ register  *******************

USB_OTG_DIEPTSIZ_XFRSIZ          EQU (0x0007FFFF)        ; Transfer size
USB_OTG_DIEPTSIZ_PKTCNT          EQU (0x1FF80000)        ; Packet count
USB_OTG_DIEPTSIZ_MULCNT          EQU (0x60000000)        ; Packet count
; ********************  Bit definition for USB_OTG_HCTSIZ register  *******************
USB_OTG_HCTSIZ_XFRSIZ            EQU (0x0007FFFF)        ; Transfer size
USB_OTG_HCTSIZ_PKTCNT            EQU (0x1FF80000)        ; Packet count
USB_OTG_HCTSIZ_DOPING            EQU (0x80000000)        ; Do PING
USB_OTG_HCTSIZ_DPID              EQU (0x60000000)        ; Data PID
USB_OTG_HCTSIZ_DPID_0            EQU (0x20000000)        ;Bit 0
USB_OTG_HCTSIZ_DPID_1            EQU (0x40000000)        ;Bit 1

; ********************  Bit definition for USB_OTG_DIEPDMA register  *******************
USB_OTG_DIEPDMA_DMAADDR          EQU (0xFFFFFFFF)        ; DMA address

; ********************  Bit definition for USB_OTG_HCDMA register  *******************
USB_OTG_HCDMA_DMAADDR            EQU (0xFFFFFFFF)        ; DMA address

; ********************  Bit definition for USB_OTG_DTXFSTS register  *******************
USB_OTG_DTXFSTS_INEPTFSAV        EQU (0x0000FFFF)        ; IN endpoint TxFIFO space avail

; ********************  Bit definition for USB_OTG_DIEPTXF register  *******************
USB_OTG_DIEPTXF_INEPTXSA         EQU (0x0000FFFF)        ; IN endpoint FIFOx transmit RAM start address
USB_OTG_DIEPTXF_INEPTXFD         EQU (0xFFFF0000)        ; IN endpoint TxFIFO depth

; ********************  Bit definition for USB_OTG_DOEPCTL register  *******************

USB_OTG_DOEPCTL_MPSIZ          EQU (0x000007FF)       ; Maximum packet size           ;Bit 1
USB_OTG_DOEPCTL_USBAEP         EQU (0x00008000)       ; USB active endpoint
USB_OTG_DOEPCTL_NAKSTS         EQU (0x00020000)       ; NAK status
USB_OTG_DOEPCTL_SD0PID_SEVNFRM EQU (0x10000000)       ; Set DATA0 PID
USB_OTG_DOEPCTL_SODDFRM        EQU (0x20000000)       ; Set odd frame
USB_OTG_DOEPCTL_EPTYP          EQU (0x000C0000)       ; Endpoint type
USB_OTG_DOEPCTL_EPTYP_0        EQU (0x00040000)       ;Bit 0
USB_OTG_DOEPCTL_EPTYP_1        EQU (0x00080000)       ;Bit 1
USB_OTG_DOEPCTL_SNPM           EQU (0x00100000)       ; Snoop mode
USB_OTG_DOEPCTL_STALL          EQU (0x00200000)       ; STALL handshake
USB_OTG_DOEPCTL_CNAK           EQU (0x04000000)       ; Clear NAK
USB_OTG_DOEPCTL_SNAK           EQU (0x08000000)       ; Set NAK
USB_OTG_DOEPCTL_EPDIS          EQU (0x40000000)       ; Endpoint disable
USB_OTG_DOEPCTL_EPENA          EQU (0x80000000)       ; Endpoint enable

; ********************  Bit definition for USB_OTG_DOEPINT register  *******************
USB_OTG_DOEPINT_XFRC            EQU (0x00000001)         ; Transfer completed interrupt
USB_OTG_DOEPINT_EPDISD          EQU (0x00000002)         ; Endpoint disabled interrupt
USB_OTG_DOEPINT_STUP            EQU (0x00000008)         ; SETUP phase done
USB_OTG_DOEPINT_OTEPDIS         EQU (0x00000010)         ; OUT token received when endpoint disabled
USB_OTG_DOEPINT_B2BSTUP         EQU (0x00000040)         ; Back-to-back SETUP packets received
USB_OTG_DOEPINT_NYET            EQU (0x00004000)         ; NYET interrupt

; ********************  Bit definition for USB_OTG_DOEPTSIZ register  *******************

USB_OTG_DOEPTSIZ_XFRSIZ         EQU (0x0007FFFF)        ; Transfer size
USB_OTG_DOEPTSIZ_PKTCNT         EQU (0x1FF80000)        ; Packet count

USB_OTG_DOEPTSIZ_STUPCNT        EQU (0x60000000)        ; SETUP packet count
USB_OTG_DOEPTSIZ_STUPCNT_0      EQU (0x20000000)        ;Bit 0
USB_OTG_DOEPTSIZ_STUPCNT_1      EQU (0x40000000)        ;Bit 1

; ********************  Bit definition for PCGCCTL register  *******************
USB_OTG_PCGCCTL_STOPCLK         EQU (0x00000001)         ; SETUP packet count
USB_OTG_PCGCCTL_GATECLK         EQU (0x00000002)         ;Bit 0
USB_OTG_PCGCCTL_PHYSUSP         EQU (0x00000010)         ;Bit 1


    END